HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
/*-------------------------------------------------------------------------
 * PIC32MZ2048ECM100 processor header
 *
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCULTDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 *-------------------------------------------------------------------------*/
#include"p32mz2048ecm100_forVC.h"

volatile unsigned int        CFGCON __attribute__((section("sfrs")));
volatile __CFGCONbits_t CFGCONbits __asm__ ("CFGCON") __attribute__((section("sfrs")));
volatile unsigned int        DEVID __attribute__((section("sfrs")));
volatile __DEVIDbits_t DEVIDbits __asm__ ("DEVID") __attribute__((section("sfrs")));
volatile unsigned int        SYSKEY __attribute__((section("sfrs")));
volatile __SYSKEYbits_t SYSKEYbits __asm__ ("SYSKEY") __attribute__((section("sfrs")));
volatile unsigned int        PMD1 __attribute__((section("sfrs")));
volatile __PMD1bits_t PMD1bits __asm__ ("PMD1") __attribute__((section("sfrs")));
volatile unsigned int        PMD1CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD1SET __attribute__((section("sfrs")));
volatile unsigned int        PMD1INV __attribute__((section("sfrs")));
volatile unsigned int        PMD2 __attribute__((section("sfrs")));
volatile __PMD2bits_t PMD2bits __asm__ ("PMD2") __attribute__((section("sfrs")));
volatile unsigned int        PMD2CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD2SET __attribute__((section("sfrs")));
volatile unsigned int        PMD2INV __attribute__((section("sfrs")));
volatile unsigned int        PMD3 __attribute__((section("sfrs")));
volatile __PMD3bits_t PMD3bits __asm__ ("PMD3") __attribute__((section("sfrs")));
volatile unsigned int        PMD3CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD3SET __attribute__((section("sfrs")));
volatile unsigned int        PMD3INV __attribute__((section("sfrs")));
volatile unsigned int        PMD4 __attribute__((section("sfrs")));
volatile __PMD4bits_t PMD4bits __asm__ ("PMD4") __attribute__((section("sfrs")));
volatile unsigned int        PMD4CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD4SET __attribute__((section("sfrs")));
volatile unsigned int        PMD4INV __attribute__((section("sfrs")));
volatile unsigned int        PMD5 __attribute__((section("sfrs")));
volatile __PMD5bits_t PMD5bits __asm__ ("PMD5") __attribute__((section("sfrs")));
volatile unsigned int        PMD5CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD5SET __attribute__((section("sfrs")));
volatile unsigned int        PMD5INV __attribute__((section("sfrs")));
volatile unsigned int        PMD6 __attribute__((section("sfrs")));
volatile __PMD6bits_t PMD6bits __asm__ ("PMD6") __attribute__((section("sfrs")));
volatile unsigned int        PMD6CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD6SET __attribute__((section("sfrs")));
volatile unsigned int        PMD6INV __attribute__((section("sfrs")));
volatile unsigned int        PMD7 __attribute__((section("sfrs")));
volatile __PMD7bits_t PMD7bits __asm__ ("PMD7") __attribute__((section("sfrs")));
volatile unsigned int        PMD7CLR __attribute__((section("sfrs")));
volatile unsigned int        PMD7SET __attribute__((section("sfrs")));
volatile unsigned int        PMD7INV __attribute__((section("sfrs")));
volatile unsigned int        CFGEBIA __attribute__((section("sfrs")));
volatile __CFGEBIAbits_t CFGEBIAbits __asm__ ("CFGEBIA") __attribute__((section("sfrs")));
volatile unsigned int        CFGEBIACLR __attribute__((section("sfrs")));
volatile unsigned int        CFGEBIASET __attribute__((section("sfrs")));
volatile unsigned int        CFGEBIAINV __attribute__((section("sfrs")));
volatile unsigned int        CFGEBIC __attribute__((section("sfrs")));
volatile __CFGEBICbits_t CFGEBICbits __asm__ ("CFGEBIC") __attribute__((section("sfrs")));
volatile unsigned int        CFGEBICCLR __attribute__((section("sfrs")));
volatile unsigned int        CFGEBICSET __attribute__((section("sfrs")));
volatile unsigned int        CFGEBICINV __attribute__((section("sfrs")));
volatile unsigned int        CFGPG __attribute__((section("sfrs")));
volatile __CFGPGbits_t CFGPGbits __asm__ ("CFGPG") __attribute__((section("sfrs")));
volatile unsigned int        CFGPGCLR __attribute__((section("sfrs")));
volatile unsigned int        CFGPGSET __attribute__((section("sfrs")));
volatile unsigned int        CFGPGINV __attribute__((section("sfrs")));
volatile unsigned int        NVMCON __attribute__((section("sfrs")));
volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON") __attribute__((section("sfrs")));
volatile unsigned int        NVMCONCLR __attribute__((section("sfrs")));
volatile unsigned int        NVMCONSET __attribute__((section("sfrs")));
volatile unsigned int        NVMCONINV __attribute__((section("sfrs")));
volatile unsigned int        NVMKEY __attribute__((section("sfrs")));
volatile unsigned int        NVMADDR __attribute__((section("sfrs")));
volatile unsigned int        NVMADDRCLR __attribute__((section("sfrs")));
volatile unsigned int        NVMADDRSET __attribute__((section("sfrs")));
volatile unsigned int        NVMADDRINV __attribute__((section("sfrs")));
volatile unsigned int        NVMDATA0 __attribute__((section("sfrs")));
volatile unsigned int        NVMDATA1 __attribute__((section("sfrs")));
volatile unsigned int        NVMDATA2 __attribute__((section("sfrs")));
volatile unsigned int        NVMDATA3 __attribute__((section("sfrs")));
volatile unsigned int        NVMSRCADDR __attribute__((section("sfrs")));
volatile unsigned int        NVMPWP __attribute__((section("sfrs")));
volatile __NVMPWPbits_t NVMPWPbits __asm__ ("NVMPWP") __attribute__((section("sfrs")));
volatile unsigned int        NVMBWP __attribute__((section("sfrs")));
/*typedef struct {
  unsigned UBWP0:1;
  unsigned UBWP1:1;
  unsigned UBWP2:1;
  unsigned UBWP3:1;
  unsigned UBWP4:1;
  unsigned :2;
  unsigned UBWPULOCK:1;
  unsigned LBWP0:1;
  unsigned LBWP1:1;
  unsigned LBWP2:1;
  unsigned LBWP3:1;
  unsigned LBWP4:1;
  unsigned :2;
  unsigned LBWPULOCK:1;
} __NVMBWPbits_t;*/
