HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __REFO4CONbits_t REFO4CONbits __asm__ ("REFO4CON") __attribute__((section("sfrs")));
volatile unsigned int        REFO4CONCLR __attribute__((section("sfrs")));
volatile unsigned int        REFO4CONSET __attribute__((section("sfrs")));
volatile unsigned int        REFO4CONINV __attribute__((section("sfrs")));
volatile unsigned int        REFO4TRIM __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :23;
  unsigned ROTRIM:9;
} __REFO4TRIMbits_t;*/
volatile __REFO4TRIMbits_t REFO4TRIMbits __asm__ ("REFO4TRIM") __attribute__((section("sfrs")));
volatile unsigned int        REFO4TRIMCLR __attribute__((section("sfrs")));
volatile unsigned int        REFO4TRIMSET __attribute__((section("sfrs")));
volatile unsigned int        REFO4TRIMINV __attribute__((section("sfrs")));
volatile unsigned int        PB1DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
} __PB1DIVbits_t;*/
volatile __PB1DIVbits_t PB1DIVbits __asm__ ("PB1DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB1DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB1DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB1DIVINV __attribute__((section("sfrs")));
volatile unsigned int        PB2DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB2DIVbits_t;*/
volatile __PB2DIVbits_t PB2DIVbits __asm__ ("PB2DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB2DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB2DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB2DIVINV __attribute__((section("sfrs")));
volatile unsigned int        PB3DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB3DIVbits_t;*/
volatile __PB3DIVbits_t PB3DIVbits __asm__ ("PB3DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB3DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB3DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB3DIVINV __attribute__((section("sfrs")));
volatile unsigned int        PB4DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB4DIVbits_t;*/
volatile __PB4DIVbits_t PB4DIVbits __asm__ ("PB4DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB4DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB4DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB4DIVINV __attribute__((section("sfrs")));
volatile unsigned int        PB5DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB5DIVbits_t;*/
volatile __PB5DIVbits_t PB5DIVbits __asm__ ("PB5DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB5DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB5DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB5DIVINV __attribute__((section("sfrs")));
volatile unsigned int        PB7DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB7DIVbits_t;*/
volatile __PB7DIVbits_t PB7DIVbits __asm__ ("PB7DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB7DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB7DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB7DIVINV __attribute__((section("sfrs")));
volatile unsigned int        PB8DIV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB8DIVbits_t;*/
volatile __PB8DIVbits_t PB8DIVbits __asm__ ("PB8DIV") __attribute__((section("sfrs")));
volatile unsigned int        PB8DIVCLR __attribute__((section("sfrs")));
volatile unsigned int        PB8DIVSET __attribute__((section("sfrs")));
volatile unsigned int        PB8DIVINV __attribute__((section("sfrs")));
volatile unsigned int        INT1R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT1R:4;
} __INT1Rbits_t;*/
volatile __INT1Rbits_t INT1Rbits __asm__ ("INT1R") __attribute__((section("sfrs")));
volatile unsigned int        INT2R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT2R:4;
} __INT2Rbits_t;*/
volatile __INT2Rbits_t INT2Rbits __asm__ ("INT2R") __attribute__((section("sfrs")));
volatile unsigned int        INT3R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT3R:4;
} __INT3Rbits_t;*/
volatile __INT3Rbits_t INT3Rbits __asm__ ("INT3R") __attribute__((section("sfrs")));
volatile unsigned int        INT4R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT4R:4;
} __INT4Rbits_t;*/
volatile __INT4Rbits_t INT4Rbits __asm__ ("INT4R") __attribute__((section("sfrs")));
volatile unsigned int        T2CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T2CKR:4;
} __T2CKRbits_t;*/
volatile __T2CKRbits_t T2CKRbits __asm__ ("T2CKR") __attribute__((section("sfrs")));
volatile unsigned int        T3CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T3CKR:4;
} __T3CKRbits_t;*/
volatile __T3CKRbits_t T3CKRbits __asm__ ("T3CKR") __attribute__((section("sfrs")));
volatile unsigned int        T4CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T4CKR:4;
} __T4CKRbits_t;*/
volatile __T4CKRbits_t T4CKRbits __asm__ ("T4CKR") __attribute__((section("sfrs")));
volatile unsigned int        T5CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T5CKR:4;
} __T5CKRbits_t;*/
volatile __T5CKRbits_t T5CKRbits __asm__ ("T5CKR") __attribute__((section("sfrs")));
volatile unsigned int        T6CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T6CKR:4;
} __T6CKRbits_t;*/
volatile __T6CKRbits_t T6CKRbits __asm__ ("T6CKR") __attribute__((section("sfrs")));
volatile unsigned int        T7CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T7CKR:4;
} __T7CKRbits_t;*/
volatile __T7CKRbits_t T7CKRbits __asm__ ("T7CKR") __attribute__((section("sfrs")));
volatile unsigned int        T8CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T8CKR:4;
} __T8CKRbits_t;*/
volatile __T8CKRbits_t T8CKRbits __asm__ ("T8CKR") __attribute__((section("sfrs")));
volatile unsigned int        T9CKR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T9CKR:4;
} __T9CKRbits_t;*/
volatile __T9CKRbits_t T9CKRbits __asm__ ("T9CKR") __attribute__((section("sfrs")));
volatile unsigned int        IC1R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC1R:4;
} __IC1Rbits_t;*/
volatile __IC1Rbits_t IC1Rbits __asm__ ("IC1R") __attribute__((section("sfrs")));
volatile unsigned int        IC2R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC2R:4;
} __IC2Rbits_t;*/
volatile __IC2Rbits_t IC2Rbits __asm__ ("IC2R") __attribute__((section("sfrs")));
volatile unsigned int        IC3R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC3R:4;
} __IC3Rbits_t;*/
volatile __IC3Rbits_t IC3Rbits __asm__ ("IC3R") __attribute__((section("sfrs")));
volatile unsigned int        IC4R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC4R:4;
} __IC4Rbits_t;*/
