HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __IC4Rbits_t IC4Rbits __asm__ ("IC4R") __attribute__((section("sfrs")));
volatile unsigned int        IC5R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC5R:4;
} __IC5Rbits_t;*/
volatile __IC5Rbits_t IC5Rbits __asm__ ("IC5R") __attribute__((section("sfrs")));
volatile unsigned int        IC6R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC6R:4;
} __IC6Rbits_t;*/
volatile __IC6Rbits_t IC6Rbits __asm__ ("IC6R") __attribute__((section("sfrs")));
volatile unsigned int        IC7R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC7R:4;
} __IC7Rbits_t;*/
volatile __IC7Rbits_t IC7Rbits __asm__ ("IC7R") __attribute__((section("sfrs")));
volatile unsigned int        IC8R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC8R:4;
} __IC8Rbits_t;*/
volatile __IC8Rbits_t IC8Rbits __asm__ ("IC8R") __attribute__((section("sfrs")));
volatile unsigned int        IC9R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC9R:4;
} __IC9Rbits_t;*/
volatile __IC9Rbits_t IC9Rbits __asm__ ("IC9R") __attribute__((section("sfrs")));
volatile unsigned int        OCFAR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned OCFAR:4;
} __OCFARbits_t;*/
volatile __OCFARbits_t OCFARbits __asm__ ("OCFAR") __attribute__((section("sfrs")));
volatile unsigned int        U1RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U1RXR:4;
} __U1RXRbits_t;*/
volatile __U1RXRbits_t U1RXRbits __asm__ ("U1RXR") __attribute__((section("sfrs")));
volatile unsigned int        U1CTSR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U1CTSR:4;
} __U1CTSRbits_t;*/
volatile __U1CTSRbits_t U1CTSRbits __asm__ ("U1CTSR") __attribute__((section("sfrs")));
volatile unsigned int        U2RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U2RXR:4;
} __U2RXRbits_t;*/
volatile __U2RXRbits_t U2RXRbits __asm__ ("U2RXR") __attribute__((section("sfrs")));
volatile unsigned int        U2CTSR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U2CTSR:4;
} __U2CTSRbits_t;*/
volatile __U2CTSRbits_t U2CTSRbits __asm__ ("U2CTSR") __attribute__((section("sfrs")));
volatile unsigned int        U3RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U3RXR:4;
} __U3RXRbits_t;*/
volatile __U3RXRbits_t U3RXRbits __asm__ ("U3RXR") __attribute__((section("sfrs")));
volatile unsigned int        U3CTSR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U3CTSR:4;
} __U3CTSRbits_t;*/
volatile __U3CTSRbits_t U3CTSRbits __asm__ ("U3CTSR") __attribute__((section("sfrs")));
volatile unsigned int        U4RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U4RXR:4;
} __U4RXRbits_t;*/
volatile __U4RXRbits_t U4RXRbits __asm__ ("U4RXR") __attribute__((section("sfrs")));
volatile unsigned int        U4CTSR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U4CTSR:4;
} __U4CTSRbits_t;*/
volatile __U4CTSRbits_t U4CTSRbits __asm__ ("U4CTSR") __attribute__((section("sfrs")));
volatile unsigned int        U5RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U5RXR:4;
} __U5RXRbits_t;*/
volatile __U5RXRbits_t U5RXRbits __asm__ ("U5RXR") __attribute__((section("sfrs")));
volatile unsigned int        U5CTSR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U5CTSR:4;
} __U5CTSRbits_t;*/
volatile __U5CTSRbits_t U5CTSRbits __asm__ ("U5CTSR") __attribute__((section("sfrs")));
volatile unsigned int        U6RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U6RXR:4;
} __U6RXRbits_t;*/
volatile __U6RXRbits_t U6RXRbits __asm__ ("U6RXR") __attribute__((section("sfrs")));
volatile unsigned int        U6CTSR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned U6CTSR:4;
} __U6CTSRbits_t;*/
volatile __U6CTSRbits_t U6CTSRbits __asm__ ("U6CTSR") __attribute__((section("sfrs")));
volatile unsigned int        SDI1R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI1R:4;
} __SDI1Rbits_t;*/
volatile __SDI1Rbits_t SDI1Rbits __asm__ ("SDI1R") __attribute__((section("sfrs")));
volatile unsigned int        SS1R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS1R:4;
} __SS1Rbits_t;*/
volatile __SS1Rbits_t SS1Rbits __asm__ ("SS1R") __attribute__((section("sfrs")));
volatile unsigned int        SDI2R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI2R:4;
} __SDI2Rbits_t;*/
volatile __SDI2Rbits_t SDI2Rbits __asm__ ("SDI2R") __attribute__((section("sfrs")));
volatile unsigned int        SS2R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS2R:4;
} __SS2Rbits_t;*/
volatile __SS2Rbits_t SS2Rbits __asm__ ("SS2R") __attribute__((section("sfrs")));
volatile unsigned int        SDI3R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI3R:4;
} __SDI3Rbits_t;*/
volatile __SDI3Rbits_t SDI3Rbits __asm__ ("SDI3R") __attribute__((section("sfrs")));
volatile unsigned int        SS3R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS3R:4;
} __SS3Rbits_t;*/
volatile __SS3Rbits_t SS3Rbits __asm__ ("SS3R") __attribute__((section("sfrs")));
volatile unsigned int        SDI4R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI4R:4;
} __SDI4Rbits_t;*/
volatile __SDI4Rbits_t SDI4Rbits __asm__ ("SDI4R") __attribute__((section("sfrs")));
volatile unsigned int        SS4R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS4R:4;
} __SS4Rbits_t;*/
volatile __SS4Rbits_t SS4Rbits __asm__ ("SS4R") __attribute__((section("sfrs")));
volatile unsigned int        SDI5R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI5R:4;
} __SDI5Rbits_t;*/
volatile __SDI5Rbits_t SDI5Rbits __asm__ ("SDI5R") __attribute__((section("sfrs")));
volatile unsigned int        SS5R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS5R:4;
} __SS5Rbits_t;*/
volatile __SS5Rbits_t SS5Rbits __asm__ ("SS5R") __attribute__((section("sfrs")));
volatile unsigned int        SDI6R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI6R:4;
} __SDI6Rbits_t;*/
volatile __SDI6Rbits_t SDI6Rbits __asm__ ("SDI6R") __attribute__((section("sfrs")));
volatile unsigned int        SS6R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS6R:4;
} __SS6Rbits_t;*/
volatile __SS6Rbits_t SS6Rbits __asm__ ("SS6R") __attribute__((section("sfrs")));
volatile unsigned int        C1RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned C1RXR:4;
} __C1RXRbits_t;*/
volatile __C1RXRbits_t C1RXRbits __asm__ ("C1RXR") __attribute__((section("sfrs")));
volatile unsigned int        C2RXR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned C2RXR:4;
} __C2RXRbits_t;*/
volatile __C2RXRbits_t C2RXRbits __asm__ ("C2RXR") __attribute__((section("sfrs")));
volatile unsigned int        REFCLKI1R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned REFCLKI1R:4;
} __REFCLKI1Rbits_t;*/
volatile __REFCLKI1Rbits_t REFCLKI1Rbits __asm__ ("REFCLKI1R") __attribute__((section("sfrs")));
volatile unsigned int        REFCLKI3R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned REFCLKI3R:4;
} __REFCLKI3Rbits_t;*/
volatile __REFCLKI3Rbits_t REFCLKI3Rbits __asm__ ("REFCLKI3R") __attribute__((section("sfrs")));
volatile unsigned int        REFCLKI4R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned REFCLKI4R:4;
} __REFCLKI4Rbits_t;*/
volatile __REFCLKI4Rbits_t REFCLKI4Rbits __asm__ ("REFCLKI4R") __attribute__((section("sfrs")));
volatile unsigned int        RPA14R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPA14R:4;
} __RPA14Rbits_t;*/
volatile __RPA14Rbits_t RPA14Rbits __asm__ ("RPA14R") __attribute__((section("sfrs")));
volatile unsigned int        RPA15R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPA15R:4;
} __RPA15Rbits_t;*/
volatile __RPA15Rbits_t RPA15Rbits __asm__ ("RPA15R") __attribute__((section("sfrs")));
volatile unsigned int        RPB0R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB0R:4;
} __RPB0Rbits_t;*/
volatile __RPB0Rbits_t RPB0Rbits __asm__ ("RPB0R") __attribute__((section("sfrs")));
volatile unsigned int        RPB1R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB1R:4;
} __RPB1Rbits_t;*/
volatile __RPB1Rbits_t RPB1Rbits __asm__ ("RPB1R") __attribute__((section("sfrs")));
volatile unsigned int        RPB2R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB2R:4;
} __RPB2Rbits_t;*/
volatile __RPB2Rbits_t RPB2Rbits __asm__ ("RPB2R") __attribute__((section("sfrs")));
volatile unsigned int        RPB3R __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB3R:4;
} __RPB3Rbits_t;*/
