HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __IFS0bits_t IFS0bits __asm__ ("IFS0") __attribute__((section("sfrs")));
volatile unsigned int        IFS0CLR __attribute__((section("sfrs")));
volatile unsigned int        IFS0SET __attribute__((section("sfrs")));
volatile unsigned int        IFS0INV __attribute__((section("sfrs")));
volatile unsigned int        IFS1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T7IF:1;
    unsigned IC7EIF:1;
    unsigned IC7IF:1;
    unsigned OC7IF:1;
    unsigned T8IF:1;
    unsigned IC8EIF:1;
    unsigned IC8IF:1;
    unsigned OC8IF:1;
    unsigned T9IF:1;
    unsigned IC9EIF:1;
    unsigned IC9IF:1;
    unsigned OC9IF:1;
    unsigned AD1IF:1;
    unsigned :1;
    unsigned AD1DC1IF:1;
    unsigned AD1DC2IF:1;
    unsigned AD1DC3IF:1;
    unsigned AD1DC4IF:1;
    unsigned AD1DC5IF:1;
    unsigned AD1DC6IF:1;
    unsigned AD1DF1IF:1;
    unsigned AD1DF2IF:1;
    unsigned AD1DF3IF:1;
    unsigned AD1DF4IF:1;
    unsigned AD1DF5IF:1;
    unsigned AD1DF6IF:1;
    unsigned :1;
    unsigned AD1D0IF:1;
    unsigned AD1D1IF:1;
    unsigned AD1D2IF:1;
    unsigned AD1D3IF:1;
    unsigned AD1D4IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS1bits_t;*/
volatile __IFS1bits_t IFS1bits __asm__ ("IFS1") __attribute__((section("sfrs")));
volatile unsigned int        IFS1CLR __attribute__((section("sfrs")));
volatile unsigned int        IFS1SET __attribute__((section("sfrs")));
volatile unsigned int        IFS1INV __attribute__((section("sfrs")));
volatile unsigned int        IFS2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D5IF:1;
    unsigned AD1D6IF:1;
    unsigned AD1D7IF:1;
    unsigned AD1D8IF:1;
    unsigned AD1D9IF:1;
    unsigned AD1D10IF:1;
    unsigned AD1D11IF:1;
    unsigned AD1D12IF:1;
    unsigned AD1D13IF:1;
    unsigned AD1D14IF:1;
    unsigned AD1D15IF:1;
    unsigned AD1D16IF:1;
    unsigned AD1D17IF:1;
    unsigned AD1D18IF:1;
    unsigned AD1D19IF:1;
    unsigned AD1D20IF:1;
    unsigned AD1D21IF:1;
    unsigned AD1D22IF:1;
    unsigned AD1D23IF:1;
    unsigned AD1D24IF:1;
    unsigned AD1D25IF:1;
    unsigned AD1D26IF:1;
    unsigned AD1D27IF:1;
    unsigned AD1D28IF:1;
    unsigned AD1D29IF:1;
    unsigned AD1D30IF:1;
    unsigned AD1D31IF:1;
    unsigned AD1D32IF:1;
    unsigned AD1D33IF:1;
    unsigned AD1D34IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS2bits_t;*/
volatile __IFS2bits_t IFS2bits __asm__ ("IFS2") __attribute__((section("sfrs")));
volatile unsigned int        IFS2CLR __attribute__((section("sfrs")));
volatile unsigned int        IFS2SET __attribute__((section("sfrs")));
volatile unsigned int        IFS2INV __attribute__((section("sfrs")));
volatile unsigned int        IFS3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :6;
    unsigned AD1D43IF:1;
    unsigned AD1D44IF:1;
    unsigned CPCIF:1;
    unsigned CFDCIF:1;
    unsigned SBIF:1;
    unsigned CRPTIF:1;
    unsigned :1;
    unsigned SPI1EIF:1;
    unsigned SPI1RXIF:1;
    unsigned SPI1TXIF:1;
    unsigned U1EIF:1;
    unsigned U1RXIF:1;
    unsigned U1TXIF:1;
    unsigned I2C1BIF:1;
    unsigned I2C1SIF:1;
    unsigned I2C1MIF:1;
    unsigned CNAIF:1;
    unsigned CNBIF:1;
    unsigned CNCIF:1;
    unsigned CNDIF:1;
    unsigned CNEIF:1;
    unsigned CNFIF:1;
    unsigned CNGIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS3bits_t;*/
volatile __IFS3bits_t IFS3bits __asm__ ("IFS3") __attribute__((section("sfrs")));
volatile unsigned int        IFS3CLR __attribute__((section("sfrs")));
volatile unsigned int        IFS3SET __attribute__((section("sfrs")));
volatile unsigned int        IFS3INV __attribute__((section("sfrs")));
volatile unsigned int        IFS4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMPIF:1;
    unsigned PMPEIF:1;
    unsigned CMP1IF:1;
    unsigned CMP2IF:1;
    unsigned USBIF:1;
    unsigned USBDMAIF:1;
    unsigned DMA0IF:1;
    unsigned DMA1IF:1;
    unsigned DMA2IF:1;
    unsigned DMA3IF:1;
    unsigned DMA4IF:1;
    unsigned DMA5IF:1;
    unsigned DMA6IF:1;
    unsigned DMA7IF:1;
    unsigned SPI2EIF:1;
    unsigned SPI2RXIF:1;
    unsigned SPI2TXIF:1;
    unsigned U2EIF:1;
    unsigned U2RXIF:1;
    unsigned U2TXIF:1;
    unsigned I2C2BIF:1;
    unsigned I2C2SIF:1;
    unsigned I2C2MIF:1;
    unsigned CAN1IF:1;
    unsigned CAN2IF:1;
    unsigned ETHIF:1;
    unsigned SPI3EIF:1;
    unsigned SPI3RXIF:1;
    unsigned SPI3TXIF:1;
    unsigned U3EIF:1;
    unsigned U3RXIF:1;
    unsigned U3TXIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS4bits_t;*/
volatile __IFS4bits_t IFS4bits __asm__ ("IFS4") __attribute__((section("sfrs")));
volatile unsigned int        IFS4CLR __attribute__((section("sfrs")));
volatile unsigned int        IFS4SET __attribute__((section("sfrs")));
volatile unsigned int        IFS4INV __attribute__((section("sfrs")));
volatile unsigned int        IFS5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C3BIF:1;
    unsigned I2C3SIF:1;
    unsigned I2C3MIF:1;
    unsigned SPI4EIF:1;
    unsigned SPI4RXIF:1;
    unsigned SPI4TXIF:1;
    unsigned RTCCIF:1;
    unsigned FCEIF:1;
    unsigned PREIF:1;
    unsigned SQI1IF:1;
    unsigned U4EIF:1;
    unsigned U4RXIF:1;
    unsigned U4TXIF:1;
    unsigned I2C4BIF:1;
    unsigned I2C4SIF:1;
    unsigned I2C4MIF:1;
    unsigned SPI5EIF:1;
    unsigned SPI5RXIF:1;
    unsigned SPI5TXIF:1;
    unsigned U5EIF:1;
    unsigned U5RXIF:1;
    unsigned U5TXIF:1;
    unsigned I2C5BIF:1;
    unsigned I2C5SIF:1;
    unsigned I2C5MIF:1;
    unsigned SPI6IF:1;
    unsigned SPI6RXIF:1;
    unsigned SPI6TX:1;
    unsigned U6EIF:1;
    unsigned U6RXIF:1;
    unsigned U6TXIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS5bits_t;*/
volatile __IFS5bits_t IFS5bits __asm__ ("IFS5") __attribute__((section("sfrs")));
volatile unsigned int        IFS5CLR __attribute__((section("sfrs")));
volatile unsigned int        IFS5SET __attribute__((section("sfrs")));
volatile unsigned int        IFS5INV __attribute__((section("sfrs")));
volatile unsigned int        IEC0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CTIE:1;
    unsigned CS0IE:1;
    unsigned CS1IE:1;
    unsigned INT0IE:1;
    unsigned T1IE:1;
    unsigned IC1EIE:1;
    unsigned IC1IE:1;
    unsigned OC1IE:1;
    unsigned INT1IE:1;
    unsigned T2IE:1;
    unsigned IC2EIE:1;
    unsigned IC2IE:1;
    unsigned OC2IE:1;
    unsigned INT2IE:1;
    unsigned T3IE:1;
    unsigned IC3EIE:1;
    unsigned IC3IE:1;
    unsigned OC3IE:1;
    unsigned INT3IE:1;
    unsigned T4IE:1;
    unsigned IC4EIE:1;
    unsigned IC4IE:1;
    unsigned OC4IE:1;
    unsigned INT4IE:1;
    unsigned T5IE:1;
    unsigned IC5EIE:1;
    unsigned IC5IE:1;
    unsigned OC5IE:1;
    unsigned T6IE:1;
    unsigned IC6EIE:1;
    unsigned IC6IE:1;
    unsigned OC6IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC0bits_t;*/
volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs")));
volatile unsigned int        IEC0CLR __attribute__((section("sfrs")));
volatile unsigned int        IEC0SET __attribute__((section("sfrs")));
volatile unsigned int        IEC0INV __attribute__((section("sfrs")));
volatile unsigned int        IEC1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T7IE:1;
    unsigned IC7EIE:1;
    unsigned IC7IE:1;
    unsigned OC7IE:1;
    unsigned T8IE:1;
    unsigned IC8EIE:1;
    unsigned IC8IE:1;
    unsigned OC8IE:1;
    unsigned T9IE:1;
    unsigned IC9EIE:1;
    unsigned IC9IE:1;
    unsigned OC9IE:1;
    unsigned AD1IE:1;
    unsigned :1;
    unsigned AD1DC1IE:1;
    unsigned AD1DC2IE:1;
    unsigned AD1DC3IE:1;
    unsigned AD1DC4IE:1;
    unsigned AD1DC5IE:1;
    unsigned AD1DC6IE:1;
    unsigned AD1DF1IE:1;
    unsigned AD1DF2IE:1;
    unsigned AD1DF3IE:1;
    unsigned AD1DF4IE:1;
    unsigned AD1DF5IE:1;
    unsigned AD1DF6IE:1;
    unsigned :1;
    unsigned AD1D0IE:1;
    unsigned AD1D1IE:1;
    unsigned AD1D2IE:1;
    unsigned AD1D3IE:1;
    unsigned AD1D4IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC1bits_t;*/
volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs")));
volatile unsigned int        IEC1CLR __attribute__((section("sfrs")));
volatile unsigned int        IEC1SET __attribute__((section("sfrs")));
volatile unsigned int        IEC1INV __attribute__((section("sfrs")));
volatile unsigned int        IEC2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D5IE:1;
    unsigned AD1D6IE:1;
    unsigned AD1D7IE:1;
    unsigned AD1D8IE:1;
    unsigned AD1D9IE:1;
    unsigned AD1D10IE:1;
    unsigned AD1D11IE:1;
    unsigned AD1D12IE:1;
    unsigned AD1D13IE:1;
    unsigned AD1D14IE:1;
    unsigned AD1D15IE:1;
    unsigned AD1D16IE:1;
    unsigned AD1D17IE:1;
    unsigned AD1D18IE:1;
    unsigned AD1D19IE:1;
    unsigned AD1D20IE:1;
    unsigned AD1D21IE:1;
    unsigned AD1D22IE:1;
    unsigned AD1D23IE:1;
    unsigned AD1D24IE:1;
    unsigned AD1D25IE:1;
    unsigned AD1D26IE:1;
    unsigned AD1D27IE:1;
    unsigned AD1D28IE:1;
    unsigned AD1D29IE:1;
    unsigned AD1D30IE:1;
    unsigned AD1D31IE:1;
    unsigned AD1D32IE:1;
    unsigned AD1D33IE:1;
    unsigned AD1D34IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC2bits_t;*/
volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs")));
volatile unsigned int        IEC2CLR __attribute__((section("sfrs")));
volatile unsigned int        IEC2SET __attribute__((section("sfrs")));
volatile unsigned int        IEC2INV __attribute__((section("sfrs")));
volatile unsigned int        IEC3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :6;
    unsigned AD1D43IE:1;
    unsigned AD1D44IE:1;
    unsigned CPCIE:1;
    unsigned CFDCIE:1;
    unsigned SBIE:1;
    unsigned CRPTIE:1;
    unsigned :1;
    unsigned SPI1EIE:1;
    unsigned SPI1RXIE:1;
    unsigned SPI1TXIE:1;
    unsigned U1EIE:1;
    unsigned U1RXIE:1;
    unsigned U1TXIE:1;
    unsigned I2C1BIE:1;
    unsigned I2C1SIE:1;
    unsigned I2C1MIE:1;
    unsigned CNAIE:1;
    unsigned CNBIE:1;
    unsigned CNCIE:1;
    unsigned CNDIE:1;
    unsigned CNEIE:1;
    unsigned CNFIE:1;
    unsigned CNGIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC3bits_t;*/
volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs")));
volatile unsigned int        IEC3CLR __attribute__((section("sfrs")));
volatile unsigned int        IEC3SET __attribute__((section("sfrs")));
volatile unsigned int        IEC3INV __attribute__((section("sfrs")));
volatile unsigned int        IEC4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMPIE:1;
    unsigned PMPEIE:1;
    unsigned CMP1IE:1;
    unsigned CMP2IE:1;
    unsigned USBIE:1;
    unsigned USBDMAIE:1;
    unsigned DMA0IE:1;
    unsigned DMA1IE:1;
    unsigned DMA2IE:1;
    unsigned DMA3IE:1;
    unsigned DMA4IE:1;
    unsigned DMA5IE:1;
    unsigned DMA6IE:1;
    unsigned DMA7IE:1;
    unsigned SPI2EIE:1;
    unsigned SPI2RXIE:1;
    unsigned SPI2TXIE:1;
    unsigned U2EIE:1;
    unsigned U2RXIE:1;
    unsigned U2TXIE:1;
    unsigned I2C2BIE:1;
    unsigned I2C2SIE:1;
    unsigned I2C2MIE:1;
    unsigned CAN1IE:1;
    unsigned CAN2IE:1;
    unsigned ETHIE:1;
    unsigned SPI3EIE:1;
    unsigned SPI3RXIE:1;
    unsigned SPI3TXIE:1;
    unsigned U3EIE:1;
    unsigned U3RXIE:1;
    unsigned U3TXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC4bits_t;*/
volatile __IEC4bits_t IEC4bits __asm__ ("IEC4") __attribute__((section("sfrs")));
volatile unsigned int        IEC4CLR __attribute__((section("sfrs")));
volatile unsigned int        IEC4SET __attribute__((section("sfrs")));
volatile unsigned int        IEC4INV __attribute__((section("sfrs")));
volatile unsigned int        IEC5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C3BIE:1;
    unsigned I2C3SIE:1;
    unsigned I2C3MIE:1;
    unsigned SPI4EIE:1;
    unsigned SPI4RXIE:1;
    unsigned SPI4TXIE:1;
    unsigned RTCCIE:1;
    unsigned FCEIE:1;
    unsigned PREIE:1;
    unsigned SQI1IE:1;
    unsigned U4EIE:1;
    unsigned U4RXIE:1;
    unsigned U4TXIE:1;
    unsigned I2C4BIE:1;
    unsigned I2C4SIE:1;
    unsigned I2C4MIE:1;
    unsigned SPI5EIE:1;
    unsigned SPI5RXIE:1;
    unsigned SPI5TXIE:1;
    unsigned U5EIE:1;
    unsigned U5RXIE:1;
    unsigned U5TXIE:1;
    unsigned I2C5BIE:1;
    unsigned I2C5SIE:1;
    unsigned I2C5MIE:1;
    unsigned SPI6IE:1;
    unsigned SPI6RXIE:1;
    unsigned SPI6TXIE:1;
    unsigned U6EIE:1;
    unsigned U6RXIE:1;
    unsigned U6TXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC5bits_t;*/
volatile __IEC5bits_t IEC5bits __asm__ ("IEC5") __attribute__((section("sfrs")));
volatile unsigned int        IEC5CLR __attribute__((section("sfrs")));
volatile unsigned int        IEC5SET __attribute__((section("sfrs")));
volatile unsigned int        IEC5INV __attribute__((section("sfrs")));
volatile unsigned int        IPC0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CTIS:2;
    unsigned CTIP:3;
    unsigned :3;
    unsigned CS0IS:2;
    unsigned CS0IP:3;
    unsigned :3;
    unsigned CS1IS:2;
    unsigned CS1IP:3;
    unsigned :3;
    unsigned INT0IS:2;
    unsigned INT0IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC0bits_t;*/
