HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __IPC0bits_t IPC0bits __asm__ ("IPC0") __attribute__((section("sfrs")));
volatile unsigned int        IPC0CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC0SET __attribute__((section("sfrs")));
volatile unsigned int        IPC0INV __attribute__((section("sfrs")));
volatile unsigned int        IPC1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T1IS:2;
    unsigned T1IP:3;
    unsigned :3;
    unsigned IC1EIS:2;
    unsigned IC1EIP:3;
    unsigned :3;
    unsigned IC1IS:2;
    unsigned IC1IP:3;
    unsigned :3;
    unsigned OC1IS:2;
    unsigned OC1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC1bits_t;*/
volatile __IPC1bits_t IPC1bits __asm__ ("IPC1") __attribute__((section("sfrs")));
volatile unsigned int        IPC1CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC1SET __attribute__((section("sfrs")));
volatile unsigned int        IPC1INV __attribute__((section("sfrs")));
volatile unsigned int        IPC2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned INT1IS:2;
    unsigned INT1IP:3;
    unsigned :3;
    unsigned T2IS:2;
    unsigned T2IP:3;
    unsigned :3;
    unsigned IC2EIS:2;
    unsigned IC2EIP:3;
    unsigned :3;
    unsigned IC2IS:2;
    unsigned IC2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC2bits_t;*/
volatile __IPC2bits_t IPC2bits __asm__ ("IPC2") __attribute__((section("sfrs")));
volatile unsigned int        IPC2CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC2SET __attribute__((section("sfrs")));
volatile unsigned int        IPC2INV __attribute__((section("sfrs")));
volatile unsigned int        IPC3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OC2IS:2;
    unsigned OC2IP:3;
    unsigned :3;
    unsigned INT2IS:2;
    unsigned INT2IP:3;
    unsigned :3;
    unsigned T3IS:2;
    unsigned T3IP:3;
    unsigned :3;
    unsigned IC3EIS:2;
    unsigned IC3EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC3bits_t;*/
volatile __IPC3bits_t IPC3bits __asm__ ("IPC3") __attribute__((section("sfrs")));
volatile unsigned int        IPC3CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC3SET __attribute__((section("sfrs")));
volatile unsigned int        IPC3INV __attribute__((section("sfrs")));
volatile unsigned int        IPC4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned IC3IS:2;
    unsigned IC3IP:3;
    unsigned :3;
    unsigned OC3IS:2;
    unsigned OC3IP:3;
    unsigned :3;
    unsigned INT3IS:2;
    unsigned INT3IP:3;
    unsigned :3;
    unsigned T4IS:2;
    unsigned T4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC4bits_t;*/
volatile __IPC4bits_t IPC4bits __asm__ ("IPC4") __attribute__((section("sfrs")));
volatile unsigned int        IPC4CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC4SET __attribute__((section("sfrs")));
volatile unsigned int        IPC4INV __attribute__((section("sfrs")));
volatile unsigned int        IPC5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned IC4EIS:2;
    unsigned IC4EIP:3;
    unsigned :3;
    unsigned IC4IS:2;
    unsigned IC4IP:3;
    unsigned :3;
    unsigned OC4IS:2;
    unsigned OC4IP:3;
    unsigned :3;
    unsigned INT4IS:2;
    unsigned INT4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC5bits_t;*/
volatile __IPC5bits_t IPC5bits __asm__ ("IPC5") __attribute__((section("sfrs")));
volatile unsigned int        IPC5CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC5SET __attribute__((section("sfrs")));
volatile unsigned int        IPC5INV __attribute__((section("sfrs")));
volatile unsigned int        IPC6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T5IS:2;
    unsigned T5IP:3;
    unsigned :3;
    unsigned IC5EIS:2;
    unsigned IC5EIP:3;
    unsigned :3;
    unsigned IC5IS:2;
    unsigned IC5IP:3;
    unsigned :3;
    unsigned OC5IS:2;
    unsigned OC5IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC6bits_t;*/
volatile __IPC6bits_t IPC6bits __asm__ ("IPC6") __attribute__((section("sfrs")));
volatile unsigned int        IPC6CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC6SET __attribute__((section("sfrs")));
volatile unsigned int        IPC6INV __attribute__((section("sfrs")));
volatile unsigned int        IPC7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T6IS:2;
    unsigned T6IP:3;
    unsigned :3;
    unsigned IC6EIS:2;
    unsigned IC6EIP:3;
    unsigned :3;
    unsigned IC6IS:2;
    unsigned IC6IP:3;
    unsigned :3;
    unsigned OC6IS:2;
    unsigned OC6IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC7bits_t;*/
volatile __IPC7bits_t IPC7bits __asm__ ("IPC7") __attribute__((section("sfrs")));
volatile unsigned int        IPC7CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC7SET __attribute__((section("sfrs")));
volatile unsigned int        IPC7INV __attribute__((section("sfrs")));
volatile unsigned int        IPC8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T7IS:2;
    unsigned T7IP:3;
    unsigned :3;
    unsigned IC7EIS:2;
    unsigned IC7EIP:3;
    unsigned :3;
    unsigned IC7IS:2;
    unsigned IC7IP:3;
    unsigned :3;
    unsigned OC7IS:2;
    unsigned OC7IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC8bits_t;*/
volatile __IPC8bits_t IPC8bits __asm__ ("IPC8") __attribute__((section("sfrs")));
volatile unsigned int        IPC8CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC8SET __attribute__((section("sfrs")));
volatile unsigned int        IPC8INV __attribute__((section("sfrs")));
volatile unsigned int        IPC9 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T8IS:2;
    unsigned T8IP:3;
    unsigned :3;
    unsigned IC8EIS:2;
    unsigned IC8EIP:3;
    unsigned :3;
    unsigned IC8IS:2;
    unsigned IC8IP:3;
    unsigned :3;
    unsigned OC8IS:2;
    unsigned OC8IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC9bits_t;*/
