HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __IPC9bits_t IPC9bits __asm__ ("IPC9") __attribute__((section("sfrs")));
volatile unsigned int        IPC9CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC9SET __attribute__((section("sfrs")));
volatile unsigned int        IPC9INV __attribute__((section("sfrs")));
volatile unsigned int        IPC10 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T9IS:2;
    unsigned T9IP:3;
    unsigned :3;
    unsigned IC9EIS:2;
    unsigned IC9EIP:3;
    unsigned :3;
    unsigned IC9IS:2;
    unsigned IC9IP:3;
    unsigned :3;
    unsigned OC9IS:2;
    unsigned OC9IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC10bits_t;*/
volatile __IPC10bits_t IPC10bits __asm__ ("IPC10") __attribute__((section("sfrs")));
volatile unsigned int        IPC10CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC10SET __attribute__((section("sfrs")));
volatile unsigned int        IPC10INV __attribute__((section("sfrs")));
volatile unsigned int        IPC11 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1IS:2;
    unsigned AD1IP:3;
    unsigned :11;
    unsigned AD1DC1IS:2;
    unsigned AD1DC1IP:3;
    unsigned :3;
    unsigned AD1DC2IS:2;
    unsigned AD1DC2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC11bits_t;*/
volatile __IPC11bits_t IPC11bits __asm__ ("IPC11") __attribute__((section("sfrs")));
volatile unsigned int        IPC11CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC11SET __attribute__((section("sfrs")));
volatile unsigned int        IPC11INV __attribute__((section("sfrs")));
volatile unsigned int        IPC12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1DC3IS:2;
    unsigned AD1DC3IP:3;
    unsigned :3;
    unsigned AD1DC4IS:2;
    unsigned AD1DC4IP:3;
    unsigned :3;
    unsigned AD1DC5IS:2;
    unsigned AD1DC5IP:3;
    unsigned :3;
    unsigned AD1DC6IS:2;
    unsigned AD1DC6IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC12bits_t;*/
volatile __IPC12bits_t IPC12bits __asm__ ("IPC12") __attribute__((section("sfrs")));
volatile unsigned int        IPC12CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC12SET __attribute__((section("sfrs")));
volatile unsigned int        IPC12INV __attribute__((section("sfrs")));
volatile unsigned int        IPC13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1DF1IS:2;
    unsigned AD1DF1IP:3;
    unsigned :3;
    unsigned AD1DF2IS:2;
    unsigned AD1DF2IP:3;
    unsigned :3;
    unsigned AD1DF3IS:2;
    unsigned AD1DF3IP:3;
    unsigned :3;
    unsigned AD1DF4IS:2;
    unsigned AD1DF4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC13bits_t;*/
volatile __IPC13bits_t IPC13bits __asm__ ("IPC13") __attribute__((section("sfrs")));
volatile unsigned int        IPC13CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC13SET __attribute__((section("sfrs")));
volatile unsigned int        IPC13INV __attribute__((section("sfrs")));
volatile unsigned int        IPC14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1DF5IS:2;
    unsigned AD1DF5IP:3;
    unsigned :3;
    unsigned AD1DF6IS:2;
    unsigned AD1DF6IP:3;
    unsigned :11;
    unsigned AD1D0IS:2;
    unsigned AD1D0IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC14bits_t;*/
volatile __IPC14bits_t IPC14bits __asm__ ("IPC14") __attribute__((section("sfrs")));
volatile unsigned int        IPC14CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC14SET __attribute__((section("sfrs")));
volatile unsigned int        IPC14INV __attribute__((section("sfrs")));
volatile unsigned int        IPC15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D1IS:2;
    unsigned AD1D1IP:3;
    unsigned :3;
    unsigned AD1D2IS:2;
    unsigned AD1D2IP:3;
    unsigned :3;
    unsigned AD1D3IS:2;
    unsigned AD1D3IP:3;
    unsigned :3;
    unsigned AD1D4IS:2;
    unsigned AD1D4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC15bits_t;*/
volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs")));
volatile unsigned int        IPC15CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC15SET __attribute__((section("sfrs")));
volatile unsigned int        IPC15INV __attribute__((section("sfrs")));
volatile unsigned int        IPC16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D5IS:2;
    unsigned AD1D5IP:3;
    unsigned :3;
    unsigned AD1D6IS:2;
    unsigned AD1D6IP:3;
    unsigned :3;
    unsigned AD1D7IS:2;
    unsigned AD1D7IP:3;
    unsigned :3;
    unsigned AD1D8IS:2;
    unsigned AD1D8IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC16bits_t;*/
volatile __IPC16bits_t IPC16bits __asm__ ("IPC16") __attribute__((section("sfrs")));
volatile unsigned int        IPC16CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC16SET __attribute__((section("sfrs")));
volatile unsigned int        IPC16INV __attribute__((section("sfrs")));
volatile unsigned int        IPC17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D9IS:2;
    unsigned AD1D9IP:3;
    unsigned :3;
    unsigned AD1D10IS:2;
    unsigned AD1D10IP:3;
    unsigned :3;
    unsigned AD1D11IS:2;
    unsigned AD1D11IP:3;
    unsigned :3;
    unsigned AD1D12IS:2;
    unsigned AD1D12IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC17bits_t;*/
volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs")));
volatile unsigned int        IPC17CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC17SET __attribute__((section("sfrs")));
volatile unsigned int        IPC17INV __attribute__((section("sfrs")));
volatile unsigned int        IPC18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D13IS:2;
    unsigned AD1D13IP:3;
    unsigned :3;
    unsigned AD1D14IS:2;
    unsigned AD1D14IP:3;
    unsigned :3;
    unsigned AD1D15IS:2;
    unsigned AD1D15IP:3;
    unsigned :3;
    unsigned AD1D16IS:2;
    unsigned AD1D16IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC18bits_t;*/
volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs")));
volatile unsigned int        IPC18CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC18SET __attribute__((section("sfrs")));
volatile unsigned int        IPC18INV __attribute__((section("sfrs")));
volatile unsigned int        IPC19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AD1D17IS:2;
    unsigned AD1D17IP:3;
    unsigned :3;
    unsigned AD1D18IS:2;
    unsigned AD1D18IP:3;
    unsigned :3;
    unsigned AD1D19IS:2;
    unsigned AD1D19IP:3;
    unsigned :3;
    unsigned AD1D20IS:2;
    unsigned AD1D20IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC19bits_t;*/
