HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __IPC33bits_t IPC33bits __asm__ ("IPC33") __attribute__((section("sfrs")));
volatile unsigned int        IPC33CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC33SET __attribute__((section("sfrs")));
volatile unsigned int        IPC33INV __attribute__((section("sfrs")));
volatile unsigned int        IPC34 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DMA2IS:2;
    unsigned DMA2IP:3;
    unsigned :3;
    unsigned DMA3IS:2;
    unsigned DMA3IP:3;
    unsigned :3;
    unsigned DMA4IS:2;
    unsigned DMA4IP:3;
    unsigned :3;
    unsigned DMA5IS:2;
    unsigned DMA5IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC34bits_t;*/
volatile __IPC34bits_t IPC34bits __asm__ ("IPC34") __attribute__((section("sfrs")));
volatile unsigned int        IPC34CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC34SET __attribute__((section("sfrs")));
volatile unsigned int        IPC34INV __attribute__((section("sfrs")));
volatile unsigned int        IPC35 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DMA6IS:2;
    unsigned DMA6IP:3;
    unsigned :3;
    unsigned DMA7IS:2;
    unsigned DMA7IP:3;
    unsigned :3;
    unsigned SPI2EIS:2;
    unsigned SPI2EIP:3;
    unsigned :3;
    unsigned SPI2RXIS:2;
    unsigned SPI2RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC35bits_t;*/
volatile __IPC35bits_t IPC35bits __asm__ ("IPC35") __attribute__((section("sfrs")));
volatile unsigned int        IPC35CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC35SET __attribute__((section("sfrs")));
volatile unsigned int        IPC35INV __attribute__((section("sfrs")));
volatile unsigned int        IPC36 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI2TXIS:2;
    unsigned SPI2TXIP:3;
    unsigned :3;
    unsigned U2EIS:2;
    unsigned U2EIP:3;
    unsigned :3;
    unsigned U2RXIS:2;
    unsigned U2RXIP:3;
    unsigned :3;
    unsigned U2TXIS:2;
    unsigned U2TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC36bits_t;*/
volatile __IPC36bits_t IPC36bits __asm__ ("IPC36") __attribute__((section("sfrs")));
volatile unsigned int        IPC36CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC36SET __attribute__((section("sfrs")));
volatile unsigned int        IPC36INV __attribute__((section("sfrs")));
volatile unsigned int        IPC37 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C2BIS:2;
    unsigned I2C2BIP:3;
    unsigned :3;
    unsigned I2C2SIS:2;
    unsigned I2C2SIP:3;
    unsigned :3;
    unsigned I2C2MIS:2;
    unsigned I2C2MIP:3;
    unsigned :3;
    unsigned CAN1IS:2;
    unsigned CAN1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC37bits_t;*/
volatile __IPC37bits_t IPC37bits __asm__ ("IPC37") __attribute__((section("sfrs")));
volatile unsigned int        IPC37CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC37SET __attribute__((section("sfrs")));
volatile unsigned int        IPC37INV __attribute__((section("sfrs")));
volatile unsigned int        IPC38 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CAN2IS:2;
    unsigned CAN2IP:3;
    unsigned :3;
    unsigned ETHIS:2;
    unsigned ETHIP:3;
    unsigned :3;
    unsigned SPI3EIS:2;
    unsigned SPI3EIP:3;
    unsigned :3;
    unsigned SPI3RXIS:2;
    unsigned SPI3RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC38bits_t;*/
volatile __IPC38bits_t IPC38bits __asm__ ("IPC38") __attribute__((section("sfrs")));
volatile unsigned int        IPC38CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC38SET __attribute__((section("sfrs")));
volatile unsigned int        IPC38INV __attribute__((section("sfrs")));
volatile unsigned int        IPC39 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI3TXIS:2;
    unsigned SPI3TXIP:3;
    unsigned :3;
    unsigned U3EIS:2;
    unsigned U3EIP:3;
    unsigned :3;
    unsigned U3RXIS:2;
    unsigned U3RXIP:3;
    unsigned :3;
    unsigned U3TXIS:2;
    unsigned U3TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC39bits_t;*/
volatile __IPC39bits_t IPC39bits __asm__ ("IPC39") __attribute__((section("sfrs")));
volatile unsigned int        IPC39CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC39SET __attribute__((section("sfrs")));
volatile unsigned int        IPC39INV __attribute__((section("sfrs")));
volatile unsigned int        IPC40 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C3BIS:2;
    unsigned I2C3BIP:3;
    unsigned :3;
    unsigned I2C3SIS:2;
    unsigned I2C3SIP:3;
    unsigned :3;
    unsigned I2C3MIS:2;
    unsigned I2C3MIP:3;
    unsigned :3;
    unsigned SPI4EIS:2;
    unsigned SPI4EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC40bits_t;*/
volatile __IPC40bits_t IPC40bits __asm__ ("IPC40") __attribute__((section("sfrs")));
volatile unsigned int        IPC40CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC40SET __attribute__((section("sfrs")));
volatile unsigned int        IPC40INV __attribute__((section("sfrs")));
volatile unsigned int        IPC41 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI4RXIS:2;
    unsigned SPI4RXIP:3;
    unsigned :3;
    unsigned SPI4TXIS:2;
    unsigned SPI4TXIP:3;
    unsigned :3;
    unsigned RTCCIS:2;
    unsigned RTCCIP:3;
    unsigned :3;
    unsigned FCEIS:2;
    unsigned FCEIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC41bits_t;*/
volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs")));
volatile unsigned int        IPC41CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC41SET __attribute__((section("sfrs")));
volatile unsigned int        IPC41INV __attribute__((section("sfrs")));
volatile unsigned int        IPC42 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PREIS:2;
    unsigned PREIP:3;
    unsigned :3;
    unsigned SQI1IS:2;
    unsigned SQI1IP:3;
    unsigned :3;
    unsigned U4EIS:2;
    unsigned U4EIP:3;
    unsigned :3;
    unsigned U4RXIS:2;
    unsigned U4RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC42bits_t;*/
volatile __IPC42bits_t IPC42bits __asm__ ("IPC42") __attribute__((section("sfrs")));
volatile unsigned int        IPC42CLR __attribute__((section("sfrs")));
volatile unsigned int        IPC42SET __attribute__((section("sfrs")));
volatile unsigned int        IPC42INV __attribute__((section("sfrs")));
volatile unsigned int        IPC43 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned U4TXIS:2;
    unsigned U4TXIP:3;
    unsigned :3;
    unsigned I2C4BIS:2;
    unsigned I2C4BIP:3;
    unsigned :3;
    unsigned I2C4SIS:2;
    unsigned I2C4SIP:3;
    unsigned :3;
    unsigned I2C4MIS:2;
    unsigned I2C4MIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC43bits_t;*/
