HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __OFF186bits_t OFF186bits __asm__ ("OFF186") __attribute__((section("sfrs")));
volatile unsigned int        OFF187 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF187bits_t;*/
volatile __OFF187bits_t OFF187bits __asm__ ("OFF187") __attribute__((section("sfrs")));
volatile unsigned int        OFF188 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF188bits_t;*/
volatile __OFF188bits_t OFF188bits __asm__ ("OFF188") __attribute__((section("sfrs")));
volatile unsigned int        OFF189 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF189bits_t;*/
volatile __OFF189bits_t OFF189bits __asm__ ("OFF189") __attribute__((section("sfrs")));
volatile unsigned int        OFF190 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF190bits_t;*/
volatile __OFF190bits_t OFF190bits __asm__ ("OFF190") __attribute__((section("sfrs")));
volatile unsigned int        DMACON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :11;
  unsigned DMABUSY:1;
  unsigned SUSPEND:1;
  unsigned :2;
  unsigned ON:1;
} __DMACONbits_t;*/
volatile __DMACONbits_t DMACONbits __asm__ ("DMACON") __attribute__((section("sfrs")));
volatile unsigned int        DMACONCLR __attribute__((section("sfrs")));
volatile unsigned int        DMACONSET __attribute__((section("sfrs")));
volatile unsigned int        DMACONINV __attribute__((section("sfrs")));
volatile unsigned int        DMASTAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACH:3;
  unsigned :28;
  unsigned RDWR:1;
} __DMASTATbits_t;*/
volatile __DMASTATbits_t DMASTATbits __asm__ ("DMASTAT") __attribute__((section("sfrs")));
volatile unsigned int        DMASTATCLR __attribute__((section("sfrs")));
volatile unsigned int        DMASTATSET __attribute__((section("sfrs")));
volatile unsigned int        DMASTATINV __attribute__((section("sfrs")));
volatile unsigned int        DMAADDR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __DMAADDRbits_t;*/
volatile __DMAADDRbits_t DMAADDRbits __asm__ ("DMAADDR") __attribute__((section("sfrs")));
volatile unsigned int        DMAADDRCLR __attribute__((section("sfrs")));
volatile unsigned int        DMAADDRSET __attribute__((section("sfrs")));
volatile unsigned int        DMAADDRINV __attribute__((section("sfrs")));
volatile unsigned int        DCRCCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CRCCH:3;
  unsigned :2;
  unsigned CRCTYP:1;
  unsigned CRCAPP:1;
  unsigned CRCEN:1;
  unsigned PLEN:5;
  unsigned :11;
  unsigned BITO:1;
  unsigned :2;
  unsigned WBO:1;
  unsigned BYTO:2;
} __DCRCCONbits_t;*/
volatile __DCRCCONbits_t DCRCCONbits __asm__ ("DCRCCON") __attribute__((section("sfrs")));
volatile unsigned int        DCRCCONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCRCCONSET __attribute__((section("sfrs")));
volatile unsigned int        DCRCCONINV __attribute__((section("sfrs")));
volatile unsigned int        DCRCDATA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DCRCDATA:32;
} __DCRCDATAbits_t;*/
volatile __DCRCDATAbits_t DCRCDATAbits __asm__ ("DCRCDATA") __attribute__((section("sfrs")));
volatile unsigned int        DCRCDATACLR __attribute__((section("sfrs")));
volatile unsigned int        DCRCDATASET __attribute__((section("sfrs")));
volatile unsigned int        DCRCDATAINV __attribute__((section("sfrs")));
volatile unsigned int        DCRCXOR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DCRCXOR:32;
} __DCRCXORbits_t;*/
volatile __DCRCXORbits_t DCRCXORbits __asm__ ("DCRCXOR") __attribute__((section("sfrs")));
volatile unsigned int        DCRCXORCLR __attribute__((section("sfrs")));
volatile unsigned int        DCRCXORSET __attribute__((section("sfrs")));
volatile unsigned int        DCRCXORINV __attribute__((section("sfrs")));
volatile unsigned int        DCH0CON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH0CONbits_t;*/
volatile __DCH0CONbits_t DCH0CONbits __asm__ ("DCH0CON") __attribute__((section("sfrs")));
volatile unsigned int        DCH0CONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH0CONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH0CONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH0ECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH0ECONbits_t;*/
volatile __DCH0ECONbits_t DCH0ECONbits __asm__ ("DCH0ECON") __attribute__((section("sfrs")));
volatile unsigned int        DCH0ECONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH0ECONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH0ECONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH0INT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH0INTbits_t;*/
volatile __DCH0INTbits_t DCH0INTbits __asm__ ("DCH0INT") __attribute__((section("sfrs")));
volatile unsigned int        DCH0INTCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH0INTSET __attribute__((section("sfrs")));
volatile unsigned int        DCH0INTINV __attribute__((section("sfrs")));
volatile unsigned int        DCH0SSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH0SSAbits_t;*/
volatile __DCH0SSAbits_t DCH0SSAbits __asm__ ("DCH0SSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH0SSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH0SSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH0SSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH0DSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH0DSAbits_t;*/
volatile __DCH0DSAbits_t DCH0DSAbits __asm__ ("DCH0DSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH0DSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH0DSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH0DSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH0SSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH0SSIZbits_t;*/
