HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __DCH1DATbits_t DCH1DATbits __asm__ ("DCH1DAT") __attribute__((section("sfrs")));
volatile unsigned int        DCH1DATCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH1DATSET __attribute__((section("sfrs")));
volatile unsigned int        DCH1DATINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2CON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH2CONbits_t;*/
volatile __DCH2CONbits_t DCH2CONbits __asm__ ("DCH2CON") __attribute__((section("sfrs")));
volatile unsigned int        DCH2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2CONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2CONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2ECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH2ECONbits_t;*/
volatile __DCH2ECONbits_t DCH2ECONbits __asm__ ("DCH2ECON") __attribute__((section("sfrs")));
volatile unsigned int        DCH2ECONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2ECONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2ECONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2INT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH2INTbits_t;*/
volatile __DCH2INTbits_t DCH2INTbits __asm__ ("DCH2INT") __attribute__((section("sfrs")));
volatile unsigned int        DCH2INTCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2INTSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2INTINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH2SSAbits_t;*/
volatile __DCH2SSAbits_t DCH2SSAbits __asm__ ("DCH2SSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH2DSAbits_t;*/
volatile __DCH2DSAbits_t DCH2DSAbits __asm__ ("DCH2DSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH2SSIZbits_t;*/
volatile __DCH2SSIZbits_t DCH2SSIZbits __asm__ ("DCH2SSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH2DSIZbits_t;*/
volatile __DCH2DSIZbits_t DCH2DSIZbits __asm__ ("DCH2DSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH2SPTRbits_t;*/
volatile __DCH2SPTRbits_t DCH2SPTRbits __asm__ ("DCH2SPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH2DPTRbits_t;*/
volatile __DCH2DPTRbits_t DCH2DPTRbits __asm__ ("DCH2DPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH2CSIZbits_t;*/
volatile __DCH2CSIZbits_t DCH2CSIZbits __asm__ ("DCH2CSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS2CPTRbits_t;*/
volatile __DCS2CPTRbits_t DCS2CPTRbits __asm__ ("DCS2CPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH2DAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH2DATbits_t;*/
volatile __DCH2DATbits_t DCH2DATbits __asm__ ("DCH2DAT") __attribute__((section("sfrs")));
volatile unsigned int        DCH2DATCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH2DATSET __attribute__((section("sfrs")));
volatile unsigned int        DCH2DATINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3CON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH3CONbits_t;*/
volatile __DCH3CONbits_t DCH3CONbits __asm__ ("DCH3CON") __attribute__((section("sfrs")));
volatile unsigned int        DCH3CONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3CONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3CONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3ECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH3ECONbits_t;*/
volatile __DCH3ECONbits_t DCH3ECONbits __asm__ ("DCH3ECON") __attribute__((section("sfrs")));
volatile unsigned int        DCH3ECONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3ECONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3ECONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3INT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH3INTbits_t;*/
