HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __DCH3INTbits_t DCH3INTbits __asm__ ("DCH3INT") __attribute__((section("sfrs")));
volatile unsigned int        DCH3INTCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3INTSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3INTINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH3SSAbits_t;*/
volatile __DCH3SSAbits_t DCH3SSAbits __asm__ ("DCH3SSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH3DSAbits_t;*/
volatile __DCH3DSAbits_t DCH3DSAbits __asm__ ("DCH3DSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH3SSIZbits_t;*/
volatile __DCH3SSIZbits_t DCH3SSIZbits __asm__ ("DCH3SSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH3DSIZbits_t;*/
volatile __DCH3DSIZbits_t DCH3DSIZbits __asm__ ("DCH3DSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3SPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH3SPTRbits_t;*/
volatile __DCH3SPTRbits_t DCH3SPTRbits __asm__ ("DCH3SPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH3SPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3SPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3SPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3DPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH3DPTRbits_t;*/
volatile __DCH3DPTRbits_t DCH3DPTRbits __asm__ ("DCH3DPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH3DPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3DPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3DPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3CSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH3CSIZbits_t;*/
volatile __DCH3CSIZbits_t DCH3CSIZbits __asm__ ("DCH3CSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH3CSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3CSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3CSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCS3CPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS3CPTRbits_t;*/
volatile __DCS3CPTRbits_t DCS3CPTRbits __asm__ ("DCS3CPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCS3CPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCS3CPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCS3CPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH3DAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH3DATbits_t;*/
volatile __DCH3DATbits_t DCH3DATbits __asm__ ("DCH3DAT") __attribute__((section("sfrs")));
volatile unsigned int        DCH3DATCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH3DATSET __attribute__((section("sfrs")));
volatile unsigned int        DCH3DATINV __attribute__((section("sfrs")));
volatile unsigned int        DCH4CON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH4CONbits_t;*/
volatile __DCH4CONbits_t DCH4CONbits __asm__ ("DCH4CON") __attribute__((section("sfrs")));
volatile unsigned int        DCH4CONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH4CONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH4CONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH4ECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH4ECONbits_t;*/
volatile __DCH4ECONbits_t DCH4ECONbits __asm__ ("DCH4ECON") __attribute__((section("sfrs")));
volatile unsigned int        DCH4ECONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH4ECONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH4ECONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH4INT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH4INTbits_t;*/
volatile __DCH4INTbits_t DCH4INTbits __asm__ ("DCH4INT") __attribute__((section("sfrs")));
volatile unsigned int        DCH4INTCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH4INTSET __attribute__((section("sfrs")));
volatile unsigned int        DCH4INTINV __attribute__((section("sfrs")));
volatile unsigned int        DCH4SSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH4SSAbits_t;*/
volatile __DCH4SSAbits_t DCH4SSAbits __asm__ ("DCH4SSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH4SSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH4SSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH4SSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH4DSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH4DSAbits_t;*/
