HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __DCH6DSIZbits_t DCH6DSIZbits __asm__ ("DCH6DSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH6DSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH6DSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH6DSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH6SPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH6SPTRbits_t;*/
volatile __DCH6SPTRbits_t DCH6SPTRbits __asm__ ("DCH6SPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH6SPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH6SPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH6SPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH6DPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH6DPTRbits_t;*/
volatile __DCH6DPTRbits_t DCH6DPTRbits __asm__ ("DCH6DPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH6DPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH6DPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH6DPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH6CSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH6CSIZbits_t;*/
volatile __DCH6CSIZbits_t DCH6CSIZbits __asm__ ("DCH6CSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH6CSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH6CSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH6CSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCS6CPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS6CPTRbits_t;*/
volatile __DCS6CPTRbits_t DCS6CPTRbits __asm__ ("DCS6CPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCS6CPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCS6CPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCS6CPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH6DAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH6DATbits_t;*/
volatile __DCH6DATbits_t DCH6DATbits __asm__ ("DCH6DAT") __attribute__((section("sfrs")));
volatile unsigned int        DCH6DATCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH6DATSET __attribute__((section("sfrs")));
volatile unsigned int        DCH6DATINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7CON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH7CONbits_t;*/
volatile __DCH7CONbits_t DCH7CONbits __asm__ ("DCH7CON") __attribute__((section("sfrs")));
volatile unsigned int        DCH7CONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7CONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7CONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7ECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH7ECONbits_t;*/
volatile __DCH7ECONbits_t DCH7ECONbits __asm__ ("DCH7ECON") __attribute__((section("sfrs")));
volatile unsigned int        DCH7ECONCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7ECONSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7ECONINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7INT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH7INTbits_t;*/
volatile __DCH7INTbits_t DCH7INTbits __asm__ ("DCH7INT") __attribute__((section("sfrs")));
volatile unsigned int        DCH7INTCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7INTSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7INTINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH7SSAbits_t;*/
volatile __DCH7SSAbits_t DCH7SSAbits __asm__ ("DCH7SSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSA __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH7DSAbits_t;*/
volatile __DCH7DSAbits_t DCH7DSAbits __asm__ ("DCH7DSA") __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSACLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSASET __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSAINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH7SSIZbits_t;*/
volatile __DCH7SSIZbits_t DCH7SSIZbits __asm__ ("DCH7SSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH7DSIZbits_t;*/
volatile __DCH7DSIZbits_t DCH7DSIZbits __asm__ ("DCH7DSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH7SPTRbits_t;*/
volatile __DCH7SPTRbits_t DCH7SPTRbits __asm__ ("DCH7SPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH7DPTRbits_t;*/
volatile __DCH7DPTRbits_t DCH7DPTRbits __asm__ ("DCH7DPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZ __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH7CSIZbits_t;*/
volatile __DCH7CSIZbits_t DCH7CSIZbits __asm__ ("DCH7CSIZ") __attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZINV __attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS7CPTRbits_t;*/
volatile __DCS7CPTRbits_t DCS7CPTRbits __asm__ ("DCS7CPTR") __attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTRCLR __attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTRSET __attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTRINV __attribute__((section("sfrs")));
volatile unsigned int        DCH7DAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH7DATbits_t;*/
