HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __DCH7DATbits_t DCH7DATbits __asm__ ("DCH7DAT") __attribute__((section("sfrs")));
volatile unsigned int        DCH7DATCLR __attribute__((section("sfrs")));
volatile unsigned int        DCH7DATSET __attribute__((section("sfrs")));
volatile unsigned int        DCH7DATINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned DHEN:1;
    unsigned AHEN:1;
    unsigned SBCDE:1;
    unsigned SDAHT:1;
    unsigned BOEN:1;
    unsigned SCIE:1;
    unsigned PCIE:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
} __I2C1CONbits_t;*/
volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON") __attribute__((section("sfrs")));
volatile unsigned int        I2C1CONCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1CONSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1CONINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :2;
    unsigned ACKTIM:1;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
} __I2C1STATbits_t;*/
volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT") __attribute__((section("sfrs")));
volatile unsigned int        I2C1STATCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1STATSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1STATINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1ADD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CADD:10;
} __I2C1ADDbits_t;*/
volatile __I2C1ADDbits_t I2C1ADDbits __asm__ ("I2C1ADD") __attribute__((section("sfrs")));
volatile unsigned int        I2C1ADDCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1ADDSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1ADDINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1MSK __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2CMSK:10;
  };
  struct {
    unsigned AMSK:10;
  };
} __I2C1MSKbits_t;*/
volatile __I2C1MSKbits_t I2C1MSKbits __asm__ ("I2C1MSK") __attribute__((section("sfrs")));
volatile unsigned int        I2C1MSKCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1MSKSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1MSKINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1BRG __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CBRG:16;
} __I2C1BRGbits_t;*/
volatile __I2C1BRGbits_t I2C1BRGbits __asm__ ("I2C1BRG") __attribute__((section("sfrs")));
volatile unsigned int        I2C1BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1BRGSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1BRGINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1TRN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CTRN:8;
} __I2C1TRNbits_t;*/
volatile __I2C1TRNbits_t I2C1TRNbits __asm__ ("I2C1TRN") __attribute__((section("sfrs")));
volatile unsigned int        I2C1TRNCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1TRNSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1TRNINV __attribute__((section("sfrs")));
volatile unsigned int        I2C1RCV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CRCV:8;
} __I2C1RCVbits_t;*/
volatile __I2C1RCVbits_t I2C1RCVbits __asm__ ("I2C1RCV") __attribute__((section("sfrs")));
volatile unsigned int        I2C1RCVCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C1RCVSET __attribute__((section("sfrs")));
volatile unsigned int        I2C1RCVINV __attribute__((section("sfrs")));
volatile unsigned int        I2C2CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned DHEN:1;
    unsigned AHEN:1;
    unsigned SBCDE:1;
    unsigned SDAHT:1;
    unsigned BOEN:1;
    unsigned SCIE:1;
    unsigned PCIE:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
} __I2C2CONbits_t;*/
volatile __I2C2CONbits_t I2C2CONbits __asm__ ("I2C2CON") __attribute__((section("sfrs")));
volatile unsigned int        I2C2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C2CONSET __attribute__((section("sfrs")));
volatile unsigned int        I2C2CONINV __attribute__((section("sfrs")));
volatile unsigned int        I2C2STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :2;
    unsigned ACKTIM:1;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
} __I2C2STATbits_t;*/
volatile __I2C2STATbits_t I2C2STATbits __asm__ ("I2C2STAT") __attribute__((section("sfrs")));
volatile unsigned int        I2C2STATCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C2STATSET __attribute__((section("sfrs")));
volatile unsigned int        I2C2STATINV __attribute__((section("sfrs")));
volatile unsigned int        I2C2ADD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CADD:10;
} __I2C2ADDbits_t;*/
