HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __I2C4STATbits_t I2C4STATbits __asm__ ("I2C4STAT") __attribute__((section("sfrs")));
volatile unsigned int        I2C4STATCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C4STATSET __attribute__((section("sfrs")));
volatile unsigned int        I2C4STATINV __attribute__((section("sfrs")));
volatile unsigned int        I2C4ADD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CADD:10;
} __I2C4ADDbits_t;*/
volatile __I2C4ADDbits_t I2C4ADDbits __asm__ ("I2C4ADD") __attribute__((section("sfrs")));
volatile unsigned int        I2C4ADDCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C4ADDSET __attribute__((section("sfrs")));
volatile unsigned int        I2C4ADDINV __attribute__((section("sfrs")));
volatile unsigned int        I2C4MSK __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2CMSK:10;
  };
  struct {
    unsigned AMSK:10;
  };
} __I2C4MSKbits_t;*/
volatile __I2C4MSKbits_t I2C4MSKbits __asm__ ("I2C4MSK") __attribute__((section("sfrs")));
volatile unsigned int        I2C4MSKCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C4MSKSET __attribute__((section("sfrs")));
volatile unsigned int        I2C4MSKINV __attribute__((section("sfrs")));
volatile unsigned int        I2C4BRG __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CBRG:16;
} __I2C4BRGbits_t;*/
volatile __I2C4BRGbits_t I2C4BRGbits __asm__ ("I2C4BRG") __attribute__((section("sfrs")));
volatile unsigned int        I2C4BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C4BRGSET __attribute__((section("sfrs")));
volatile unsigned int        I2C4BRGINV __attribute__((section("sfrs")));
volatile unsigned int        I2C4TRN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CTRN:8;
} __I2C4TRNbits_t;*/
volatile __I2C4TRNbits_t I2C4TRNbits __asm__ ("I2C4TRN") __attribute__((section("sfrs")));
volatile unsigned int        I2C4TRNCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C4TRNSET __attribute__((section("sfrs")));
volatile unsigned int        I2C4TRNINV __attribute__((section("sfrs")));
volatile unsigned int        I2C4RCV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CRCV:8;
} __I2C4RCVbits_t;*/
volatile __I2C4RCVbits_t I2C4RCVbits __asm__ ("I2C4RCV") __attribute__((section("sfrs")));
volatile unsigned int        I2C4RCVCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C4RCVSET __attribute__((section("sfrs")));
volatile unsigned int        I2C4RCVINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned DHEN:1;
    unsigned AHEN:1;
    unsigned SBCDE:1;
    unsigned SDAHT:1;
    unsigned BOEN:1;
    unsigned SCIE:1;
    unsigned PCIE:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
} __I2C5CONbits_t;*/
volatile __I2C5CONbits_t I2C5CONbits __asm__ ("I2C5CON") __attribute__((section("sfrs")));
volatile unsigned int        I2C5CONCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5CONSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5CONINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :2;
    unsigned ACKTIM:1;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
} __I2C5STATbits_t;*/
volatile __I2C5STATbits_t I2C5STATbits __asm__ ("I2C5STAT") __attribute__((section("sfrs")));
volatile unsigned int        I2C5STATCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5STATSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5STATINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5ADD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CADD:10;
} __I2C5ADDbits_t;*/
volatile __I2C5ADDbits_t I2C5ADDbits __asm__ ("I2C5ADD") __attribute__((section("sfrs")));
volatile unsigned int        I2C5ADDCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5ADDSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5ADDINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5MSK __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2CMSK:10;
  };
  struct {
    unsigned AMSK:10;
  };
} __I2C5MSKbits_t;*/
volatile __I2C5MSKbits_t I2C5MSKbits __asm__ ("I2C5MSK") __attribute__((section("sfrs")));
volatile unsigned int        I2C5MSKCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5MSKSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5MSKINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5BRG __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CBRG:16;
} __I2C5BRGbits_t;*/
volatile __I2C5BRGbits_t I2C5BRGbits __asm__ ("I2C5BRG") __attribute__((section("sfrs")));
volatile unsigned int        I2C5BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5BRGSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5BRGINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5TRN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CTRN:8;
} __I2C5TRNbits_t;*/
volatile __I2C5TRNbits_t I2C5TRNbits __asm__ ("I2C5TRN") __attribute__((section("sfrs")));
volatile unsigned int        I2C5TRNCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5TRNSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5TRNINV __attribute__((section("sfrs")));
volatile unsigned int        I2C5RCV __attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CRCV:8;
} __I2C5RCVbits_t;*/
volatile __I2C5RCVbits_t I2C5RCVbits __asm__ ("I2C5RCV") __attribute__((section("sfrs")));
volatile unsigned int        I2C5RCVCLR __attribute__((section("sfrs")));
volatile unsigned int        I2C5RCVSET __attribute__((section("sfrs")));
volatile unsigned int        I2C5RCVINV __attribute__((section("sfrs")));
volatile unsigned int        SPI1CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI1CONbits_t;*/
volatile __SPI1CONbits_t SPI1CONbits __asm__ ("SPI1CON") __attribute__((section("sfrs")));
volatile unsigned int        SPI1CONCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI1CONSET __attribute__((section("sfrs")));
volatile unsigned int        SPI1CONINV __attribute__((section("sfrs")));
volatile unsigned int        SPI1STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI1STATbits_t;*/
volatile __SPI1STATbits_t SPI1STATbits __asm__ ("SPI1STAT") __attribute__((section("sfrs")));
volatile unsigned int        SPI1STATCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI1STATSET __attribute__((section("sfrs")));
volatile unsigned int        SPI1STATINV __attribute__((section("sfrs")));
volatile unsigned int        SPI1BUF __attribute__((section("sfrs")));
volatile unsigned int        SPI1BRG __attribute__((section("sfrs")));
volatile unsigned int        SPI1BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI1BRGSET __attribute__((section("sfrs")));
volatile unsigned int        SPI1BRGINV __attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI1CON2bits_t;*/
volatile __SPI1CON2bits_t SPI1CON2bits __asm__ ("SPI1CON2") __attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2CLR __attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2SET __attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2INV __attribute__((section("sfrs")));
volatile unsigned int        SPI2CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI2CONbits_t;*/
volatile __SPI2CONbits_t SPI2CONbits __asm__ ("SPI2CON") __attribute__((section("sfrs")));
volatile unsigned int        SPI2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI2CONSET __attribute__((section("sfrs")));
volatile unsigned int        SPI2CONINV __attribute__((section("sfrs")));
volatile unsigned int        SPI2STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI2STATbits_t;*/
volatile __SPI2STATbits_t SPI2STATbits __asm__ ("SPI2STAT") __attribute__((section("sfrs")));
volatile unsigned int        SPI2STATCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI2STATSET __attribute__((section("sfrs")));
volatile unsigned int        SPI2STATINV __attribute__((section("sfrs")));
volatile unsigned int        SPI2BUF __attribute__((section("sfrs")));
volatile unsigned int        SPI2BRG __attribute__((section("sfrs")));
volatile unsigned int        SPI2BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI2BRGSET __attribute__((section("sfrs")));
volatile unsigned int        SPI2BRGINV __attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI2CON2bits_t;*/
volatile __SPI2CON2bits_t SPI2CON2bits __asm__ ("SPI2CON2") __attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2CLR __attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2SET __attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2INV __attribute__((section("sfrs")));
volatile unsigned int        SPI3CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI3CONbits_t;*/
