HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __SPI3CONbits_t SPI3CONbits __asm__ ("SPI3CON") __attribute__((section("sfrs")));
volatile unsigned int        SPI3CONCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI3CONSET __attribute__((section("sfrs")));
volatile unsigned int        SPI3CONINV __attribute__((section("sfrs")));
volatile unsigned int        SPI3STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI3STATbits_t;*/
volatile __SPI3STATbits_t SPI3STATbits __asm__ ("SPI3STAT") __attribute__((section("sfrs")));
volatile unsigned int        SPI3STATCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI3STATSET __attribute__((section("sfrs")));
volatile unsigned int        SPI3STATINV __attribute__((section("sfrs")));
volatile unsigned int        SPI3BUF __attribute__((section("sfrs")));
volatile unsigned int        SPI3BRG __attribute__((section("sfrs")));
volatile unsigned int        SPI3BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI3BRGSET __attribute__((section("sfrs")));
volatile unsigned int        SPI3BRGINV __attribute__((section("sfrs")));
volatile unsigned int        SPI3CON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI3CON2bits_t;*/
volatile __SPI3CON2bits_t SPI3CON2bits __asm__ ("SPI3CON2") __attribute__((section("sfrs")));
volatile unsigned int        SPI3CON2CLR __attribute__((section("sfrs")));
volatile unsigned int        SPI3CON2SET __attribute__((section("sfrs")));
volatile unsigned int        SPI3CON2INV __attribute__((section("sfrs")));
volatile unsigned int        SPI4CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI4CONbits_t;*/
volatile __SPI4CONbits_t SPI4CONbits __asm__ ("SPI4CON") __attribute__((section("sfrs")));
volatile unsigned int        SPI4CONCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI4CONSET __attribute__((section("sfrs")));
volatile unsigned int        SPI4CONINV __attribute__((section("sfrs")));
volatile unsigned int        SPI4STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI4STATbits_t;*/
volatile __SPI4STATbits_t SPI4STATbits __asm__ ("SPI4STAT") __attribute__((section("sfrs")));
volatile unsigned int        SPI4STATCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI4STATSET __attribute__((section("sfrs")));
volatile unsigned int        SPI4STATINV __attribute__((section("sfrs")));
volatile unsigned int        SPI4BUF __attribute__((section("sfrs")));
volatile unsigned int        SPI4BRG __attribute__((section("sfrs")));
volatile unsigned int        SPI4BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI4BRGSET __attribute__((section("sfrs")));
volatile unsigned int        SPI4BRGINV __attribute__((section("sfrs")));
volatile unsigned int        SPI4CON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI4CON2bits_t;*/
volatile __SPI4CON2bits_t SPI4CON2bits __asm__ ("SPI4CON2") __attribute__((section("sfrs")));
volatile unsigned int        SPI4CON2CLR __attribute__((section("sfrs")));
volatile unsigned int        SPI4CON2SET __attribute__((section("sfrs")));
volatile unsigned int        SPI4CON2INV __attribute__((section("sfrs")));
volatile unsigned int        SPI5CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI5CONbits_t;*/
volatile __SPI5CONbits_t SPI5CONbits __asm__ ("SPI5CON") __attribute__((section("sfrs")));
volatile unsigned int        SPI5CONCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI5CONSET __attribute__((section("sfrs")));
volatile unsigned int        SPI5CONINV __attribute__((section("sfrs")));
volatile unsigned int        SPI5STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI5STATbits_t;*/
volatile __SPI5STATbits_t SPI5STATbits __asm__ ("SPI5STAT") __attribute__((section("sfrs")));
volatile unsigned int        SPI5STATCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI5STATSET __attribute__((section("sfrs")));
volatile unsigned int        SPI5STATINV __attribute__((section("sfrs")));
volatile unsigned int        SPI5BUF __attribute__((section("sfrs")));
volatile unsigned int        SPI5BRG __attribute__((section("sfrs")));
volatile unsigned int        SPI5BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI5BRGSET __attribute__((section("sfrs")));
volatile unsigned int        SPI5BRGINV __attribute__((section("sfrs")));
volatile unsigned int        SPI5CON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI5CON2bits_t;*/
volatile __SPI5CON2bits_t SPI5CON2bits __asm__ ("SPI5CON2") __attribute__((section("sfrs")));
volatile unsigned int        SPI5CON2CLR __attribute__((section("sfrs")));
volatile unsigned int        SPI5CON2SET __attribute__((section("sfrs")));
volatile unsigned int        SPI5CON2INV __attribute__((section("sfrs")));
volatile unsigned int        SPI6CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI6CONbits_t;*/
volatile __SPI6CONbits_t SPI6CONbits __asm__ ("SPI6CON") __attribute__((section("sfrs")));
volatile unsigned int        SPI6CONCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI6CONSET __attribute__((section("sfrs")));
volatile unsigned int        SPI6CONINV __attribute__((section("sfrs")));
volatile unsigned int        SPI6STAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI6STATbits_t;*/
volatile __SPI6STATbits_t SPI6STATbits __asm__ ("SPI6STAT") __attribute__((section("sfrs")));
volatile unsigned int        SPI6STATCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI6STATSET __attribute__((section("sfrs")));
volatile unsigned int        SPI6STATINV __attribute__((section("sfrs")));
volatile unsigned int        SPI6BUF __attribute__((section("sfrs")));
volatile unsigned int        SPI6BRG __attribute__((section("sfrs")));
volatile unsigned int        SPI6BRGCLR __attribute__((section("sfrs")));
volatile unsigned int        SPI6BRGSET __attribute__((section("sfrs")));
volatile unsigned int        SPI6BRGINV __attribute__((section("sfrs")));
volatile unsigned int        SPI6CON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI6CON2bits_t;*/
volatile __SPI6CON2bits_t SPI6CON2bits __asm__ ("SPI6CON2") __attribute__((section("sfrs")));
volatile unsigned int        SPI6CON2CLR __attribute__((section("sfrs")));
volatile unsigned int        SPI6CON2SET __attribute__((section("sfrs")));
volatile unsigned int        SPI6CON2INV __attribute__((section("sfrs")));
volatile unsigned int        U1MODE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __U1MODEbits_t;*/
volatile __U1MODEbits_t U1MODEbits __asm__ ("U1MODE") __attribute__((section("sfrs")));
volatile unsigned int        UABMODE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UABMODEbits_t;*/
volatile __UABMODEbits_t UABMODEbits __asm__ ("UABMODE") __attribute__((section("sfrs")));
volatile unsigned int        U1MODECLR __attribute__((section("sfrs")));
volatile unsigned int        UABMODECLR __attribute__((section("sfrs")));
volatile unsigned int        U1MODESET __attribute__((section("sfrs")));
volatile unsigned int        UABMODESET __attribute__((section("sfrs")));
volatile unsigned int        U1MODEINV __attribute__((section("sfrs")));
volatile unsigned int        UABMODEINV __attribute__((section("sfrs")));
volatile unsigned int        U1STA __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U1STAbits_t;*/
