HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __PMCONbits_t PMCONbits __asm__ ("PMCON") __attribute__((section("sfrs")));
volatile unsigned int        PMCONCLR __attribute__((section("sfrs")));
volatile unsigned int        PMCONSET __attribute__((section("sfrs")));
volatile unsigned int        PMCONINV __attribute__((section("sfrs")));
volatile unsigned int        PMMODE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned WAITE:2;
    unsigned WAITM:4;
    unsigned WAITB:2;
    unsigned MODE:2;
    unsigned MODE16:1;
    unsigned INCM:2;
    unsigned IRQM:2;
    unsigned BUSY:1;
  };
  struct {
    unsigned WAITE0:1;
    unsigned WAITE1:1;
    unsigned WAITM0:1;
    unsigned WAITM1:1;
    unsigned WAITM2:1;
    unsigned WAITM3:1;
    unsigned WAITB0:1;
    unsigned WAITB1:1;
    unsigned MODE0:1;
    unsigned MODE1:1;
    unsigned :1;
    unsigned INCM0:1;
    unsigned INCM1:1;
    unsigned IRQM0:1;
    unsigned IRQM1:1;
  };
  struct {
    unsigned w:32;
  };
} __PMMODEbits_t;*/
volatile __PMMODEbits_t PMMODEbits __asm__ ("PMMODE") __attribute__((section("sfrs")));
volatile unsigned int        PMMODECLR __attribute__((section("sfrs")));
volatile unsigned int        PMMODESET __attribute__((section("sfrs")));
volatile unsigned int        PMMODEINV __attribute__((section("sfrs")));
volatile unsigned int        PMADDR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADDR:14;
    unsigned CS:2;
  };
  struct {
    unsigned PADDR:14;
  };
  struct {
    unsigned :14;
    unsigned CS1:1;
    unsigned CS2:1;
  };
  struct {
    unsigned w:32;
  };
} __PMADDRbits_t;*/
volatile __PMADDRbits_t PMADDRbits __asm__ ("PMADDR") __attribute__((section("sfrs")));
volatile unsigned int        PMADDRCLR __attribute__((section("sfrs")));
volatile unsigned int        PMADDRSET __attribute__((section("sfrs")));
volatile unsigned int        PMADDRINV __attribute__((section("sfrs")));
volatile unsigned int        PMDOUT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DATAOUT:32;
  };
  struct {
    unsigned w:32;
  };
} __PMDOUTbits_t;*/
volatile __PMDOUTbits_t PMDOUTbits __asm__ ("PMDOUT") __attribute__((section("sfrs")));
volatile unsigned int        PMDOUTCLR __attribute__((section("sfrs")));
volatile unsigned int        PMDOUTSET __attribute__((section("sfrs")));
volatile unsigned int        PMDOUTINV __attribute__((section("sfrs")));
volatile unsigned int        PMDIN __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DATAIN:32;
  };
  struct {
    unsigned w:32;
  };
} __PMDINbits_t;*/
volatile __PMDINbits_t PMDINbits __asm__ ("PMDIN") __attribute__((section("sfrs")));
volatile unsigned int        PMDINCLR __attribute__((section("sfrs")));
volatile unsigned int        PMDINSET __attribute__((section("sfrs")));
volatile unsigned int        PMDININV __attribute__((section("sfrs")));
volatile unsigned int        PMAEN __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PTEN:16;
  };
  struct {
    unsigned PTEN0:1;
    unsigned PTEN1:1;
    unsigned PTEN2:1;
    unsigned PTEN3:1;
    unsigned PTEN4:1;
    unsigned PTEN5:1;
    unsigned PTEN6:1;
    unsigned PTEN7:1;
    unsigned PTEN8:1;
    unsigned PTEN9:1;
    unsigned PTEN10:1;
    unsigned PTEN11:1;
    unsigned PTEN12:1;
    unsigned PTEN13:1;
    unsigned PTEN14:1;
    unsigned PTEN15:1;
  };
  struct {
    unsigned w:32;
  };
} __PMAENbits_t;*/
volatile __PMAENbits_t PMAENbits __asm__ ("PMAEN") __attribute__((section("sfrs")));
volatile unsigned int        PMAENCLR __attribute__((section("sfrs")));
volatile unsigned int        PMAENSET __attribute__((section("sfrs")));
volatile unsigned int        PMAENINV __attribute__((section("sfrs")));
volatile unsigned int        PMSTAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OB0E:1;
    unsigned OB1E:1;
    unsigned OB2E:1;
    unsigned OB3E:1;
    unsigned :2;
    unsigned OBUF:1;
    unsigned OBE:1;
    unsigned IB0F:1;
    unsigned IB1F:1;
    unsigned IB2F:1;
    unsigned IB3F:1;
    unsigned :2;
    unsigned IBOV:1;
    unsigned IBF:1;
  };
  struct {
    unsigned w:32;
  };
} __PMSTATbits_t;*/
volatile __PMSTATbits_t PMSTATbits __asm__ ("PMSTAT") __attribute__((section("sfrs")));
volatile unsigned int        PMSTATCLR __attribute__((section("sfrs")));
volatile unsigned int        PMSTATSET __attribute__((section("sfrs")));
volatile unsigned int        PMSTATINV __attribute__((section("sfrs")));
volatile unsigned int        T1CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned TSYNC:1;
    unsigned :1;
    unsigned TCKPS:2;
    unsigned :1;
    unsigned TGATE:1;
    unsigned :3;
    unsigned TWIP:1;
    unsigned TWDIS:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T1CONbits_t;*/
volatile __T1CONbits_t T1CONbits __asm__ ("T1CON") __attribute__((section("sfrs")));
volatile unsigned int        T1CONCLR __attribute__((section("sfrs")));
volatile unsigned int        T1CONSET __attribute__((section("sfrs")));
volatile unsigned int        T1CONINV __attribute__((section("sfrs")));
volatile unsigned int        TMR1 __attribute__((section("sfrs")));
volatile unsigned int        TMR1CLR __attribute__((section("sfrs")));
volatile unsigned int        TMR1SET __attribute__((section("sfrs")));
volatile unsigned int        TMR1INV __attribute__((section("sfrs")));
volatile unsigned int        PR1 __attribute__((section("sfrs")));
volatile unsigned int        PR1CLR __attribute__((section("sfrs")));
volatile unsigned int        PR1SET __attribute__((section("sfrs")));
volatile unsigned int        PR1INV __attribute__((section("sfrs")));
volatile unsigned int        T2CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T2CONbits_t;*/
volatile __T2CONbits_t T2CONbits __asm__ ("T2CON") __attribute__((section("sfrs")));
volatile unsigned int        T2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        T2CONSET __attribute__((section("sfrs")));
volatile unsigned int        T2CONINV __attribute__((section("sfrs")));
volatile unsigned int        TMR2 __attribute__((section("sfrs")));
volatile unsigned int        TMR2CLR __attribute__((section("sfrs")));
volatile unsigned int        TMR2SET __attribute__((section("sfrs")));
volatile unsigned int        TMR2INV __attribute__((section("sfrs")));
volatile unsigned int        PR2 __attribute__((section("sfrs")));
volatile unsigned int        PR2CLR __attribute__((section("sfrs")));
volatile unsigned int        PR2SET __attribute__((section("sfrs")));
volatile unsigned int        PR2INV __attribute__((section("sfrs")));
volatile unsigned int        T3CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T3CONbits_t;*/
volatile __T3CONbits_t T3CONbits __asm__ ("T3CON") __attribute__((section("sfrs")));
volatile unsigned int        T3CONCLR __attribute__((section("sfrs")));
volatile unsigned int        T3CONSET __attribute__((section("sfrs")));
volatile unsigned int        T3CONINV __attribute__((section("sfrs")));
volatile unsigned int        TMR3 __attribute__((section("sfrs")));
volatile unsigned int        TMR3CLR __attribute__((section("sfrs")));
volatile unsigned int        TMR3SET __attribute__((section("sfrs")));
volatile unsigned int        TMR3INV __attribute__((section("sfrs")));
volatile unsigned int        PR3 __attribute__((section("sfrs")));
volatile unsigned int        PR3CLR __attribute__((section("sfrs")));
volatile unsigned int        PR3SET __attribute__((section("sfrs")));
volatile unsigned int        PR3INV __attribute__((section("sfrs")));
volatile unsigned int        T4CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T4CONbits_t;*/
volatile __T4CONbits_t T4CONbits __asm__ ("T4CON") __attribute__((section("sfrs")));
volatile unsigned int        T4CONCLR __attribute__((section("sfrs")));
volatile unsigned int        T4CONSET __attribute__((section("sfrs")));
volatile unsigned int        T4CONINV __attribute__((section("sfrs")));
volatile unsigned int        TMR4 __attribute__((section("sfrs")));
volatile unsigned int        TMR4CLR __attribute__((section("sfrs")));
volatile unsigned int        TMR4SET __attribute__((section("sfrs")));
volatile unsigned int        TMR4INV __attribute__((section("sfrs")));
volatile unsigned int        PR4 __attribute__((section("sfrs")));
volatile unsigned int        PR4CLR __attribute__((section("sfrs")));
volatile unsigned int        PR4SET __attribute__((section("sfrs")));
volatile unsigned int        PR4INV __attribute__((section("sfrs")));
volatile unsigned int        T5CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T5CONbits_t;*/
volatile __T5CONbits_t T5CONbits __asm__ ("T5CON") __attribute__((section("sfrs")));
volatile unsigned int        T5CONCLR __attribute__((section("sfrs")));
volatile unsigned int        T5CONSET __attribute__((section("sfrs")));
volatile unsigned int        T5CONINV __attribute__((section("sfrs")));
volatile unsigned int        TMR5 __attribute__((section("sfrs")));
volatile unsigned int        TMR5CLR __attribute__((section("sfrs")));
volatile unsigned int        TMR5SET __attribute__((section("sfrs")));
volatile unsigned int        TMR5INV __attribute__((section("sfrs")));
volatile unsigned int        PR5 __attribute__((section("sfrs")));
volatile unsigned int        PR5CLR __attribute__((section("sfrs")));
volatile unsigned int        PR5SET __attribute__((section("sfrs")));
volatile unsigned int        PR5INV __attribute__((section("sfrs")));
volatile unsigned int        T6CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T6CONbits_t;*/
