HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __IC5CONbits_t IC5CONbits __asm__ ("IC5CON") __attribute__((section("sfrs")));
volatile unsigned int        IC5CONCLR __attribute__((section("sfrs")));
volatile unsigned int        IC5CONSET __attribute__((section("sfrs")));
volatile unsigned int        IC5CONINV __attribute__((section("sfrs")));
volatile unsigned int        IC5BUF __attribute__((section("sfrs")));
volatile unsigned int        IC6CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC6CONbits_t;*/
volatile __IC6CONbits_t IC6CONbits __asm__ ("IC6CON") __attribute__((section("sfrs")));
volatile unsigned int        IC6CONCLR __attribute__((section("sfrs")));
volatile unsigned int        IC6CONSET __attribute__((section("sfrs")));
volatile unsigned int        IC6CONINV __attribute__((section("sfrs")));
volatile unsigned int        IC6BUF __attribute__((section("sfrs")));
volatile unsigned int        IC7CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC7CONbits_t;*/
volatile __IC7CONbits_t IC7CONbits __asm__ ("IC7CON") __attribute__((section("sfrs")));
volatile unsigned int        IC7CONCLR __attribute__((section("sfrs")));
volatile unsigned int        IC7CONSET __attribute__((section("sfrs")));
volatile unsigned int        IC7CONINV __attribute__((section("sfrs")));
volatile unsigned int        IC7BUF __attribute__((section("sfrs")));
volatile unsigned int        IC8CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC8CONbits_t;*/
volatile __IC8CONbits_t IC8CONbits __asm__ ("IC8CON") __attribute__((section("sfrs")));
volatile unsigned int        IC8CONCLR __attribute__((section("sfrs")));
volatile unsigned int        IC8CONSET __attribute__((section("sfrs")));
volatile unsigned int        IC8CONINV __attribute__((section("sfrs")));
volatile unsigned int        IC8BUF __attribute__((section("sfrs")));
volatile unsigned int        IC9CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC9CONbits_t;*/
volatile __IC9CONbits_t IC9CONbits __asm__ ("IC9CON") __attribute__((section("sfrs")));
volatile unsigned int        IC9CONCLR __attribute__((section("sfrs")));
volatile unsigned int        IC9CONSET __attribute__((section("sfrs")));
volatile unsigned int        IC9CONINV __attribute__((section("sfrs")));
volatile unsigned int        IC9BUF __attribute__((section("sfrs")));
volatile unsigned int        OC1CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC1CONbits_t;*/
volatile __OC1CONbits_t OC1CONbits __asm__ ("OC1CON") __attribute__((section("sfrs")));
volatile unsigned int        OC1CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC1CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC1CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC1R __attribute__((section("sfrs")));
volatile unsigned int        OC1RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC1RSET __attribute__((section("sfrs")));
volatile unsigned int        OC1RINV __attribute__((section("sfrs")));
volatile unsigned int        OC1RS __attribute__((section("sfrs")));
volatile unsigned int        OC1RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC1RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC1RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC2CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC2CONbits_t;*/
volatile __OC2CONbits_t OC2CONbits __asm__ ("OC2CON") __attribute__((section("sfrs")));
volatile unsigned int        OC2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC2CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC2CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC2R __attribute__((section("sfrs")));
volatile unsigned int        OC2RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC2RSET __attribute__((section("sfrs")));
volatile unsigned int        OC2RINV __attribute__((section("sfrs")));
volatile unsigned int        OC2RS __attribute__((section("sfrs")));
volatile unsigned int        OC2RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC2RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC2RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC3CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC3CONbits_t;*/
volatile __OC3CONbits_t OC3CONbits __asm__ ("OC3CON") __attribute__((section("sfrs")));
volatile unsigned int        OC3CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC3CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC3CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC3R __attribute__((section("sfrs")));
volatile unsigned int        OC3RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC3RSET __attribute__((section("sfrs")));
volatile unsigned int        OC3RINV __attribute__((section("sfrs")));
volatile unsigned int        OC3RS __attribute__((section("sfrs")));
volatile unsigned int        OC3RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC3RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC3RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC4CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC4CONbits_t;*/
volatile __OC4CONbits_t OC4CONbits __asm__ ("OC4CON") __attribute__((section("sfrs")));
volatile unsigned int        OC4CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC4CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC4CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC4R __attribute__((section("sfrs")));
volatile unsigned int        OC4RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC4RSET __attribute__((section("sfrs")));
volatile unsigned int        OC4RINV __attribute__((section("sfrs")));
volatile unsigned int        OC4RS __attribute__((section("sfrs")));
volatile unsigned int        OC4RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC4RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC4RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC5CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC5CONbits_t;*/
volatile __OC5CONbits_t OC5CONbits __asm__ ("OC5CON") __attribute__((section("sfrs")));
volatile unsigned int        OC5CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC5CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC5CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC5R __attribute__((section("sfrs")));
volatile unsigned int        OC5RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC5RSET __attribute__((section("sfrs")));
volatile unsigned int        OC5RINV __attribute__((section("sfrs")));
volatile unsigned int        OC5RS __attribute__((section("sfrs")));
volatile unsigned int        OC5RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC5RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC5RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC6CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC6CONbits_t;*/
