HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __OC6CONbits_t OC6CONbits __asm__ ("OC6CON") __attribute__((section("sfrs")));
volatile unsigned int        OC6CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC6CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC6CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC6R __attribute__((section("sfrs")));
volatile unsigned int        OC6RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC6RSET __attribute__((section("sfrs")));
volatile unsigned int        OC6RINV __attribute__((section("sfrs")));
volatile unsigned int        OC6RS __attribute__((section("sfrs")));
volatile unsigned int        OC6RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC6RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC6RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC7CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC7CONbits_t;*/
volatile __OC7CONbits_t OC7CONbits __asm__ ("OC7CON") __attribute__((section("sfrs")));
volatile unsigned int        OC7CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC7CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC7CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC7R __attribute__((section("sfrs")));
volatile unsigned int        OC7RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC7RSET __attribute__((section("sfrs")));
volatile unsigned int        OC7RINV __attribute__((section("sfrs")));
volatile unsigned int        OC7RS __attribute__((section("sfrs")));
volatile unsigned int        OC7RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC7RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC7RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC8CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC8CONbits_t;*/
volatile __OC8CONbits_t OC8CONbits __asm__ ("OC8CON") __attribute__((section("sfrs")));
volatile unsigned int        OC8CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC8CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC8CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC8R __attribute__((section("sfrs")));
volatile unsigned int        OC8RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC8RSET __attribute__((section("sfrs")));
volatile unsigned int        OC8RINV __attribute__((section("sfrs")));
volatile unsigned int        OC8RS __attribute__((section("sfrs")));
volatile unsigned int        OC8RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC8RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC8RSINV __attribute__((section("sfrs")));
volatile unsigned int        OC9CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC9CONbits_t;*/
volatile __OC9CONbits_t OC9CONbits __asm__ ("OC9CON") __attribute__((section("sfrs")));
volatile unsigned int        OC9CONCLR __attribute__((section("sfrs")));
volatile unsigned int        OC9CONSET __attribute__((section("sfrs")));
volatile unsigned int        OC9CONINV __attribute__((section("sfrs")));
volatile unsigned int        OC9R __attribute__((section("sfrs")));
volatile unsigned int        OC9RCLR __attribute__((section("sfrs")));
volatile unsigned int        OC9RSET __attribute__((section("sfrs")));
volatile unsigned int        OC9RINV __attribute__((section("sfrs")));
volatile unsigned int        OC9RS __attribute__((section("sfrs")));
volatile unsigned int        OC9RSCLR __attribute__((section("sfrs")));
volatile unsigned int        OC9RSSET __attribute__((section("sfrs")));
volatile unsigned int        OC9RSINV __attribute__((section("sfrs")));
volatile unsigned int        AD1CON1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :11;
  unsigned FRACT:1;
  unsigned :1;
  unsigned ADSIDL:1;
  unsigned :1;
  unsigned ADCEN:1;
  unsigned EIE:3;
  unsigned :3;
  unsigned STRGSRC:5;
  unsigned FILTRDLY:5;
} __AD1CON1bits_t;*/
volatile __AD1CON1bits_t AD1CON1bits __asm__ ("AD1CON1") __attribute__((section("sfrs")));
volatile unsigned int        AD1CON2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCDIV:7;
  unsigned :1;
  unsigned ADCSEL:2;
  unsigned :3;
  unsigned LOWPWR:1;
  unsigned BOOST:1;
  unsigned :1;
  unsigned SAMC:8;
  unsigned :7;
  unsigned ADCRDY:1;
} __AD1CON2bits_t;*/
volatile __AD1CON2bits_t AD1CON2bits __asm__ ("AD1CON2") __attribute__((section("sfrs")));
volatile unsigned int        AD1CON3 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADINSEL:6;
  unsigned :4;
  unsigned VREFSEL:3;
  unsigned :16;
  unsigned RQCONVRT:1;
  unsigned GSWTRG:1;
  unsigned CAL:1;
} __AD1CON3bits_t;*/
volatile __AD1CON3bits_t AD1CON3bits __asm__ ("AD1CON3") __attribute__((section("sfrs")));
volatile unsigned int        AD1IMOD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SH0MOD:2;
  unsigned SH1MOD:2;
  unsigned SH2MOD:2;
  unsigned SH3MOD:2;
  unsigned SH4MOD:2;
  unsigned SH5MOD:2;
  unsigned :4;
  unsigned SH0ALT:2;
  unsigned SH1ALT:2;
  unsigned SH2ALT:2;
  unsigned SH3ALT:2;
  unsigned SH4ALT:2;
} __AD1IMODbits_t;*/
volatile __AD1IMODbits_t AD1IMODbits __asm__ ("AD1IMOD") __attribute__((section("sfrs")));
volatile unsigned int        AD1GIRQEN1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned AGIEN0:1;
  unsigned AGIEN1:1;
  unsigned AGIEN2:1;
  unsigned AGIEN3:1;
  unsigned AGIEN4:1;
  unsigned AGIEN5:1;
  unsigned AGIEN6:1;
  unsigned AGIEN7:1;
  unsigned AGIEN8:1;
  unsigned AGIEN9:1;
  unsigned AGIEN10:1;
  unsigned AGIEN11:1;
  unsigned AGIEN12:1;
  unsigned AGIEN13:1;
  unsigned AGIEN14:1;
  unsigned AGIEN15:1;
  unsigned AGIEN16:1;
  unsigned AGIEN17:1;
  unsigned AGIEN18:1;
  unsigned AGIEN19:1;
  unsigned AGIEN20:1;
  unsigned AGIEN21:1;
  unsigned AGIEN22:1;
  unsigned AGIEN23:1;
  unsigned AGIEN24:1;
  unsigned AGIEN25:1;
  unsigned AGIEN26:1;
  unsigned AGIEN27:1;
  unsigned AGIEN28:1;
  unsigned AGIEN29:1;
  unsigned AGIEN30:1;
  unsigned AGIEN31:1;
} __AD1GIRQEN1bits_t;*/
volatile __AD1GIRQEN1bits_t AD1GIRQEN1bits __asm__ ("AD1GIRQEN1") __attribute__((section("sfrs")));
volatile unsigned int        AD1GIRQEN2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned AGIEN32:1;
  unsigned AGIEN33:1;
  unsigned AGIEN34:1;
  unsigned :8;
  unsigned AGIEN43:1;
  unsigned AGIEN44:1;
} __AD1GIRQEN2bits_t;*/
volatile __AD1GIRQEN2bits_t AD1GIRQEN2bits __asm__ ("AD1GIRQEN2") __attribute__((section("sfrs")));
volatile unsigned int        AD1CSS1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CSS0:1;
  unsigned CSS1:1;
  unsigned CSS2:1;
  unsigned CSS3:1;
  unsigned CSS4:1;
  unsigned CSS5:1;
  unsigned CSS6:1;
  unsigned CSS7:1;
  unsigned CSS8:1;
  unsigned CSS9:1;
  unsigned CSS10:1;
  unsigned CSS11:1;
  unsigned CSS12:1;
  unsigned CSS13:1;
  unsigned CSS14:1;
  unsigned CSS15:1;
  unsigned CSS16:1;
  unsigned CSS17:1;
  unsigned CSS18:1;
  unsigned CSS19:1;
  unsigned CSS20:1;
  unsigned CSS21:1;
  unsigned CSS22:1;
  unsigned CSS23:1;
  unsigned CSS24:1;
  unsigned CSS25:1;
  unsigned CSS26:1;
  unsigned CSS27:1;
  unsigned CSS28:1;
  unsigned CSS29:1;
  unsigned CSS30:1;
  unsigned CSS31:1;
} __AD1CSS1bits_t;*/
