HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __AD1CSS1bits_t AD1CSS1bits __asm__ ("AD1CSS1") __attribute__((section("sfrs")));
volatile unsigned int        AD1CSS2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CSS32:1;
  unsigned CSS33:1;
  unsigned CSS34:1;
  unsigned :8;
  unsigned CSS43:1;
  unsigned CSS44:1;
} __AD1CSS2bits_t;*/
volatile __AD1CSS2bits_t AD1CSS2bits __asm__ ("AD1CSS2") __attribute__((section("sfrs")));
volatile unsigned int        AD1DSTAT1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ARDY0:1;
  unsigned ARDY1:1;
  unsigned ARDY2:1;
  unsigned ARDY3:1;
  unsigned ARDY4:1;
  unsigned ARDY5:1;
  unsigned ARDY6:1;
  unsigned ARDY7:1;
  unsigned ARDY8:1;
  unsigned ARDY9:1;
  unsigned ARDY10:1;
  unsigned ARDY11:1;
  unsigned ARDY12:1;
  unsigned ARDY13:1;
  unsigned ARDY14:1;
  unsigned ARDY15:1;
  unsigned ARDY16:1;
  unsigned ARDY17:1;
  unsigned ARDY18:1;
  unsigned ARDY19:1;
  unsigned ARDY20:1;
  unsigned ARDY21:1;
  unsigned ARDY22:1;
  unsigned ARDY23:1;
  unsigned ARDY24:1;
  unsigned ARDY25:1;
  unsigned ARDY26:1;
  unsigned ARDY27:1;
  unsigned ARDY28:1;
  unsigned ARDY29:1;
  unsigned ARDY30:1;
  unsigned ARDY31:1;
} __AD1DSTAT1bits_t;*/
volatile __AD1DSTAT1bits_t AD1DSTAT1bits __asm__ ("AD1DSTAT1") __attribute__((section("sfrs")));
volatile unsigned int        AD1DSTAT2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ARDY32:1;
  unsigned ARDY33:1;
  unsigned ARDY34:1;
  unsigned :8;
  unsigned ARDY43:1;
  unsigned ARDY44:1;
} __AD1DSTAT2bits_t;*/
volatile __AD1DSTAT2bits_t AD1DSTAT2bits __asm__ ("AD1DSTAT2") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPEN1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
  unsigned CMPE19:1;
  unsigned CMPE20:1;
  unsigned CMPE21:1;
  unsigned CMPE22:1;
  unsigned CMPE23:1;
  unsigned CMPE24:1;
  unsigned CMPE25:1;
  unsigned CMPE26:1;
  unsigned CMPE27:1;
  unsigned CMPE28:1;
  unsigned CMPE29:1;
  unsigned CMPE30:1;
  unsigned CMPE31:1;
} __AD1CMPEN1bits_t;*/
volatile __AD1CMPEN1bits_t AD1CMPEN1bits __asm__ ("AD1CMPEN1") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMP1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP1bits_t;*/
volatile __AD1CMP1bits_t AD1CMP1bits __asm__ ("AD1CMP1") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPEN2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
  unsigned CMPE19:1;
  unsigned CMPE20:1;
  unsigned CMPE21:1;
  unsigned CMPE22:1;
  unsigned CMPE23:1;
  unsigned CMPE24:1;
  unsigned CMPE25:1;
  unsigned CMPE26:1;
  unsigned CMPE27:1;
  unsigned CMPE28:1;
  unsigned CMPE29:1;
  unsigned CMPE30:1;
  unsigned CMPE31:1;
} __AD1CMPEN2bits_t;*/
volatile __AD1CMPEN2bits_t AD1CMPEN2bits __asm__ ("AD1CMPEN2") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMP2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP2bits_t;*/
volatile __AD1CMP2bits_t AD1CMP2bits __asm__ ("AD1CMP2") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPEN3 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
  unsigned CMPE19:1;
  unsigned CMPE20:1;
  unsigned CMPE21:1;
  unsigned CMPE22:1;
  unsigned CMPE23:1;
  unsigned CMPE24:1;
  unsigned CMPE25:1;
  unsigned CMPE26:1;
  unsigned CMPE27:1;
  unsigned CMPE28:1;
  unsigned CMPE29:1;
  unsigned CMPE30:1;
  unsigned CMPE31:1;
} __AD1CMPEN3bits_t;*/
volatile __AD1CMPEN3bits_t AD1CMPEN3bits __asm__ ("AD1CMPEN3") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMP3 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP3bits_t;*/
volatile __AD1CMP3bits_t AD1CMP3bits __asm__ ("AD1CMP3") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPEN4 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
  unsigned CMPE19:1;
  unsigned CMPE20:1;
  unsigned CMPE21:1;
  unsigned CMPE22:1;
  unsigned CMPE23:1;
  unsigned CMPE24:1;
  unsigned CMPE25:1;
  unsigned CMPE26:1;
  unsigned CMPE27:1;
  unsigned CMPE28:1;
  unsigned CMPE29:1;
  unsigned CMPE30:1;
  unsigned CMPE31:1;
} __AD1CMPEN4bits_t;*/
volatile __AD1CMPEN4bits_t AD1CMPEN4bits __asm__ ("AD1CMPEN4") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMP4 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP4bits_t;*/
