HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __AD1CMPCON3bits_t AD1CMPCON3bits __asm__ ("AD1CMPCON3") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPCON4 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON4bits_t;*/
volatile __AD1CMPCON4bits_t AD1CMPCON4bits __asm__ ("AD1CMPCON4") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPCON5 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON5bits_t;*/
volatile __AD1CMPCON5bits_t AD1CMPCON5bits __asm__ ("AD1CMPCON5") __attribute__((section("sfrs")));
volatile unsigned int        AD1CMPCON6 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON6bits_t;*/
volatile __AD1CMPCON6bits_t AD1CMPCON6bits __asm__ ("AD1CMPCON6") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA0bits_t;*/
volatile __AD1DATA0bits_t AD1DATA0bits __asm__ ("AD1DATA0") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA1bits_t;*/
volatile __AD1DATA1bits_t AD1DATA1bits __asm__ ("AD1DATA1") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA2bits_t;*/
volatile __AD1DATA2bits_t AD1DATA2bits __asm__ ("AD1DATA2") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA3 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA3bits_t;*/
volatile __AD1DATA3bits_t AD1DATA3bits __asm__ ("AD1DATA3") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA4 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA4bits_t;*/
volatile __AD1DATA4bits_t AD1DATA4bits __asm__ ("AD1DATA4") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA5 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA5bits_t;*/
volatile __AD1DATA5bits_t AD1DATA5bits __asm__ ("AD1DATA5") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA6 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA6bits_t;*/
volatile __AD1DATA6bits_t AD1DATA6bits __asm__ ("AD1DATA6") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA7 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA7bits_t;*/
volatile __AD1DATA7bits_t AD1DATA7bits __asm__ ("AD1DATA7") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA8 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA8bits_t;*/
volatile __AD1DATA8bits_t AD1DATA8bits __asm__ ("AD1DATA8") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA9 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA9bits_t;*/
volatile __AD1DATA9bits_t AD1DATA9bits __asm__ ("AD1DATA9") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA10 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA10bits_t;*/
volatile __AD1DATA10bits_t AD1DATA10bits __asm__ ("AD1DATA10") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA11 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA11bits_t;*/
volatile __AD1DATA11bits_t AD1DATA11bits __asm__ ("AD1DATA11") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA12 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA12bits_t;*/
volatile __AD1DATA12bits_t AD1DATA12bits __asm__ ("AD1DATA12") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA13 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA13bits_t;*/
volatile __AD1DATA13bits_t AD1DATA13bits __asm__ ("AD1DATA13") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA14 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA14bits_t;*/
volatile __AD1DATA14bits_t AD1DATA14bits __asm__ ("AD1DATA14") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA15 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA15bits_t;*/
volatile __AD1DATA15bits_t AD1DATA15bits __asm__ ("AD1DATA15") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA16 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA16bits_t;*/
volatile __AD1DATA16bits_t AD1DATA16bits __asm__ ("AD1DATA16") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA17 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA17bits_t;*/
volatile __AD1DATA17bits_t AD1DATA17bits __asm__ ("AD1DATA17") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA18 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA18bits_t;*/
volatile __AD1DATA18bits_t AD1DATA18bits __asm__ ("AD1DATA18") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA19 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA19bits_t;*/
volatile __AD1DATA19bits_t AD1DATA19bits __asm__ ("AD1DATA19") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA20 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA20bits_t;*/
volatile __AD1DATA20bits_t AD1DATA20bits __asm__ ("AD1DATA20") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA21 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA21bits_t;*/
