HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __AD1DATA21bits_t AD1DATA21bits __asm__ ("AD1DATA21") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA22 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA22bits_t;*/
volatile __AD1DATA22bits_t AD1DATA22bits __asm__ ("AD1DATA22") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA23 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA23bits_t;*/
volatile __AD1DATA23bits_t AD1DATA23bits __asm__ ("AD1DATA23") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA24 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA24bits_t;*/
volatile __AD1DATA24bits_t AD1DATA24bits __asm__ ("AD1DATA24") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA25 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA25bits_t;*/
volatile __AD1DATA25bits_t AD1DATA25bits __asm__ ("AD1DATA25") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA26 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA26bits_t;*/
volatile __AD1DATA26bits_t AD1DATA26bits __asm__ ("AD1DATA26") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA27 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA27bits_t;*/
volatile __AD1DATA27bits_t AD1DATA27bits __asm__ ("AD1DATA27") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA28 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA28bits_t;*/
volatile __AD1DATA28bits_t AD1DATA28bits __asm__ ("AD1DATA28") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA29 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA29bits_t;*/
volatile __AD1DATA29bits_t AD1DATA29bits __asm__ ("AD1DATA29") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA30 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA30bits_t;*/
volatile __AD1DATA30bits_t AD1DATA30bits __asm__ ("AD1DATA30") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA31 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA31bits_t;*/
volatile __AD1DATA31bits_t AD1DATA31bits __asm__ ("AD1DATA31") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA32 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA32bits_t;*/
volatile __AD1DATA32bits_t AD1DATA32bits __asm__ ("AD1DATA32") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA33 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA33bits_t;*/
volatile __AD1DATA33bits_t AD1DATA33bits __asm__ ("AD1DATA33") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA34 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA34bits_t;*/
volatile __AD1DATA34bits_t AD1DATA34bits __asm__ ("AD1DATA34") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA43 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA43bits_t;*/
volatile __AD1DATA43bits_t AD1DATA43bits __asm__ ("AD1DATA43") __attribute__((section("sfrs")));
volatile unsigned int        AD1DATA44 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __AD1DATA44bits_t;*/
volatile __AD1DATA44bits_t AD1DATA44bits __asm__ ("AD1DATA44") __attribute__((section("sfrs")));
volatile unsigned int        AD1CAL1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCAL:32;
} __AD1CAL1bits_t;*/
volatile __AD1CAL1bits_t AD1CAL1bits __asm__ ("AD1CAL1") __attribute__((section("sfrs")));
volatile unsigned int        AD1CAL2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCAL:32;
} __AD1CAL2bits_t;*/
volatile __AD1CAL2bits_t AD1CAL2bits __asm__ ("AD1CAL2") __attribute__((section("sfrs")));
volatile unsigned int        AD1CAL3 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCAL:32;
} __AD1CAL3bits_t;*/
volatile __AD1CAL3bits_t AD1CAL3bits __asm__ ("AD1CAL3") __attribute__((section("sfrs")));
volatile unsigned int        AD1CAL4 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCAL:32;
} __AD1CAL4bits_t;*/
volatile __AD1CAL4bits_t AD1CAL4bits __asm__ ("AD1CAL4") __attribute__((section("sfrs")));
volatile unsigned int        AD1CAL5 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCAL:32;
} __AD1CAL5bits_t;*/
volatile __AD1CAL5bits_t AD1CAL5bits __asm__ ("AD1CAL5") __attribute__((section("sfrs")));
volatile unsigned int        CM1CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :4;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM1CONbits_t;*/
volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs")));
volatile unsigned int        CM1CONCLR __attribute__((section("sfrs")));
volatile unsigned int        CM1CONSET __attribute__((section("sfrs")));
volatile unsigned int        CM1CONINV __attribute__((section("sfrs")));
volatile unsigned int        CM2CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :4;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM2CONbits_t;*/
volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs")));
volatile unsigned int        CM2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        CM2CONSET __attribute__((section("sfrs")));
volatile unsigned int        CM2CONINV __attribute__((section("sfrs")));
volatile unsigned int        CMSTAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned C1OUT:1;
    unsigned C2OUT:1;
    unsigned :11;
    unsigned SIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __CMSTATbits_t;*/
volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs")));
volatile unsigned int        CMSTATCLR __attribute__((section("sfrs")));
volatile unsigned int        CMSTATSET __attribute__((section("sfrs")));
volatile unsigned int        CMSTATINV __attribute__((section("sfrs")));
volatile unsigned int        ANSELA __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ANSA0:1;
    unsigned ANSA1:1;
    unsigned :3;
    unsigned ANSA5:1;
    unsigned :3;
    unsigned ANSA9:1;
    unsigned ANSA10:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELAbits_t;*/
volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs")));
volatile unsigned int        ANSELACLR __attribute__((section("sfrs")));
volatile unsigned int        ANSELASET __attribute__((section("sfrs")));
volatile unsigned int        ANSELAINV __attribute__((section("sfrs")));
volatile unsigned int        TRISA __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISA0:1;
    unsigned TRISA1:1;
    unsigned TRISA2:1;
    unsigned TRISA3:1;
    unsigned TRISA4:1;
    unsigned TRISA5:1;
    unsigned TRISA6:1;
    unsigned TRISA7:1;
    unsigned :1;
    unsigned TRISA9:1;
    unsigned TRISA10:1;
    unsigned :3;
    unsigned TRISA14:1;
    unsigned TRISA15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISAbits_t;*/
volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs")));
volatile unsigned int        TRISACLR __attribute__((section("sfrs")));
volatile unsigned int        TRISASET __attribute__((section("sfrs")));
volatile unsigned int        TRISAINV __attribute__((section("sfrs")));
volatile unsigned int        PORTA __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned RA2:1;
    unsigned RA3:1;
    unsigned RA4:1;
    unsigned RA5:1;
    unsigned RA6:1;
    unsigned RA7:1;
    unsigned :1;
    unsigned RA9:1;
    unsigned RA10:1;
    unsigned :3;
    unsigned RA14:1;
    unsigned RA15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTAbits_t;*/
volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs")));
volatile unsigned int        PORTACLR __attribute__((section("sfrs")));
volatile unsigned int        PORTASET __attribute__((section("sfrs")));
volatile unsigned int        PORTAINV __attribute__((section("sfrs")));
volatile unsigned int        LATA __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATA0:1;
    unsigned LATA1:1;
    unsigned LATA2:1;
    unsigned LATA3:1;
    unsigned LATA4:1;
    unsigned LATA5:1;
    unsigned LATA6:1;
    unsigned LATA7:1;
    unsigned :1;
    unsigned LATA9:1;
    unsigned LATA10:1;
    unsigned :3;
    unsigned LATA14:1;
    unsigned LATA15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATAbits_t;*/
