HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs")));
volatile unsigned int        LATBCLR __attribute__((section("sfrs")));
volatile unsigned int        LATBSET __attribute__((section("sfrs")));
volatile unsigned int        LATBINV __attribute__((section("sfrs")));
volatile unsigned int        ODCB __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCB0:1;
    unsigned ODCB1:1;
    unsigned ODCB2:1;
    unsigned ODCB3:1;
    unsigned ODCB4:1;
    unsigned ODCB5:1;
    unsigned ODCB6:1;
    unsigned ODCB7:1;
    unsigned ODCB8:1;
    unsigned ODCB9:1;
    unsigned ODCB10:1;
    unsigned ODCB11:1;
    unsigned ODCB12:1;
    unsigned ODCB13:1;
    unsigned ODCB14:1;
    unsigned ODCB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCBbits_t;*/
volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs")));
volatile unsigned int        ODCBCLR __attribute__((section("sfrs")));
volatile unsigned int        ODCBSET __attribute__((section("sfrs")));
volatile unsigned int        ODCBINV __attribute__((section("sfrs")));
volatile unsigned int        CNPUB __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUB0:1;
    unsigned CNPUB1:1;
    unsigned CNPUB2:1;
    unsigned CNPUB3:1;
    unsigned CNPUB4:1;
    unsigned CNPUB5:1;
    unsigned CNPUB6:1;
    unsigned CNPUB7:1;
    unsigned CNPUB8:1;
    unsigned CNPUB9:1;
    unsigned CNPUB10:1;
    unsigned CNPUB11:1;
    unsigned CNPUB12:1;
    unsigned CNPUB13:1;
    unsigned CNPUB14:1;
    unsigned CNPUB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUBbits_t;*/
volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs")));
volatile unsigned int        CNPUBCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPUBSET __attribute__((section("sfrs")));
volatile unsigned int        CNPUBINV __attribute__((section("sfrs")));
volatile unsigned int        CNPDB __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDB0:1;
    unsigned CNPDB1:1;
    unsigned CNPDB2:1;
    unsigned CNPDB3:1;
    unsigned CNPDB4:1;
    unsigned CNPDB5:1;
    unsigned CNPDB6:1;
    unsigned CNPDB7:1;
    unsigned CNPDB8:1;
    unsigned CNPDB9:1;
    unsigned CNPDB10:1;
    unsigned CNPDB11:1;
    unsigned CNPDB12:1;
    unsigned CNPDB13:1;
    unsigned CNPDB14:1;
    unsigned CNPDB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDBbits_t;*/
volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs")));
volatile unsigned int        CNPDBCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPDBSET __attribute__((section("sfrs")));
volatile unsigned int        CNPDBINV __attribute__((section("sfrs")));
volatile unsigned int        CNCONB __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONBbits_t;*/
volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs")));
volatile unsigned int        CNCONBCLR __attribute__((section("sfrs")));
volatile unsigned int        CNCONBSET __attribute__((section("sfrs")));
volatile unsigned int        CNCONBINV __attribute__((section("sfrs")));
volatile unsigned int        CNENB __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEB0:1;
    unsigned CNIEB1:1;
    unsigned CNIEB2:1;
    unsigned CNIEB3:1;
    unsigned CNIEB4:1;
    unsigned CNIEB5:1;
    unsigned CNIEB6:1;
    unsigned CNIEB7:1;
    unsigned CNIEB8:1;
    unsigned CNIEB9:1;
    unsigned CNIEB10:1;
    unsigned CNIEB11:1;
    unsigned CNIEB12:1;
    unsigned CNIEB13:1;
    unsigned CNIEB14:1;
    unsigned CNIEB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENBbits_t;*/
volatile __CNENBbits_t CNENBbits __asm__ ("CNENB") __attribute__((section("sfrs")));
volatile unsigned int        CNENBCLR __attribute__((section("sfrs")));
volatile unsigned int        CNENBSET __attribute__((section("sfrs")));
volatile unsigned int        CNENBINV __attribute__((section("sfrs")));
volatile unsigned int        CNSTATB __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATB0:1;
    unsigned CNSTATB1:1;
    unsigned CNSTATB2:1;
    unsigned CNSTATB3:1;
    unsigned CNSTATB4:1;
    unsigned CNSTATB5:1;
    unsigned CNSTATB6:1;
    unsigned CNSTATB7:1;
    unsigned CNSTATB8:1;
    unsigned CNSTATB9:1;
    unsigned CNSTATB10:1;
    unsigned CNSTATB11:1;
    unsigned CNSTATB12:1;
    unsigned CNSTATB13:1;
    unsigned CNSTATB14:1;
    unsigned CNSTATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATBbits_t;*/
volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs")));
volatile unsigned int        CNSTATBCLR __attribute__((section("sfrs")));
volatile unsigned int        CNSTATBSET __attribute__((section("sfrs")));
volatile unsigned int        CNSTATBINV __attribute__((section("sfrs")));
volatile unsigned int        ANSELC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned ANSC1:1;
    unsigned ANSC2:1;
    unsigned ANSC3:1;
    unsigned ANSC4:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELCbits_t;*/
volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs")));
volatile unsigned int        ANSELCCLR __attribute__((section("sfrs")));
volatile unsigned int        ANSELCSET __attribute__((section("sfrs")));
volatile unsigned int        ANSELCINV __attribute__((section("sfrs")));
volatile unsigned int        TRISC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned TRISC4:1;
    unsigned :7;
    unsigned TRISC12:1;
    unsigned TRISC13:1;
    unsigned TRISC14:1;
    unsigned TRISC15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISCbits_t;*/
volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs")));
volatile unsigned int        TRISCCLR __attribute__((section("sfrs")));
volatile unsigned int        TRISCSET __attribute__((section("sfrs")));
volatile unsigned int        TRISCINV __attribute__((section("sfrs")));
volatile unsigned int        PORTC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned :7;
    unsigned RC12:1;
    unsigned RC13:1;
    unsigned RC14:1;
    unsigned RC15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTCbits_t;*/
