HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __PORTDbits_t PORTDbits __asm__ ("PORTD") __attribute__((section("sfrs")));
volatile unsigned int        PORTDCLR __attribute__((section("sfrs")));
volatile unsigned int        PORTDSET __attribute__((section("sfrs")));
volatile unsigned int        PORTDINV __attribute__((section("sfrs")));
volatile unsigned int        LATD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATD0:1;
    unsigned LATD1:1;
    unsigned LATD2:1;
    unsigned LATD3:1;
    unsigned LATD4:1;
    unsigned LATD5:1;
    unsigned :3;
    unsigned LATD9:1;
    unsigned LATD10:1;
    unsigned LATD11:1;
    unsigned LATD12:1;
    unsigned LATD13:1;
    unsigned LATD14:1;
    unsigned LATD15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATDbits_t;*/
volatile __LATDbits_t LATDbits __asm__ ("LATD") __attribute__((section("sfrs")));
volatile unsigned int        LATDCLR __attribute__((section("sfrs")));
volatile unsigned int        LATDSET __attribute__((section("sfrs")));
volatile unsigned int        LATDINV __attribute__((section("sfrs")));
volatile unsigned int        ODCD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCD0:1;
    unsigned ODCD1:1;
    unsigned ODCD2:1;
    unsigned ODCD3:1;
    unsigned ODCD4:1;
    unsigned ODCD5:1;
    unsigned :3;
    unsigned ODCD9:1;
    unsigned ODCD10:1;
    unsigned ODCD11:1;
    unsigned ODCD12:1;
    unsigned ODCD13:1;
    unsigned ODCD14:1;
    unsigned ODCD15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCDbits_t;*/
volatile __ODCDbits_t ODCDbits __asm__ ("ODCD") __attribute__((section("sfrs")));
volatile unsigned int        ODCDCLR __attribute__((section("sfrs")));
volatile unsigned int        ODCDSET __attribute__((section("sfrs")));
volatile unsigned int        ODCDINV __attribute__((section("sfrs")));
volatile unsigned int        CNPUD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUD0:1;
    unsigned CNPUD1:1;
    unsigned CNPUD2:1;
    unsigned CNPUD3:1;
    unsigned CNPUD4:1;
    unsigned CNPUD5:1;
    unsigned :3;
    unsigned CNPUD9:1;
    unsigned CNPUD10:1;
    unsigned CNPUD11:1;
    unsigned CNPUD12:1;
    unsigned CNPUD13:1;
    unsigned CNPUD14:1;
    unsigned CNPUD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUDbits_t;*/
volatile __CNPUDbits_t CNPUDbits __asm__ ("CNPUD") __attribute__((section("sfrs")));
volatile unsigned int        CNPUDCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPUDSET __attribute__((section("sfrs")));
volatile unsigned int        CNPUDINV __attribute__((section("sfrs")));
volatile unsigned int        CNPDD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDD0:1;
    unsigned CNPDD1:1;
    unsigned CNPDD2:1;
    unsigned CNPDD3:1;
    unsigned CNPDD4:1;
    unsigned CNPDD5:1;
    unsigned :3;
    unsigned CNPDD9:1;
    unsigned CNPDD10:1;
    unsigned CNPDD11:1;
    unsigned CNPDD12:1;
    unsigned CNPDD13:1;
    unsigned CNPDD14:1;
    unsigned CNPDD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDDbits_t;*/
volatile __CNPDDbits_t CNPDDbits __asm__ ("CNPDD") __attribute__((section("sfrs")));
volatile unsigned int        CNPDDCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPDDSET __attribute__((section("sfrs")));
volatile unsigned int        CNPDDINV __attribute__((section("sfrs")));
volatile unsigned int        CNCOND __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONDbits_t;*/
volatile __CNCONDbits_t CNCONDbits __asm__ ("CNCOND") __attribute__((section("sfrs")));
volatile unsigned int        CNCONDCLR __attribute__((section("sfrs")));
volatile unsigned int        CNCONDSET __attribute__((section("sfrs")));
volatile unsigned int        CNCONDINV __attribute__((section("sfrs")));
volatile unsigned int        CNEND __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIED0:1;
    unsigned CNIED1:1;
    unsigned CNIED2:1;
    unsigned CNIED3:1;
    unsigned CNIED4:1;
    unsigned CNIED5:1;
    unsigned :3;
    unsigned CNIED9:1;
    unsigned CNIED10:1;
    unsigned CNIED11:1;
    unsigned CNIED12:1;
    unsigned CNIED13:1;
    unsigned CNIED14:1;
    unsigned CNIED15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENDbits_t;*/
volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs")));
volatile unsigned int        CNENDCLR __attribute__((section("sfrs")));
volatile unsigned int        CNENDSET __attribute__((section("sfrs")));
volatile unsigned int        CNENDINV __attribute__((section("sfrs")));
volatile unsigned int        CNSTATD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATD0:1;
    unsigned CNSTATD1:1;
    unsigned CNSTATD2:1;
    unsigned CNSTATD3:1;
    unsigned CNSTATD4:1;
    unsigned CNSTATD5:1;
    unsigned :3;
    unsigned CNSTATD9:1;
    unsigned CNSTATD10:1;
    unsigned CNSTATD11:1;
    unsigned CNSTATD12:1;
    unsigned CNSTATD13:1;
    unsigned CNSTATD14:1;
    unsigned CNSTATD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATDbits_t;*/
volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs")));
volatile unsigned int        CNSTATDCLR __attribute__((section("sfrs")));
volatile unsigned int        CNSTATDSET __attribute__((section("sfrs")));
volatile unsigned int        CNSTATDINV __attribute__((section("sfrs")));
volatile unsigned int        ANSELE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :4;
    unsigned ANSE4:1;
    unsigned ANSE5:1;
    unsigned ANSE6:1;
    unsigned ANSE7:1;
    unsigned ANSE8:1;
    unsigned ANSE9:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELEbits_t;*/
volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE") __attribute__((section("sfrs")));
volatile unsigned int        ANSELECLR __attribute__((section("sfrs")));
volatile unsigned int        ANSELESET __attribute__((section("sfrs")));
volatile unsigned int        ANSELEINV __attribute__((section("sfrs")));
volatile unsigned int        TRISE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISE0:1;
    unsigned TRISE1:1;
    unsigned TRISE2:1;
    unsigned TRISE3:1;
    unsigned TRISE4:1;
    unsigned TRISE5:1;
    unsigned TRISE6:1;
    unsigned TRISE7:1;
    unsigned TRISE8:1;
    unsigned TRISE9:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISEbits_t;*/
volatile __TRISEbits_t TRISEbits __asm__ ("TRISE") __attribute__((section("sfrs")));
volatile unsigned int        TRISECLR __attribute__((section("sfrs")));
volatile unsigned int        TRISESET __attribute__((section("sfrs")));
volatile unsigned int        TRISEINV __attribute__((section("sfrs")));
volatile unsigned int        PORTE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned RE2:1;
    unsigned RE3:1;
    unsigned RE4:1;
    unsigned RE5:1;
    unsigned RE6:1;
    unsigned RE7:1;
    unsigned RE8:1;
    unsigned RE9:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTEbits_t;*/
volatile __PORTEbits_t PORTEbits __asm__ ("PORTE") __attribute__((section("sfrs")));
volatile unsigned int        PORTECLR __attribute__((section("sfrs")));
volatile unsigned int        PORTESET __attribute__((section("sfrs")));
volatile unsigned int        PORTEINV __attribute__((section("sfrs")));
volatile unsigned int        LATE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATE0:1;
    unsigned LATE1:1;
    unsigned LATE2:1;
    unsigned LATE3:1;
    unsigned LATE4:1;
    unsigned LATE5:1;
    unsigned LATE6:1;
    unsigned LATE7:1;
    unsigned LATE8:1;
    unsigned LATE9:1;
  };
  struct {
    unsigned w:32;
  };
} __LATEbits_t;*/
