HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs")));
volatile unsigned int        LATECLR __attribute__((section("sfrs")));
volatile unsigned int        LATESET __attribute__((section("sfrs")));
volatile unsigned int        LATEINV __attribute__((section("sfrs")));
volatile unsigned int        ODCE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCE0:1;
    unsigned ODCE1:1;
    unsigned ODCE2:1;
    unsigned ODCE3:1;
    unsigned ODCE4:1;
    unsigned ODCE5:1;
    unsigned ODCE6:1;
    unsigned ODCE7:1;
    unsigned ODCE8:1;
    unsigned ODCE9:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCEbits_t;*/
volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs")));
volatile unsigned int        ODCECLR __attribute__((section("sfrs")));
volatile unsigned int        ODCESET __attribute__((section("sfrs")));
volatile unsigned int        ODCEINV __attribute__((section("sfrs")));
volatile unsigned int        CNPUE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUE0:1;
    unsigned CNPUE1:1;
    unsigned CNPUE2:1;
    unsigned CNPUE3:1;
    unsigned CNPUE4:1;
    unsigned CNPUE5:1;
    unsigned CNPUE6:1;
    unsigned CNPUE7:1;
    unsigned CNPUE8:1;
    unsigned CNPUE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUEbits_t;*/
volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs")));
volatile unsigned int        CNPUECLR __attribute__((section("sfrs")));
volatile unsigned int        CNPUESET __attribute__((section("sfrs")));
volatile unsigned int        CNPUEINV __attribute__((section("sfrs")));
volatile unsigned int        CNPDE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDE0:1;
    unsigned CNPDE1:1;
    unsigned CNPDE2:1;
    unsigned CNPDE3:1;
    unsigned CNPDE4:1;
    unsigned CNPDE5:1;
    unsigned CNPDE6:1;
    unsigned CNPDE7:1;
    unsigned CNPDE8:1;
    unsigned CNPDE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDEbits_t;*/
volatile __CNPDEbits_t CNPDEbits __asm__ ("CNPDE") __attribute__((section("sfrs")));
volatile unsigned int        CNPDECLR __attribute__((section("sfrs")));
volatile unsigned int        CNPDESET __attribute__((section("sfrs")));
volatile unsigned int        CNPDEINV __attribute__((section("sfrs")));
volatile unsigned int        CNCONE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONEbits_t;*/
volatile __CNCONEbits_t CNCONEbits __asm__ ("CNCONE") __attribute__((section("sfrs")));
volatile unsigned int        CNCONECLR __attribute__((section("sfrs")));
volatile unsigned int        CNCONESET __attribute__((section("sfrs")));
volatile unsigned int        CNCONEINV __attribute__((section("sfrs")));
volatile unsigned int        CNENE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEE0:1;
    unsigned CNIEE1:1;
    unsigned CNIEE2:1;
    unsigned CNIEE3:1;
    unsigned CNIEE4:1;
    unsigned CNIEE5:1;
    unsigned CNIEE6:1;
    unsigned CNIEE7:1;
    unsigned CNIEE8:1;
    unsigned CNIEE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENEbits_t;*/
volatile __CNENEbits_t CNENEbits __asm__ ("CNENE") __attribute__((section("sfrs")));
volatile unsigned int        CNENECLR __attribute__((section("sfrs")));
volatile unsigned int        CNENESET __attribute__((section("sfrs")));
volatile unsigned int        CNENEINV __attribute__((section("sfrs")));
volatile unsigned int        CNSTATE __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATE0:1;
    unsigned CNSTATE1:1;
    unsigned CNSTATE2:1;
    unsigned CNSTATE3:1;
    unsigned CNSTATE4:1;
    unsigned CNSTATE5:1;
    unsigned CNSTATE6:1;
    unsigned CNSTATE7:1;
    unsigned CNSTATE8:1;
    unsigned CNSTATE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATEbits_t;*/
volatile __CNSTATEbits_t CNSTATEbits __asm__ ("CNSTATE") __attribute__((section("sfrs")));
volatile unsigned int        CNSTATECLR __attribute__((section("sfrs")));
volatile unsigned int        CNSTATESET __attribute__((section("sfrs")));
volatile unsigned int        CNSTATEINV __attribute__((section("sfrs")));
volatile unsigned int        ANSELF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :12;
    unsigned ANSF12:1;
    unsigned ANSF13:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELFbits_t;*/
volatile __ANSELFbits_t ANSELFbits __asm__ ("ANSELF") __attribute__((section("sfrs")));
volatile unsigned int        ANSELFCLR __attribute__((section("sfrs")));
volatile unsigned int        ANSELFSET __attribute__((section("sfrs")));
volatile unsigned int        ANSELFINV __attribute__((section("sfrs")));
volatile unsigned int        TRISF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISF0:1;
    unsigned TRISF1:1;
    unsigned TRISF2:1;
    unsigned TRISF3:1;
    unsigned TRISF4:1;
    unsigned TRISF5:1;
    unsigned :2;
    unsigned TRISF8:1;
    unsigned :3;
    unsigned TRISF12:1;
    unsigned TRISF13:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISFbits_t;*/
volatile __TRISFbits_t TRISFbits __asm__ ("TRISF") __attribute__((section("sfrs")));
volatile unsigned int        TRISFCLR __attribute__((section("sfrs")));
volatile unsigned int        TRISFSET __attribute__((section("sfrs")));
volatile unsigned int        TRISFINV __attribute__((section("sfrs")));
volatile unsigned int        PORTF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RF0:1;
    unsigned RF1:1;
    unsigned RF2:1;
    unsigned RF3:1;
    unsigned RF4:1;
    unsigned RF5:1;
    unsigned :2;
    unsigned RF8:1;
    unsigned :3;
    unsigned RF12:1;
    unsigned RF13:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTFbits_t;*/
volatile __PORTFbits_t PORTFbits __asm__ ("PORTF") __attribute__((section("sfrs")));
volatile unsigned int        PORTFCLR __attribute__((section("sfrs")));
volatile unsigned int        PORTFSET __attribute__((section("sfrs")));
volatile unsigned int        PORTFINV __attribute__((section("sfrs")));
volatile unsigned int        LATF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATF0:1;
    unsigned LATF1:1;
    unsigned LATF2:1;
    unsigned LATF3:1;
    unsigned LATF4:1;
    unsigned LATF5:1;
    unsigned :2;
    unsigned LATF8:1;
    unsigned :3;
    unsigned LATF12:1;
    unsigned LATF13:1;
  };
  struct {
    unsigned w:32;
  };
} __LATFbits_t;*/
