HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __LATFbits_t LATFbits __asm__ ("LATF") __attribute__((section("sfrs")));
volatile unsigned int        LATFCLR __attribute__((section("sfrs")));
volatile unsigned int        LATFSET __attribute__((section("sfrs")));
volatile unsigned int        LATFINV __attribute__((section("sfrs")));
volatile unsigned int        ODCF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCF0:1;
    unsigned ODCF1:1;
    unsigned ODCF2:1;
    unsigned ODCF3:1;
    unsigned ODCF4:1;
    unsigned ODCF5:1;
    unsigned :2;
    unsigned ODCF8:1;
    unsigned :3;
    unsigned ODCF12:1;
    unsigned ODCF13:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCFbits_t;*/
volatile __ODCFbits_t ODCFbits __asm__ ("ODCF") __attribute__((section("sfrs")));
volatile unsigned int        ODCFCLR __attribute__((section("sfrs")));
volatile unsigned int        ODCFSET __attribute__((section("sfrs")));
volatile unsigned int        ODCFINV __attribute__((section("sfrs")));
volatile unsigned int        CNPUF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUF0:1;
    unsigned CNPUF1:1;
    unsigned CNPUF2:1;
    unsigned CNPUF3:1;
    unsigned CNPUF4:1;
    unsigned CNPUF5:1;
    unsigned :2;
    unsigned CNPUF8:1;
    unsigned :3;
    unsigned CNPUF12:1;
    unsigned CNPUF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUFbits_t;*/
volatile __CNPUFbits_t CNPUFbits __asm__ ("CNPUF") __attribute__((section("sfrs")));
volatile unsigned int        CNPUFCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPUFSET __attribute__((section("sfrs")));
volatile unsigned int        CNPUFINV __attribute__((section("sfrs")));
volatile unsigned int        CNPDF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDF0:1;
    unsigned CNPDF1:1;
    unsigned CNPDF2:1;
    unsigned CNPDF3:1;
    unsigned CNPDF4:1;
    unsigned CNPDF5:1;
    unsigned :2;
    unsigned CNPDF8:1;
    unsigned :3;
    unsigned CNPDF12:1;
    unsigned CNPDF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDFbits_t;*/
volatile __CNPDFbits_t CNPDFbits __asm__ ("CNPDF") __attribute__((section("sfrs")));
volatile unsigned int        CNPDFCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPDFSET __attribute__((section("sfrs")));
volatile unsigned int        CNPDFINV __attribute__((section("sfrs")));
volatile unsigned int        CNCONF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONFbits_t;*/
volatile __CNCONFbits_t CNCONFbits __asm__ ("CNCONF") __attribute__((section("sfrs")));
volatile unsigned int        CNCONFCLR __attribute__((section("sfrs")));
volatile unsigned int        CNCONFSET __attribute__((section("sfrs")));
volatile unsigned int        CNCONFINV __attribute__((section("sfrs")));
volatile unsigned int        CNENF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEF0:1;
    unsigned CNIEF1:1;
    unsigned CNIEF2:1;
    unsigned CNIEF3:1;
    unsigned CNIEF4:1;
    unsigned CNIEF5:1;
    unsigned :2;
    unsigned CNIEF8:1;
    unsigned :3;
    unsigned CNIEF12:1;
    unsigned CNIEF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENFbits_t;*/
volatile __CNENFbits_t CNENFbits __asm__ ("CNENF") __attribute__((section("sfrs")));
volatile unsigned int        CNENFCLR __attribute__((section("sfrs")));
volatile unsigned int        CNENFSET __attribute__((section("sfrs")));
volatile unsigned int        CNENFINV __attribute__((section("sfrs")));
volatile unsigned int        CNSTATF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATF0:1;
    unsigned CNSTATF1:1;
    unsigned CNSTATF2:1;
    unsigned CNSTATF3:1;
    unsigned CNSTATF4:1;
    unsigned CNSTATF5:1;
    unsigned :2;
    unsigned CNSTATF8:1;
    unsigned :3;
    unsigned CNSTATF12:1;
    unsigned CNSTATF13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATFbits_t;*/
volatile __CNSTATFbits_t CNSTATFbits __asm__ ("CNSTATF") __attribute__((section("sfrs")));
volatile unsigned int        CNSTATFCLR __attribute__((section("sfrs")));
volatile unsigned int        CNSTATFSET __attribute__((section("sfrs")));
volatile unsigned int        CNSTATFINV __attribute__((section("sfrs")));
volatile unsigned int        ANSELG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :6;
    unsigned ANSG6:1;
    unsigned ANSG7:1;
    unsigned ANSG8:1;
    unsigned ANSG9:1;
    unsigned :5;
    unsigned ANSG15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELGbits_t;*/
volatile __ANSELGbits_t ANSELGbits __asm__ ("ANSELG") __attribute__((section("sfrs")));
volatile unsigned int        ANSELGCLR __attribute__((section("sfrs")));
volatile unsigned int        ANSELGSET __attribute__((section("sfrs")));
volatile unsigned int        ANSELGINV __attribute__((section("sfrs")));
volatile unsigned int        TRISG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISG0:1;
    unsigned TRISG1:1;
    unsigned :4;
    unsigned TRISG6:1;
    unsigned TRISG7:1;
    unsigned TRISG8:1;
    unsigned TRISG9:1;
    unsigned :2;
    unsigned TRISG12:1;
    unsigned TRISG13:1;
    unsigned TRISG14:1;
    unsigned TRISG15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISGbits_t;*/
volatile __TRISGbits_t TRISGbits __asm__ ("TRISG") __attribute__((section("sfrs")));
volatile unsigned int        TRISGCLR __attribute__((section("sfrs")));
volatile unsigned int        TRISGSET __attribute__((section("sfrs")));
volatile unsigned int        TRISGINV __attribute__((section("sfrs")));
volatile unsigned int        PORTG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RG0:1;
    unsigned RG1:1;
    unsigned :4;
    unsigned RG6:1;
    unsigned RG7:1;
    unsigned RG8:1;
    unsigned RG9:1;
    unsigned :2;
    unsigned RG12:1;
    unsigned RG13:1;
    unsigned RG14:1;
    unsigned RG15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTGbits_t;*/
volatile __PORTGbits_t PORTGbits __asm__ ("PORTG") __attribute__((section("sfrs")));
volatile unsigned int        PORTGCLR __attribute__((section("sfrs")));
volatile unsigned int        PORTGSET __attribute__((section("sfrs")));
volatile unsigned int        PORTGINV __attribute__((section("sfrs")));
volatile unsigned int        LATG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATG0:1;
    unsigned LATG1:1;
    unsigned :4;
    unsigned LATG6:1;
    unsigned LATG7:1;
    unsigned LATG8:1;
    unsigned LATG9:1;
    unsigned :2;
    unsigned LATG12:1;
    unsigned LATG13:1;
    unsigned LATG14:1;
    unsigned LATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATGbits_t;*/
