HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs")));
volatile unsigned int        LATGCLR __attribute__((section("sfrs")));
volatile unsigned int        LATGSET __attribute__((section("sfrs")));
volatile unsigned int        LATGINV __attribute__((section("sfrs")));
volatile unsigned int        ODCG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCG0:1;
    unsigned ODCG1:1;
    unsigned :4;
    unsigned ODCG6:1;
    unsigned ODCG7:1;
    unsigned ODCG8:1;
    unsigned ODCG9:1;
    unsigned :2;
    unsigned ODCG12:1;
    unsigned ODCG13:1;
    unsigned ODCG14:1;
    unsigned ODCG15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCGbits_t;*/
volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs")));
volatile unsigned int        ODCGCLR __attribute__((section("sfrs")));
volatile unsigned int        ODCGSET __attribute__((section("sfrs")));
volatile unsigned int        ODCGINV __attribute__((section("sfrs")));
volatile unsigned int        CNPUG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUG0:1;
    unsigned CNPUG1:1;
    unsigned :4;
    unsigned CNPUG6:1;
    unsigned CNPUG7:1;
    unsigned CNPUG8:1;
    unsigned CNPUG9:1;
    unsigned :2;
    unsigned CNPUG12:1;
    unsigned CNPUG13:1;
    unsigned CNPUG14:1;
    unsigned CNPUG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUGbits_t;*/
volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs")));
volatile unsigned int        CNPUGCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPUGSET __attribute__((section("sfrs")));
volatile unsigned int        CNPUGINV __attribute__((section("sfrs")));
volatile unsigned int        CNPDG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDG0:1;
    unsigned CNPDG1:1;
    unsigned :4;
    unsigned CNPDG6:1;
    unsigned CNPDG7:1;
    unsigned CNPDG8:1;
    unsigned CNPDG9:1;
    unsigned :2;
    unsigned CNPDG12:1;
    unsigned CNPDG13:1;
    unsigned CNPDG14:1;
    unsigned CNPDG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDGbits_t;*/
volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs")));
volatile unsigned int        CNPDGCLR __attribute__((section("sfrs")));
volatile unsigned int        CNPDGSET __attribute__((section("sfrs")));
volatile unsigned int        CNPDGINV __attribute__((section("sfrs")));
volatile unsigned int        CNCONG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONGbits_t;*/
volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs")));
volatile unsigned int        CNCONGCLR __attribute__((section("sfrs")));
volatile unsigned int        CNCONGSET __attribute__((section("sfrs")));
volatile unsigned int        CNCONGINV __attribute__((section("sfrs")));
volatile unsigned int        CNENG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEG0:1;
    unsigned CNIEG1:1;
    unsigned :4;
    unsigned CNIEG6:1;
    unsigned CNIEG7:1;
    unsigned CNIEG8:1;
    unsigned CNIEG9:1;
    unsigned :2;
    unsigned CNIEG12:1;
    unsigned CNIEG13:1;
    unsigned CNIEG14:1;
    unsigned CNIEG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENGbits_t;*/
volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs")));
volatile unsigned int        CNENGCLR __attribute__((section("sfrs")));
volatile unsigned int        CNENGSET __attribute__((section("sfrs")));
volatile unsigned int        CNENGINV __attribute__((section("sfrs")));
volatile unsigned int        CNSTATG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATG0:1;
    unsigned CNSTATG1:1;
    unsigned :4;
    unsigned CNSTATG6:1;
    unsigned CNSTATG7:1;
    unsigned CNSTATG8:1;
    unsigned CNSTATG9:1;
    unsigned :2;
    unsigned CNSTATG12:1;
    unsigned CNSTATG13:1;
    unsigned CNSTATG14:1;
    unsigned CNSTATG15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATGbits_t;*/
volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs")));
volatile unsigned int        CNSTATGCLR __attribute__((section("sfrs")));
volatile unsigned int        CNSTATGSET __attribute__((section("sfrs")));
volatile unsigned int        CNSTATGINV __attribute__((section("sfrs")));
volatile unsigned int        C1CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DNCNT:5;
    unsigned :6;
    unsigned CANBUSY:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned :4;
    unsigned CANCAP:1;
    unsigned OPMOD:3;
    unsigned REQOP:3;
    unsigned ABAT:1;
  };
  struct {
    unsigned w:32;
  };
} __C1CONbits_t;*/
volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs")));
volatile unsigned int        C1CONCLR __attribute__((section("sfrs")));
volatile unsigned int        C1CONSET __attribute__((section("sfrs")));
volatile unsigned int        C1CONINV __attribute__((section("sfrs")));
volatile unsigned int        C1CFG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned BRP:6;
    unsigned SJW:2;
    unsigned PRSEG:3;
    unsigned SEG1PH:3;
    unsigned SAM:1;
    unsigned SEG2PHTS:1;
    unsigned SEG2PH:3;
    unsigned :3;
    unsigned WAKFIL:1;
  };
  struct {
    unsigned w:32;
  };
} __C1CFGbits_t;*/
volatile __C1CFGbits_t C1CFGbits __asm__ ("C1CFG") __attribute__((section("sfrs")));
volatile unsigned int        C1CFGCLR __attribute__((section("sfrs")));
volatile unsigned int        C1CFGSET __attribute__((section("sfrs")));
volatile unsigned int        C1CFGINV __attribute__((section("sfrs")));
volatile unsigned int        C1INT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBIF:1;
    unsigned RBIF:1;
    unsigned CTMRIF:1;
    unsigned MODIF:1;
    unsigned :7;
    unsigned RBOVIF:1;
    unsigned SERRIF:1;
    unsigned CERRIF:1;
    unsigned WAKIF:1;
    unsigned IVRIF:1;
    unsigned TBIE:1;
    unsigned RBIE:1;
    unsigned CTMRIE:1;
    unsigned MODIE:1;
    unsigned :7;
    unsigned RBOVIE:1;
    unsigned SERRIE:1;
    unsigned CERRIE:1;
    unsigned WAKIE:1;
    unsigned IVRIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1INTbits_t;*/
volatile __C1INTbits_t C1INTbits __asm__ ("C1INT") __attribute__((section("sfrs")));
volatile unsigned int        C1INTCLR __attribute__((section("sfrs")));
volatile unsigned int        C1INTSET __attribute__((section("sfrs")));
volatile unsigned int        C1INTINV __attribute__((section("sfrs")));
volatile unsigned int        C1VEC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICODE:7;
    unsigned :1;
    unsigned FILHIT:5;
  };
  struct {
    unsigned w:32;
  };
} __C1VECbits_t;*/
volatile __C1VECbits_t C1VECbits __asm__ ("C1VEC") __attribute__((section("sfrs")));
volatile unsigned int        C1VECCLR __attribute__((section("sfrs")));
volatile unsigned int        C1VECSET __attribute__((section("sfrs")));
volatile unsigned int        C1VECINV __attribute__((section("sfrs")));
volatile unsigned int        C1TREC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RERRCNT:8;
    unsigned TERRCNT:8;
    unsigned EWARN:1;
    unsigned RXWARN:1;
    unsigned TXWARN:1;
    unsigned RXBP:1;
    unsigned TXBP:1;
    unsigned TXBO:1;
  };
  struct {
    unsigned w:32;
  };
} __C1TRECbits_t;*/
