HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1TRECbits_t C1TRECbits __asm__ ("C1TREC") __attribute__((section("sfrs")));
volatile unsigned int        C1TRECCLR __attribute__((section("sfrs")));
volatile unsigned int        C1TRECSET __attribute__((section("sfrs")));
volatile unsigned int        C1TRECINV __attribute__((section("sfrs")));
volatile unsigned int        C1FSTAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FIFOIP:32;
  };
  struct {
    unsigned FIFOIP0:1;
    unsigned FIFOIP1:1;
    unsigned FIFOIP2:1;
    unsigned FIFOIP3:1;
    unsigned FIFOIP4:1;
    unsigned FIFOIP5:1;
    unsigned FIFOIP6:1;
    unsigned FIFOIP7:1;
    unsigned FIFOIP8:1;
    unsigned FIFOIP9:1;
    unsigned FIFOIP10:1;
    unsigned FIFOIP11:1;
    unsigned FIFOIP12:1;
    unsigned FIFOIP13:1;
    unsigned FIFOIP14:1;
    unsigned FIFOIP15:1;
    unsigned FIFOIP16:1;
    unsigned FIFOIP17:1;
    unsigned FIFOIP18:1;
    unsigned FIFOIP19:1;
    unsigned FIFOIP20:1;
    unsigned FIFOIP21:1;
    unsigned FIFOIP22:1;
    unsigned FIFOIP23:1;
    unsigned FIFOIP24:1;
    unsigned FIFOIP25:1;
    unsigned FIFOIP26:1;
    unsigned FIFOIP27:1;
    unsigned FIFOIP28:1;
    unsigned FIFOIP29:1;
    unsigned FIFOIP30:1;
    unsigned FIFOIP31:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FSTATbits_t;*/
volatile __C1FSTATbits_t C1FSTATbits __asm__ ("C1FSTAT") __attribute__((section("sfrs")));
volatile unsigned int        C1FSTATCLR __attribute__((section("sfrs")));
volatile unsigned int        C1FSTATSET __attribute__((section("sfrs")));
volatile unsigned int        C1FSTATINV __attribute__((section("sfrs")));
volatile unsigned int        C1RXOVF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXOVF:32;
  };
  struct {
    unsigned RXOVF0:1;
    unsigned RXOVF1:1;
    unsigned RXOVF2:1;
    unsigned RXOVF3:1;
    unsigned RXOVF4:1;
    unsigned RXOVF5:1;
    unsigned RXOVF6:1;
    unsigned RXOVF7:1;
    unsigned RXOVF8:1;
    unsigned RXOVF9:1;
    unsigned RXOVF10:1;
    unsigned RXOVF11:1;
    unsigned RXOVF12:1;
    unsigned RXOVF13:1;
    unsigned RXOVF14:1;
    unsigned RXOVF15:1;
    unsigned RXOVF16:1;
    unsigned RXOVF17:1;
    unsigned RXOVF18:1;
    unsigned RXOVF19:1;
    unsigned RXOVF20:1;
    unsigned RXOVF21:1;
    unsigned RXOVF22:1;
    unsigned RXOVF23:1;
    unsigned RXOVF24:1;
    unsigned RXOVF25:1;
    unsigned RXOVF26:1;
    unsigned RXOVF27:1;
    unsigned RXOVF28:1;
    unsigned RXOVF29:1;
    unsigned RXOVF30:1;
    unsigned RXOVF31:1;
  };
  struct {
    unsigned w:32;
  };
} __C1RXOVFbits_t;*/
volatile __C1RXOVFbits_t C1RXOVFbits __asm__ ("C1RXOVF") __attribute__((section("sfrs")));
volatile unsigned int        C1RXOVFCLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXOVFSET __attribute__((section("sfrs")));
volatile unsigned int        C1RXOVFINV __attribute__((section("sfrs")));
volatile unsigned int        C1TMR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CANTSPRE:16;
    unsigned CANTS:16;
  };
  struct {
    unsigned w:32;
  };
} __C1TMRbits_t;*/
volatile __C1TMRbits_t C1TMRbits __asm__ ("C1TMR") __attribute__((section("sfrs")));
volatile unsigned int        C1TMRCLR __attribute__((section("sfrs")));
volatile unsigned int        C1TMRSET __attribute__((section("sfrs")));
volatile unsigned int        C1TMRINV __attribute__((section("sfrs")));
volatile unsigned int        C1RXM0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXM0bits_t;*/
volatile __C1RXM0bits_t C1RXM0bits __asm__ ("C1RXM0") __attribute__((section("sfrs")));
volatile unsigned int        C1RXM0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXM0SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXM0INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXM1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXM1bits_t;*/
volatile __C1RXM1bits_t C1RXM1bits __asm__ ("C1RXM1") __attribute__((section("sfrs")));
volatile unsigned int        C1RXM1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXM1SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXM1INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXM2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXM2bits_t;*/
volatile __C1RXM2bits_t C1RXM2bits __asm__ ("C1RXM2") __attribute__((section("sfrs")));
volatile unsigned int        C1RXM2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXM2SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXM2INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXM3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXM3bits_t;*/
volatile __C1RXM3bits_t C1RXM3bits __asm__ ("C1RXM3") __attribute__((section("sfrs")));
volatile unsigned int        C1RXM3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXM3SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXM3INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL0:5;
    unsigned MSEL0:2;
    unsigned FLTEN0:1;
    unsigned FSEL1:5;
    unsigned MSEL1:2;
    unsigned FLTEN1:1;
    unsigned FSEL2:5;
    unsigned MSEL2:2;
    unsigned FLTEN2:1;
    unsigned FSEL3:5;
    unsigned MSEL3:2;
    unsigned FLTEN3:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON0bits_t;*/
volatile __C1FLTCON0bits_t C1FLTCON0bits __asm__ ("C1FLTCON0") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON0SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON0INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL4:5;
    unsigned MSEL4:2;
    unsigned FLTEN4:1;
    unsigned FSEL5:5;
    unsigned MSEL5:2;
    unsigned FLTEN5:1;
    unsigned FSEL6:5;
    unsigned MSEL6:2;
    unsigned FLTEN6:1;
    unsigned FSEL7:5;
    unsigned MSEL7:2;
    unsigned FLTEN7:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON1bits_t;*/
volatile __C1FLTCON1bits_t C1FLTCON1bits __asm__ ("C1FLTCON1") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON1SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON1INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL8:5;
    unsigned MSEL8:2;
    unsigned FLTEN8:1;
    unsigned FSEL9:5;
    unsigned MSEL9:2;
    unsigned FLTEN9:1;
    unsigned FSEL10:5;
    unsigned MSEL10:2;
    unsigned FLTEN10:1;
    unsigned FSEL11:5;
    unsigned MSEL11:2;
    unsigned FLTEN11:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON2bits_t;*/
volatile __C1FLTCON2bits_t C1FLTCON2bits __asm__ ("C1FLTCON2") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON2SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON2INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL12:5;
    unsigned MSEL12:2;
    unsigned FLTEN12:1;
    unsigned FSEL13:5;
    unsigned MSEL13:2;
    unsigned FLTEN13:1;
    unsigned FSEL14:5;
    unsigned MSEL14:2;
    unsigned FLTEN14:1;
    unsigned FSEL15:5;
    unsigned MSEL15:2;
    unsigned FLTEN15:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON3bits_t;*/
volatile __C1FLTCON3bits_t C1FLTCON3bits __asm__ ("C1FLTCON3") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON3SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON3INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL16:5;
    unsigned MSEL16:2;
    unsigned FLTEN16:1;
    unsigned FSEL17:5;
    unsigned MSEL17:2;
    unsigned FLTEN17:1;
    unsigned FSEL18:5;
    unsigned MSEL18:2;
    unsigned FLTEN18:1;
    unsigned FSEL19:5;
    unsigned MSEL19:2;
    unsigned FLTEN19:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON4bits_t;*/
volatile __C1FLTCON4bits_t C1FLTCON4bits __asm__ ("C1FLTCON4") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON4CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON4SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON4INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL20:5;
    unsigned MSEL20:2;
    unsigned FLTEN20:1;
    unsigned FSEL21:5;
    unsigned MSEL21:2;
    unsigned FLTEN21:1;
    unsigned FSEL22:5;
    unsigned MSEL22:2;
    unsigned FLTEN22:1;
    unsigned FSEL23:5;
    unsigned MSEL23:2;
    unsigned FLTEN23:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON5bits_t;*/
volatile __C1FLTCON5bits_t C1FLTCON5bits __asm__ ("C1FLTCON5") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON5CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON5SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON5INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL24:5;
    unsigned MSEL24:2;
    unsigned FLTEN24:1;
    unsigned FSEL25:5;
    unsigned MSEL25:2;
    unsigned FLTEN25:1;
    unsigned FSEL26:5;
    unsigned MSEL26:2;
    unsigned FLTEN26:1;
    unsigned FSEL27:5;
    unsigned MSEL27:2;
    unsigned FLTEN27:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON6bits_t;*/
volatile __C1FLTCON6bits_t C1FLTCON6bits __asm__ ("C1FLTCON6") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON6CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON6SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON6INV __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL28:5;
    unsigned MSEL28:2;
    unsigned FLTEN28:1;
    unsigned FSEL29:5;
    unsigned MSEL29:2;
    unsigned FLTEN29:1;
    unsigned FSEL30:5;
    unsigned MSEL30:2;
    unsigned FLTEN30:1;
    unsigned FSEL31:5;
    unsigned MSEL31:2;
    unsigned FLTEN31:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FLTCON7bits_t;*/
volatile __C1FLTCON7bits_t C1FLTCON7bits __asm__ ("C1FLTCON7") __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON7CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON7SET __attribute__((section("sfrs")));
volatile unsigned int        C1FLTCON7INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF0bits_t;*/
volatile __C1RXF0bits_t C1RXF0bits __asm__ ("C1RXF0") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF0SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF0INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF1bits_t;*/
volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF1SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF1INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF2bits_t;*/
volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF2SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF2INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF3bits_t;*/
volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF3SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF3INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF4bits_t;*/
volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF4CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF4SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF4INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF5bits_t;*/
volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF5CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF5SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF5INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF6bits_t;*/
volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF6CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF6SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF6INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF7bits_t;*/
volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF7CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF7SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF7INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF8bits_t;*/
volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF8CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF8SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF8INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF9 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF9bits_t;*/
volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF9CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF9SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF9INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF10 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF10bits_t;*/
volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF10CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF10SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF10INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF11 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF11bits_t;*/
volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF11CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF11SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF11INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF12bits_t;*/
volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF12CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF12SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF12INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF13bits_t;*/
volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF13CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF13SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF13INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF14bits_t;*/
volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF14CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF14SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF14INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF15bits_t;*/
volatile __C1RXF15bits_t C1RXF15bits __asm__ ("C1RXF15") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF15CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF15SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF15INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF16bits_t;*/
volatile __C1RXF16bits_t C1RXF16bits __asm__ ("C1RXF16") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF16CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF16SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF16INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF17bits_t;*/
volatile __C1RXF17bits_t C1RXF17bits __asm__ ("C1RXF17") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF17CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF17SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF17INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF18bits_t;*/
volatile __C1RXF18bits_t C1RXF18bits __asm__ ("C1RXF18") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF18CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF18SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF18INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF19bits_t;*/
volatile __C1RXF19bits_t C1RXF19bits __asm__ ("C1RXF19") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF19CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF19SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF19INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF20bits_t;*/
