HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1RXF20bits_t C1RXF20bits __asm__ ("C1RXF20") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF20CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF20SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF20INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF21bits_t;*/
volatile __C1RXF21bits_t C1RXF21bits __asm__ ("C1RXF21") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF21CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF21SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF21INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF22 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF22bits_t;*/
volatile __C1RXF22bits_t C1RXF22bits __asm__ ("C1RXF22") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF22CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF22SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF22INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF23 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF23bits_t;*/
volatile __C1RXF23bits_t C1RXF23bits __asm__ ("C1RXF23") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF23CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF23SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF23INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF24 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF24bits_t;*/
volatile __C1RXF24bits_t C1RXF24bits __asm__ ("C1RXF24") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF24CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF24SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF24INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF25 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF25bits_t;*/
volatile __C1RXF25bits_t C1RXF25bits __asm__ ("C1RXF25") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF25CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF25SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF25INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF26 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF26bits_t;*/
volatile __C1RXF26bits_t C1RXF26bits __asm__ ("C1RXF26") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF26CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF26SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF26INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF27 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF27bits_t;*/
volatile __C1RXF27bits_t C1RXF27bits __asm__ ("C1RXF27") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF27CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF27SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF27INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF28 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF28bits_t;*/
volatile __C1RXF28bits_t C1RXF28bits __asm__ ("C1RXF28") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF28CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF28SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF28INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF29 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF29bits_t;*/
volatile __C1RXF29bits_t C1RXF29bits __asm__ ("C1RXF29") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF29CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF29SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF29INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF30 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF30bits_t;*/
volatile __C1RXF30bits_t C1RXF30bits __asm__ ("C1RXF30") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF30CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF30SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF30INV __attribute__((section("sfrs")));
volatile unsigned int        C1RXF31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C1RXF31bits_t;*/
volatile __C1RXF31bits_t C1RXF31bits __asm__ ("C1RXF31") __attribute__((section("sfrs")));
volatile unsigned int        C1RXF31CLR __attribute__((section("sfrs")));
volatile unsigned int        C1RXF31SET __attribute__((section("sfrs")));
volatile unsigned int        C1RXF31INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOBA __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOBACLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOBASET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOBAINV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON0bits_t;*/
volatile __C1FIFOCON0bits_t C1FIFOCON0bits __asm__ ("C1FIFOCON0") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON0SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON0INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT0bits_t;*/
