HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1FIFOINT0bits_t C1FIFOINT0bits __asm__ ("C1FIFOINT0") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT0SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT0INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA0 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA0SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA0INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI0bits_t;*/
volatile __C1FIFOCI0bits_t C1FIFOCI0bits __asm__ ("C1FIFOCI0") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI0CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI0SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI0INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON1bits_t;*/
volatile __C1FIFOCON1bits_t C1FIFOCON1bits __asm__ ("C1FIFOCON1") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON1SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON1INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT1bits_t;*/
volatile __C1FIFOINT1bits_t C1FIFOINT1bits __asm__ ("C1FIFOINT1") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT1SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT1INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA1 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA1SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA1INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI1bits_t;*/
volatile __C1FIFOCI1bits_t C1FIFOCI1bits __asm__ ("C1FIFOCI1") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI1CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI1SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI1INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON2bits_t;*/
volatile __C1FIFOCON2bits_t C1FIFOCON2bits __asm__ ("C1FIFOCON2") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON2SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON2INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT2bits_t;*/
volatile __C1FIFOINT2bits_t C1FIFOINT2bits __asm__ ("C1FIFOINT2") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT2SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT2INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA2 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA2SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA2INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI2bits_t;*/
volatile __C1FIFOCI2bits_t C1FIFOCI2bits __asm__ ("C1FIFOCI2") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI2CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI2SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI2INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON3bits_t;*/
volatile __C1FIFOCON3bits_t C1FIFOCON3bits __asm__ ("C1FIFOCON3") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON3SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON3INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT3bits_t;*/
volatile __C1FIFOINT3bits_t C1FIFOINT3bits __asm__ ("C1FIFOINT3") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT3SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT3INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA3 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA3SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA3INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI3bits_t;*/
