HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1FIFOCI3bits_t C1FIFOCI3bits __asm__ ("C1FIFOCI3") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI3CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI3SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI3INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON4bits_t;*/
volatile __C1FIFOCON4bits_t C1FIFOCON4bits __asm__ ("C1FIFOCON4") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON4CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON4SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON4INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT4bits_t;*/
volatile __C1FIFOINT4bits_t C1FIFOINT4bits __asm__ ("C1FIFOINT4") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT4CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT4SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT4INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA4 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA4CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA4SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA4INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI4bits_t;*/
volatile __C1FIFOCI4bits_t C1FIFOCI4bits __asm__ ("C1FIFOCI4") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI4CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI4SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI4INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON5bits_t;*/
volatile __C1FIFOCON5bits_t C1FIFOCON5bits __asm__ ("C1FIFOCON5") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON5CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON5SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON5INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT5bits_t;*/
volatile __C1FIFOINT5bits_t C1FIFOINT5bits __asm__ ("C1FIFOINT5") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT5CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT5SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT5INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA5 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA5CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA5SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA5INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI5bits_t;*/
volatile __C1FIFOCI5bits_t C1FIFOCI5bits __asm__ ("C1FIFOCI5") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI5CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI5SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI5INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON6bits_t;*/
volatile __C1FIFOCON6bits_t C1FIFOCON6bits __asm__ ("C1FIFOCON6") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON6CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON6SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON6INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT6bits_t;*/
volatile __C1FIFOINT6bits_t C1FIFOINT6bits __asm__ ("C1FIFOINT6") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT6CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT6SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT6INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA6 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA6CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA6SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA6INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI6bits_t;*/
volatile __C1FIFOCI6bits_t C1FIFOCI6bits __asm__ ("C1FIFOCI6") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI6CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI6SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI6INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON7bits_t;*/
