HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1FIFOCON7bits_t C1FIFOCON7bits __asm__ ("C1FIFOCON7") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON7CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON7SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON7INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT7bits_t;*/
volatile __C1FIFOINT7bits_t C1FIFOINT7bits __asm__ ("C1FIFOINT7") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT7CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT7SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT7INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA7 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA7CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA7SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA7INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI7bits_t;*/
volatile __C1FIFOCI7bits_t C1FIFOCI7bits __asm__ ("C1FIFOCI7") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI7CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI7SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI7INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON8bits_t;*/
volatile __C1FIFOCON8bits_t C1FIFOCON8bits __asm__ ("C1FIFOCON8") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON8CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON8SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON8INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT8bits_t;*/
volatile __C1FIFOINT8bits_t C1FIFOINT8bits __asm__ ("C1FIFOINT8") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT8CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT8SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT8INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA8 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA8CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA8SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA8INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI8bits_t;*/
volatile __C1FIFOCI8bits_t C1FIFOCI8bits __asm__ ("C1FIFOCI8") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI8CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI8SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI8INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON9 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON9bits_t;*/
volatile __C1FIFOCON9bits_t C1FIFOCON9bits __asm__ ("C1FIFOCON9") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON9CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON9SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON9INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT9 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT9bits_t;*/
volatile __C1FIFOINT9bits_t C1FIFOINT9bits __asm__ ("C1FIFOINT9") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT9CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT9SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT9INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA9 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA9CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA9SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA9INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI9 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI9bits_t;*/
volatile __C1FIFOCI9bits_t C1FIFOCI9bits __asm__ ("C1FIFOCI9") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI9CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI9SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI9INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON10 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON10bits_t;*/
volatile __C1FIFOCON10bits_t C1FIFOCON10bits __asm__ ("C1FIFOCON10") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON10CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON10SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON10INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT10 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT10bits_t;*/
volatile __C1FIFOINT10bits_t C1FIFOINT10bits __asm__ ("C1FIFOINT10") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT10CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT10SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT10INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA10 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA10CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA10SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA10INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI10 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI10bits_t;*/
volatile __C1FIFOCI10bits_t C1FIFOCI10bits __asm__ ("C1FIFOCI10") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI10CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI10SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI10INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON11 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON11bits_t;*/
volatile __C1FIFOCON11bits_t C1FIFOCON11bits __asm__ ("C1FIFOCON11") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON11CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON11SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON11INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT11 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT11bits_t;*/
volatile __C1FIFOINT11bits_t C1FIFOINT11bits __asm__ ("C1FIFOINT11") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT11CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT11SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT11INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA11 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA11CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA11SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA11INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI11 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI11bits_t;*/
volatile __C1FIFOCI11bits_t C1FIFOCI11bits __asm__ ("C1FIFOCI11") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI11CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI11SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI11INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON12bits_t;*/
volatile __C1FIFOCON12bits_t C1FIFOCON12bits __asm__ ("C1FIFOCON12") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON12CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON12SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON12INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT12bits_t;*/
volatile __C1FIFOINT12bits_t C1FIFOINT12bits __asm__ ("C1FIFOINT12") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT12CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT12SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT12INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA12 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA12CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA12SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA12INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI12bits_t;*/
volatile __C1FIFOCI12bits_t C1FIFOCI12bits __asm__ ("C1FIFOCI12") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI12CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI12SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI12INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON13bits_t;*/
volatile __C1FIFOCON13bits_t C1FIFOCON13bits __asm__ ("C1FIFOCON13") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON13CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON13SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON13INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT13bits_t;*/
volatile __C1FIFOINT13bits_t C1FIFOINT13bits __asm__ ("C1FIFOINT13") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT13CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT13SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT13INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA13 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA13CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA13SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA13INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI13bits_t;*/
volatile __C1FIFOCI13bits_t C1FIFOCI13bits __asm__ ("C1FIFOCI13") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI13CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI13SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI13INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON14bits_t;*/
volatile __C1FIFOCON14bits_t C1FIFOCON14bits __asm__ ("C1FIFOCON14") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON14CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON14SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON14INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT14bits_t;*/
volatile __C1FIFOINT14bits_t C1FIFOINT14bits __asm__ ("C1FIFOINT14") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT14CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT14SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT14INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA14 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA14CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA14SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA14INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI14bits_t;*/
volatile __C1FIFOCI14bits_t C1FIFOCI14bits __asm__ ("C1FIFOCI14") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI14CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI14SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI14INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON15bits_t;*/
volatile __C1FIFOCON15bits_t C1FIFOCON15bits __asm__ ("C1FIFOCON15") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON15CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON15SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON15INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT15bits_t;*/
volatile __C1FIFOINT15bits_t C1FIFOINT15bits __asm__ ("C1FIFOINT15") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT15CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT15SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT15INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA15 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA15CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA15SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA15INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI15bits_t;*/
