HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1FIFOCI15bits_t C1FIFOCI15bits __asm__ ("C1FIFOCI15") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI15CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI15SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI15INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON16bits_t;*/
volatile __C1FIFOCON16bits_t C1FIFOCON16bits __asm__ ("C1FIFOCON16") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON16CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON16SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON16INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT16bits_t;*/
volatile __C1FIFOINT16bits_t C1FIFOINT16bits __asm__ ("C1FIFOINT16") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT16CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT16SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT16INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA16 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA16CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA16SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA16INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI16bits_t;*/
volatile __C1FIFOCI16bits_t C1FIFOCI16bits __asm__ ("C1FIFOCI16") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI16CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI16SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI16INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON17bits_t;*/
volatile __C1FIFOCON17bits_t C1FIFOCON17bits __asm__ ("C1FIFOCON17") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON17CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON17SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON17INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT17bits_t;*/
volatile __C1FIFOINT17bits_t C1FIFOINT17bits __asm__ ("C1FIFOINT17") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT17CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT17SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT17INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA17 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA17CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA17SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA17INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI17bits_t;*/
volatile __C1FIFOCI17bits_t C1FIFOCI17bits __asm__ ("C1FIFOCI17") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI17CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI17SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI17INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON18bits_t;*/
volatile __C1FIFOCON18bits_t C1FIFOCON18bits __asm__ ("C1FIFOCON18") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON18CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON18SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON18INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT18bits_t;*/
volatile __C1FIFOINT18bits_t C1FIFOINT18bits __asm__ ("C1FIFOINT18") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT18CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT18SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT18INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA18 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA18CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA18SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA18INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI18bits_t;*/
volatile __C1FIFOCI18bits_t C1FIFOCI18bits __asm__ ("C1FIFOCI18") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI18CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI18SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI18INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON19bits_t;*/
volatile __C1FIFOCON19bits_t C1FIFOCON19bits __asm__ ("C1FIFOCON19") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON19CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON19SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON19INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT19bits_t;*/
volatile __C1FIFOINT19bits_t C1FIFOINT19bits __asm__ ("C1FIFOINT19") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT19CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT19SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT19INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA19 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA19CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA19SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA19INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI19bits_t;*/
volatile __C1FIFOCI19bits_t C1FIFOCI19bits __asm__ ("C1FIFOCI19") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI19CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI19SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI19INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON20bits_t;*/
volatile __C1FIFOCON20bits_t C1FIFOCON20bits __asm__ ("C1FIFOCON20") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON20CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON20SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON20INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT20bits_t;*/
volatile __C1FIFOINT20bits_t C1FIFOINT20bits __asm__ ("C1FIFOINT20") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT20CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT20SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT20INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA20 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA20CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA20SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA20INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI20bits_t;*/
volatile __C1FIFOCI20bits_t C1FIFOCI20bits __asm__ ("C1FIFOCI20") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI20CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI20SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI20INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON21bits_t;*/
volatile __C1FIFOCON21bits_t C1FIFOCON21bits __asm__ ("C1FIFOCON21") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON21CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON21SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON21INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT21bits_t;*/
volatile __C1FIFOINT21bits_t C1FIFOINT21bits __asm__ ("C1FIFOINT21") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT21CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT21SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT21INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA21 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA21CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA21SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA21INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI21bits_t;*/
volatile __C1FIFOCI21bits_t C1FIFOCI21bits __asm__ ("C1FIFOCI21") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI21CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI21SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI21INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON22 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON22bits_t;*/
