HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C1FIFOCI30bits_t C1FIFOCI30bits __asm__ ("C1FIFOCI30") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI30CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI30SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI30INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCON31bits_t;*/
volatile __C1FIFOCON31bits_t C1FIFOCON31bits __asm__ ("C1FIFOCON31") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON31CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON31SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCON31INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOINT31bits_t;*/
volatile __C1FIFOINT31bits_t C1FIFOINT31bits __asm__ ("C1FIFOINT31") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT31CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT31SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOINT31INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA31 __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA31CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA31SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOUA31INV __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C1FIFOCI31bits_t;*/
volatile __C1FIFOCI31bits_t C1FIFOCI31bits __asm__ ("C1FIFOCI31") __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI31CLR __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI31SET __attribute__((section("sfrs")));
volatile unsigned int        C1FIFOCI31INV __attribute__((section("sfrs")));
volatile unsigned int        C2CON __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DNCNT:5;
    unsigned :6;
    unsigned CANBUSY:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned :4;
    unsigned CANCAP:1;
    unsigned OPMOD:3;
    unsigned REQOP:3;
    unsigned ABAT:1;
  };
  struct {
    unsigned w:32;
  };
} __C2CONbits_t;*/
volatile __C2CONbits_t C2CONbits __asm__ ("C2CON") __attribute__((section("sfrs")));
volatile unsigned int        C2CONCLR __attribute__((section("sfrs")));
volatile unsigned int        C2CONSET __attribute__((section("sfrs")));
volatile unsigned int        C2CONINV __attribute__((section("sfrs")));
volatile unsigned int        C2CFG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned BRP:6;
    unsigned SJW:2;
    unsigned PRSEG:3;
    unsigned SEG1PH:3;
    unsigned SAM:1;
    unsigned SEG2PHTS:1;
    unsigned SEG2PH:3;
    unsigned :3;
    unsigned WAKFIL:1;
  };
  struct {
    unsigned w:32;
  };
} __C2CFGbits_t;*/
volatile __C2CFGbits_t C2CFGbits __asm__ ("C2CFG") __attribute__((section("sfrs")));
volatile unsigned int        C2CFGCLR __attribute__((section("sfrs")));
volatile unsigned int        C2CFGSET __attribute__((section("sfrs")));
volatile unsigned int        C2CFGINV __attribute__((section("sfrs")));
volatile unsigned int        C2INT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBIF:1;
    unsigned RBIF:1;
    unsigned CTMRIF:1;
    unsigned MODIF:1;
    unsigned :7;
    unsigned RBOVIF:1;
    unsigned SERRIF:1;
    unsigned CERRIF:1;
    unsigned WAKIF:1;
    unsigned IVRIF:1;
    unsigned TBIE:1;
    unsigned RBIE:1;
    unsigned CTMRIE:1;
    unsigned MODIE:1;
    unsigned :7;
    unsigned RBOVIE:1;
    unsigned SERRIE:1;
    unsigned CERRIE:1;
    unsigned WAKIE:1;
    unsigned IVRIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2INTbits_t;*/
volatile __C2INTbits_t C2INTbits __asm__ ("C2INT") __attribute__((section("sfrs")));
volatile unsigned int        C2INTCLR __attribute__((section("sfrs")));
volatile unsigned int        C2INTSET __attribute__((section("sfrs")));
volatile unsigned int        C2INTINV __attribute__((section("sfrs")));
volatile unsigned int        C2VEC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICODE:7;
    unsigned :1;
    unsigned FILHIT:5;
  };
  struct {
    unsigned w:32;
  };
} __C2VECbits_t;*/
volatile __C2VECbits_t C2VECbits __asm__ ("C2VEC") __attribute__((section("sfrs")));
volatile unsigned int        C2VECCLR __attribute__((section("sfrs")));
volatile unsigned int        C2VECSET __attribute__((section("sfrs")));
volatile unsigned int        C2VECINV __attribute__((section("sfrs")));
volatile unsigned int        C2TREC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RERRCNT:8;
    unsigned TERRCNT:8;
    unsigned EWARN:1;
    unsigned RXWARN:1;
    unsigned TXWARN:1;
    unsigned RXBP:1;
    unsigned TXBP:1;
    unsigned TXBO:1;
  };
  struct {
    unsigned w:32;
  };
} __C2TRECbits_t;*/
volatile __C2TRECbits_t C2TRECbits __asm__ ("C2TREC") __attribute__((section("sfrs")));
volatile unsigned int        C2TRECCLR __attribute__((section("sfrs")));
volatile unsigned int        C2TRECSET __attribute__((section("sfrs")));
volatile unsigned int        C2TRECINV __attribute__((section("sfrs")));
volatile unsigned int        C2FSTAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FIFOIP:32;
  };
  struct {
    unsigned FIFOIP0:1;
    unsigned FIFOIP1:1;
    unsigned FIFOIP2:1;
    unsigned FIFOIP3:1;
    unsigned FIFOIP4:1;
    unsigned FIFOIP5:1;
    unsigned FIFOIP6:1;
    unsigned FIFOIP7:1;
    unsigned FIFOIP8:1;
    unsigned FIFOIP9:1;
    unsigned FIFOIP10:1;
    unsigned FIFOIP11:1;
    unsigned FIFOIP12:1;
    unsigned FIFOIP13:1;
    unsigned FIFOIP14:1;
    unsigned FIFOIP15:1;
    unsigned FIFOIP16:1;
    unsigned FIFOIP17:1;
    unsigned FIFOIP18:1;
    unsigned FIFOIP19:1;
    unsigned FIFOIP20:1;
    unsigned FIFOIP21:1;
    unsigned FIFOIP22:1;
    unsigned FIFOIP23:1;
    unsigned FIFOIP24:1;
    unsigned FIFOIP25:1;
    unsigned FIFOIP26:1;
    unsigned FIFOIP27:1;
    unsigned FIFOIP28:1;
    unsigned FIFOIP29:1;
    unsigned FIFOIP30:1;
    unsigned FIFOIP31:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FSTATbits_t;*/
volatile __C2FSTATbits_t C2FSTATbits __asm__ ("C2FSTAT") __attribute__((section("sfrs")));
volatile unsigned int        C2FSTATCLR __attribute__((section("sfrs")));
volatile unsigned int        C2FSTATSET __attribute__((section("sfrs")));
volatile unsigned int        C2FSTATINV __attribute__((section("sfrs")));
volatile unsigned int        C2RXOVF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXOVF:32;
  };
  struct {
    unsigned RXOVF0:1;
    unsigned RXOVF1:1;
    unsigned RXOVF2:1;
    unsigned RXOVF3:1;
    unsigned RXOVF4:1;
    unsigned RXOVF5:1;
    unsigned RXOVF6:1;
    unsigned RXOVF7:1;
    unsigned RXOVF8:1;
    unsigned RXOVF9:1;
    unsigned RXOVF10:1;
    unsigned RXOVF11:1;
    unsigned RXOVF12:1;
    unsigned RXOVF13:1;
    unsigned RXOVF14:1;
    unsigned RXOVF15:1;
    unsigned RXOVF16:1;
    unsigned RXOVF17:1;
    unsigned RXOVF18:1;
    unsigned RXOVF19:1;
    unsigned RXOVF20:1;
    unsigned RXOVF21:1;
    unsigned RXOVF22:1;
    unsigned RXOVF23:1;
    unsigned RXOVF24:1;
    unsigned RXOVF25:1;
    unsigned RXOVF26:1;
    unsigned RXOVF27:1;
    unsigned RXOVF28:1;
    unsigned RXOVF29:1;
    unsigned RXOVF30:1;
    unsigned RXOVF31:1;
  };
  struct {
    unsigned w:32;
  };
} __C2RXOVFbits_t;*/
volatile __C2RXOVFbits_t C2RXOVFbits __asm__ ("C2RXOVF") __attribute__((section("sfrs")));
volatile unsigned int        C2RXOVFCLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXOVFSET __attribute__((section("sfrs")));
volatile unsigned int        C2RXOVFINV __attribute__((section("sfrs")));
volatile unsigned int        C2TMR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CANTSPRE:16;
    unsigned CANTS:16;
  };
  struct {
    unsigned w:32;
  };
} __C2TMRbits_t;*/
volatile __C2TMRbits_t C2TMRbits __asm__ ("C2TMR") __attribute__((section("sfrs")));
volatile unsigned int        C2TMRCLR __attribute__((section("sfrs")));
volatile unsigned int        C2TMRSET __attribute__((section("sfrs")));
volatile unsigned int        C2TMRINV __attribute__((section("sfrs")));
volatile unsigned int        C2RXM0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXM0bits_t;*/
volatile __C2RXM0bits_t C2RXM0bits __asm__ ("C2RXM0") __attribute__((section("sfrs")));
volatile unsigned int        C2RXM0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXM0SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXM0INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXM1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXM1bits_t;*/
volatile __C2RXM1bits_t C2RXM1bits __asm__ ("C2RXM1") __attribute__((section("sfrs")));
volatile unsigned int        C2RXM1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXM1SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXM1INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXM2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXM2bits_t;*/
volatile __C2RXM2bits_t C2RXM2bits __asm__ ("C2RXM2") __attribute__((section("sfrs")));
volatile unsigned int        C2RXM2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXM2SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXM2INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXM3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned MIDE:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXM3bits_t;*/
volatile __C2RXM3bits_t C2RXM3bits __asm__ ("C2RXM3") __attribute__((section("sfrs")));
volatile unsigned int        C2RXM3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXM3SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXM3INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL0:5;
    unsigned MSEL0:2;
    unsigned FLTEN0:1;
    unsigned FSEL1:5;
    unsigned MSEL1:2;
    unsigned FLTEN1:1;
    unsigned FSEL2:5;
    unsigned MSEL2:2;
    unsigned FLTEN2:1;
    unsigned FSEL3:5;
    unsigned MSEL3:2;
    unsigned FLTEN3:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON0bits_t;*/
volatile __C2FLTCON0bits_t C2FLTCON0bits __asm__ ("C2FLTCON0") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON0SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON0INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL4:5;
    unsigned MSEL4:2;
    unsigned FLTEN4:1;
    unsigned FSEL5:5;
    unsigned MSEL5:2;
    unsigned FLTEN5:1;
    unsigned FSEL6:5;
    unsigned MSEL6:2;
    unsigned FLTEN6:1;
    unsigned FSEL7:5;
    unsigned MSEL7:2;
    unsigned FLTEN7:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON1bits_t;*/
