HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FLTCON1bits_t C2FLTCON1bits __asm__ ("C2FLTCON1") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON1SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON1INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL8:5;
    unsigned MSEL8:2;
    unsigned FLTEN8:1;
    unsigned FSEL9:5;
    unsigned MSEL9:2;
    unsigned FLTEN9:1;
    unsigned FSEL10:5;
    unsigned MSEL10:2;
    unsigned FLTEN10:1;
    unsigned FSEL11:5;
    unsigned MSEL11:2;
    unsigned FLTEN11:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON2bits_t;*/
volatile __C2FLTCON2bits_t C2FLTCON2bits __asm__ ("C2FLTCON2") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON2SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON2INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL12:5;
    unsigned MSEL12:2;
    unsigned FLTEN12:1;
    unsigned FSEL13:5;
    unsigned MSEL13:2;
    unsigned FLTEN13:1;
    unsigned FSEL14:5;
    unsigned MSEL14:2;
    unsigned FLTEN14:1;
    unsigned FSEL15:5;
    unsigned MSEL15:2;
    unsigned FLTEN15:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON3bits_t;*/
volatile __C2FLTCON3bits_t C2FLTCON3bits __asm__ ("C2FLTCON3") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON3SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON3INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL16:5;
    unsigned MSEL16:2;
    unsigned FLTEN16:1;
    unsigned FSEL17:5;
    unsigned MSEL17:2;
    unsigned FLTEN17:1;
    unsigned FSEL18:5;
    unsigned MSEL18:2;
    unsigned FLTEN18:1;
    unsigned FSEL19:5;
    unsigned MSEL19:2;
    unsigned FLTEN19:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON4bits_t;*/
volatile __C2FLTCON4bits_t C2FLTCON4bits __asm__ ("C2FLTCON4") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON4CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON4SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON4INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL20:5;
    unsigned MSEL20:2;
    unsigned FLTEN20:1;
    unsigned FSEL21:5;
    unsigned MSEL21:2;
    unsigned FLTEN21:1;
    unsigned FSEL22:5;
    unsigned MSEL22:2;
    unsigned FLTEN22:1;
    unsigned FSEL23:5;
    unsigned MSEL23:2;
    unsigned FLTEN23:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON5bits_t;*/
volatile __C2FLTCON5bits_t C2FLTCON5bits __asm__ ("C2FLTCON5") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON5CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON5SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON5INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL24:5;
    unsigned MSEL24:2;
    unsigned FLTEN24:1;
    unsigned FSEL25:5;
    unsigned MSEL25:2;
    unsigned FLTEN25:1;
    unsigned FSEL26:5;
    unsigned MSEL26:2;
    unsigned FLTEN26:1;
    unsigned FSEL27:5;
    unsigned MSEL27:2;
    unsigned FLTEN27:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON6bits_t;*/
volatile __C2FLTCON6bits_t C2FLTCON6bits __asm__ ("C2FLTCON6") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON6CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON6SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON6INV __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FSEL28:5;
    unsigned MSEL28:2;
    unsigned FLTEN28:1;
    unsigned FSEL29:5;
    unsigned MSEL29:2;
    unsigned FLTEN29:1;
    unsigned FSEL30:5;
    unsigned MSEL30:2;
    unsigned FLTEN30:1;
    unsigned FSEL31:5;
    unsigned MSEL31:2;
    unsigned FLTEN31:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FLTCON7bits_t;*/
volatile __C2FLTCON7bits_t C2FLTCON7bits __asm__ ("C2FLTCON7") __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON7CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON7SET __attribute__((section("sfrs")));
volatile unsigned int        C2FLTCON7INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF0bits_t;*/
volatile __C2RXF0bits_t C2RXF0bits __asm__ ("C2RXF0") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF0SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF0INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF1bits_t;*/
volatile __C2RXF1bits_t C2RXF1bits __asm__ ("C2RXF1") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF1SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF1INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF2bits_t;*/
