HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2RXF2bits_t C2RXF2bits __asm__ ("C2RXF2") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF2SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF2INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF3bits_t;*/
volatile __C2RXF3bits_t C2RXF3bits __asm__ ("C2RXF3") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF3SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF3INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF4bits_t;*/
volatile __C2RXF4bits_t C2RXF4bits __asm__ ("C2RXF4") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF4CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF4SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF4INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF5bits_t;*/
volatile __C2RXF5bits_t C2RXF5bits __asm__ ("C2RXF5") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF5CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF5SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF5INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF6bits_t;*/
volatile __C2RXF6bits_t C2RXF6bits __asm__ ("C2RXF6") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF6CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF6SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF6INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF7bits_t;*/
volatile __C2RXF7bits_t C2RXF7bits __asm__ ("C2RXF7") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF7CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF7SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF7INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF8bits_t;*/
volatile __C2RXF8bits_t C2RXF8bits __asm__ ("C2RXF8") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF8CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF8SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF8INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF9 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF9bits_t;*/
volatile __C2RXF9bits_t C2RXF9bits __asm__ ("C2RXF9") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF9CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF9SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF9INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF10 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF10bits_t;*/
volatile __C2RXF10bits_t C2RXF10bits __asm__ ("C2RXF10") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF10CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF10SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF10INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF11 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF11bits_t;*/
volatile __C2RXF11bits_t C2RXF11bits __asm__ ("C2RXF11") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF11CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF11SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF11INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF12bits_t;*/
volatile __C2RXF12bits_t C2RXF12bits __asm__ ("C2RXF12") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF12CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF12SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF12INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF13bits_t;*/
