HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2RXF13bits_t C2RXF13bits __asm__ ("C2RXF13") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF13CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF13SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF13INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF14bits_t;*/
volatile __C2RXF14bits_t C2RXF14bits __asm__ ("C2RXF14") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF14CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF14SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF14INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF15bits_t;*/
volatile __C2RXF15bits_t C2RXF15bits __asm__ ("C2RXF15") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF15CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF15SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF15INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF16bits_t;*/
volatile __C2RXF16bits_t C2RXF16bits __asm__ ("C2RXF16") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF16CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF16SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF16INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF17bits_t;*/
volatile __C2RXF17bits_t C2RXF17bits __asm__ ("C2RXF17") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF17CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF17SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF17INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF18bits_t;*/
volatile __C2RXF18bits_t C2RXF18bits __asm__ ("C2RXF18") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF18CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF18SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF18INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF19bits_t;*/
volatile __C2RXF19bits_t C2RXF19bits __asm__ ("C2RXF19") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF19CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF19SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF19INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF20bits_t;*/
volatile __C2RXF20bits_t C2RXF20bits __asm__ ("C2RXF20") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF20CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF20SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF20INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF21bits_t;*/
volatile __C2RXF21bits_t C2RXF21bits __asm__ ("C2RXF21") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF21CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF21SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF21INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF22 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF22bits_t;*/
volatile __C2RXF22bits_t C2RXF22bits __asm__ ("C2RXF22") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF22CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF22SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF22INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF23 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF23bits_t;*/
volatile __C2RXF23bits_t C2RXF23bits __asm__ ("C2RXF23") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF23CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF23SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF23INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF24 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF24bits_t;*/
volatile __C2RXF24bits_t C2RXF24bits __asm__ ("C2RXF24") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF24CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF24SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF24INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF25 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF25bits_t;*/
volatile __C2RXF25bits_t C2RXF25bits __asm__ ("C2RXF25") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF25CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF25SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF25INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF26 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF26bits_t;*/
volatile __C2RXF26bits_t C2RXF26bits __asm__ ("C2RXF26") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF26CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF26SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF26INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF27 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF27bits_t;*/
volatile __C2RXF27bits_t C2RXF27bits __asm__ ("C2RXF27") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF27CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF27SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF27INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF28 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF28bits_t;*/
volatile __C2RXF28bits_t C2RXF28bits __asm__ ("C2RXF28") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF28CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF28SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF28INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF29 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF29bits_t;*/
volatile __C2RXF29bits_t C2RXF29bits __asm__ ("C2RXF29") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF29CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF29SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF29INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF30 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF30bits_t;*/
volatile __C2RXF30bits_t C2RXF30bits __asm__ ("C2RXF30") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF30CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF30SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF30INV __attribute__((section("sfrs")));
volatile unsigned int        C2RXF31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned EID:18;
    unsigned :1;
    unsigned EXID:1;
    unsigned :1;
    unsigned SID:11;
  };
  struct {
    unsigned w:32;
  };
} __C2RXF31bits_t;*/
volatile __C2RXF31bits_t C2RXF31bits __asm__ ("C2RXF31") __attribute__((section("sfrs")));
volatile unsigned int        C2RXF31CLR __attribute__((section("sfrs")));
volatile unsigned int        C2RXF31SET __attribute__((section("sfrs")));
volatile unsigned int        C2RXF31INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOBA __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOBACLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOBASET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOBAINV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON0bits_t;*/
volatile __C2FIFOCON0bits_t C2FIFOCON0bits __asm__ ("C2FIFOCON0") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON0SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON0INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT0bits_t;*/
volatile __C2FIFOINT0bits_t C2FIFOINT0bits __asm__ ("C2FIFOINT0") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT0SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT0INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA0 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA0SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA0INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI0bits_t;*/
volatile __C2FIFOCI0bits_t C2FIFOCI0bits __asm__ ("C2FIFOCI0") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI0CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI0SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI0INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON1bits_t;*/
