HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOCON1bits_t C2FIFOCON1bits __asm__ ("C2FIFOCON1") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON1SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON1INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT1bits_t;*/
volatile __C2FIFOINT1bits_t C2FIFOINT1bits __asm__ ("C2FIFOINT1") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT1SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT1INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA1 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA1SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA1INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI1bits_t;*/
volatile __C2FIFOCI1bits_t C2FIFOCI1bits __asm__ ("C2FIFOCI1") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI1CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI1SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI1INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON2bits_t;*/
volatile __C2FIFOCON2bits_t C2FIFOCON2bits __asm__ ("C2FIFOCON2") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON2SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON2INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT2bits_t;*/
volatile __C2FIFOINT2bits_t C2FIFOINT2bits __asm__ ("C2FIFOINT2") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT2SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT2INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA2 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA2SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA2INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI2bits_t;*/
volatile __C2FIFOCI2bits_t C2FIFOCI2bits __asm__ ("C2FIFOCI2") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI2CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI2SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI2INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON3bits_t;*/
volatile __C2FIFOCON3bits_t C2FIFOCON3bits __asm__ ("C2FIFOCON3") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON3SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON3INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT3bits_t;*/
volatile __C2FIFOINT3bits_t C2FIFOINT3bits __asm__ ("C2FIFOINT3") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT3SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT3INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA3 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA3SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA3INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI3bits_t;*/
volatile __C2FIFOCI3bits_t C2FIFOCI3bits __asm__ ("C2FIFOCI3") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI3CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI3SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI3INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON4bits_t;*/
volatile __C2FIFOCON4bits_t C2FIFOCON4bits __asm__ ("C2FIFOCON4") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON4CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON4SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON4INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT4bits_t;*/
