HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOINT4bits_t C2FIFOINT4bits __asm__ ("C2FIFOINT4") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT4CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT4SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT4INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA4 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA4CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA4SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA4INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI4bits_t;*/
volatile __C2FIFOCI4bits_t C2FIFOCI4bits __asm__ ("C2FIFOCI4") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI4CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI4SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI4INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON5bits_t;*/
volatile __C2FIFOCON5bits_t C2FIFOCON5bits __asm__ ("C2FIFOCON5") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON5CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON5SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON5INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT5bits_t;*/
volatile __C2FIFOINT5bits_t C2FIFOINT5bits __asm__ ("C2FIFOINT5") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT5CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT5SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT5INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA5 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA5CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA5SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA5INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI5bits_t;*/
volatile __C2FIFOCI5bits_t C2FIFOCI5bits __asm__ ("C2FIFOCI5") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI5CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI5SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI5INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON6bits_t;*/
volatile __C2FIFOCON6bits_t C2FIFOCON6bits __asm__ ("C2FIFOCON6") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON6CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON6SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON6INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT6bits_t;*/
volatile __C2FIFOINT6bits_t C2FIFOINT6bits __asm__ ("C2FIFOINT6") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT6CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT6SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT6INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA6 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA6CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA6SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA6INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI6 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI6bits_t;*/
volatile __C2FIFOCI6bits_t C2FIFOCI6bits __asm__ ("C2FIFOCI6") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI6CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI6SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI6INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON7bits_t;*/
volatile __C2FIFOCON7bits_t C2FIFOCON7bits __asm__ ("C2FIFOCON7") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON7CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON7SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON7INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT7bits_t;*/
volatile __C2FIFOINT7bits_t C2FIFOINT7bits __asm__ ("C2FIFOINT7") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT7CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT7SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT7INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA7 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA7CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA7SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA7INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI7 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI7bits_t;*/
volatile __C2FIFOCI7bits_t C2FIFOCI7bits __asm__ ("C2FIFOCI7") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI7CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI7SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI7INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON8 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON8bits_t;*/
