HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOCI11bits_t C2FIFOCI11bits __asm__ ("C2FIFOCI11") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI11CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI11SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI11INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON12bits_t;*/
volatile __C2FIFOCON12bits_t C2FIFOCON12bits __asm__ ("C2FIFOCON12") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON12CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON12SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON12INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT12bits_t;*/
volatile __C2FIFOINT12bits_t C2FIFOINT12bits __asm__ ("C2FIFOINT12") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT12CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT12SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT12INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA12 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA12CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA12SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA12INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI12 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI12bits_t;*/
volatile __C2FIFOCI12bits_t C2FIFOCI12bits __asm__ ("C2FIFOCI12") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI12CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI12SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI12INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON13bits_t;*/
volatile __C2FIFOCON13bits_t C2FIFOCON13bits __asm__ ("C2FIFOCON13") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON13CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON13SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON13INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT13bits_t;*/
volatile __C2FIFOINT13bits_t C2FIFOINT13bits __asm__ ("C2FIFOINT13") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT13CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT13SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT13INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA13 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA13CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA13SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA13INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI13 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI13bits_t;*/
volatile __C2FIFOCI13bits_t C2FIFOCI13bits __asm__ ("C2FIFOCI13") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI13CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI13SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI13INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON14bits_t;*/
volatile __C2FIFOCON14bits_t C2FIFOCON14bits __asm__ ("C2FIFOCON14") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON14CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON14SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON14INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT14bits_t;*/
volatile __C2FIFOINT14bits_t C2FIFOINT14bits __asm__ ("C2FIFOINT14") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT14CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT14SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT14INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA14 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA14CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA14SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA14INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI14 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI14bits_t;*/
volatile __C2FIFOCI14bits_t C2FIFOCI14bits __asm__ ("C2FIFOCI14") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI14CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI14SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI14INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON15bits_t;*/
volatile __C2FIFOCON15bits_t C2FIFOCON15bits __asm__ ("C2FIFOCON15") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON15CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON15SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON15INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT15bits_t;*/
volatile __C2FIFOINT15bits_t C2FIFOINT15bits __asm__ ("C2FIFOINT15") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT15CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT15SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT15INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA15 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA15CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA15SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA15INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI15 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI15bits_t;*/
volatile __C2FIFOCI15bits_t C2FIFOCI15bits __asm__ ("C2FIFOCI15") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI15CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI15SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI15INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON16bits_t;*/
