HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOCON16bits_t C2FIFOCON16bits __asm__ ("C2FIFOCON16") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON16CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON16SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON16INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT16bits_t;*/
volatile __C2FIFOINT16bits_t C2FIFOINT16bits __asm__ ("C2FIFOINT16") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT16CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT16SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT16INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA16 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA16CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA16SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA16INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI16 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI16bits_t;*/
volatile __C2FIFOCI16bits_t C2FIFOCI16bits __asm__ ("C2FIFOCI16") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI16CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI16SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI16INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON17bits_t;*/
volatile __C2FIFOCON17bits_t C2FIFOCON17bits __asm__ ("C2FIFOCON17") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON17CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON17SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON17INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT17bits_t;*/
volatile __C2FIFOINT17bits_t C2FIFOINT17bits __asm__ ("C2FIFOINT17") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT17CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT17SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT17INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA17 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA17CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA17SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA17INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI17 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI17bits_t;*/
volatile __C2FIFOCI17bits_t C2FIFOCI17bits __asm__ ("C2FIFOCI17") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI17CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI17SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI17INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON18bits_t;*/
volatile __C2FIFOCON18bits_t C2FIFOCON18bits __asm__ ("C2FIFOCON18") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON18CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON18SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON18INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT18bits_t;*/
volatile __C2FIFOINT18bits_t C2FIFOINT18bits __asm__ ("C2FIFOINT18") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT18CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT18SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT18INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA18 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA18CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA18SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA18INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI18 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI18bits_t;*/
