HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOCI18bits_t C2FIFOCI18bits __asm__ ("C2FIFOCI18") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI18CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI18SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI18INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON19bits_t;*/
volatile __C2FIFOCON19bits_t C2FIFOCON19bits __asm__ ("C2FIFOCON19") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON19CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON19SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON19INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT19bits_t;*/
volatile __C2FIFOINT19bits_t C2FIFOINT19bits __asm__ ("C2FIFOINT19") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT19CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT19SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT19INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA19 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA19CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA19SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA19INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI19 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI19bits_t;*/
volatile __C2FIFOCI19bits_t C2FIFOCI19bits __asm__ ("C2FIFOCI19") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI19CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI19SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI19INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON20bits_t;*/
volatile __C2FIFOCON20bits_t C2FIFOCON20bits __asm__ ("C2FIFOCON20") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON20CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON20SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON20INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT20bits_t;*/
volatile __C2FIFOINT20bits_t C2FIFOINT20bits __asm__ ("C2FIFOINT20") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT20CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT20SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT20INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA20 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA20CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA20SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA20INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI20 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI20bits_t;*/
volatile __C2FIFOCI20bits_t C2FIFOCI20bits __asm__ ("C2FIFOCI20") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI20CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI20SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI20INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON21bits_t;*/
volatile __C2FIFOCON21bits_t C2FIFOCON21bits __asm__ ("C2FIFOCON21") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON21CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON21SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON21INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT21bits_t;*/
volatile __C2FIFOINT21bits_t C2FIFOINT21bits __asm__ ("C2FIFOINT21") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT21CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT21SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT21INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA21 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA21CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA21SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA21INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI21 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI21bits_t;*/
