HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOCI21bits_t C2FIFOCI21bits __asm__ ("C2FIFOCI21") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI21CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI21SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI21INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON22 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON22bits_t;*/
volatile __C2FIFOCON22bits_t C2FIFOCON22bits __asm__ ("C2FIFOCON22") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON22CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON22SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON22INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT22 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT22bits_t;*/
volatile __C2FIFOINT22bits_t C2FIFOINT22bits __asm__ ("C2FIFOINT22") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT22CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT22SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT22INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA22 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA22CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA22SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA22INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI22 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI22bits_t;*/
volatile __C2FIFOCI22bits_t C2FIFOCI22bits __asm__ ("C2FIFOCI22") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI22CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI22SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI22INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON23 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON23bits_t;*/
volatile __C2FIFOCON23bits_t C2FIFOCON23bits __asm__ ("C2FIFOCON23") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON23CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON23SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON23INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT23 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT23bits_t;*/
volatile __C2FIFOINT23bits_t C2FIFOINT23bits __asm__ ("C2FIFOINT23") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT23CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT23SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT23INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA23 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA23CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA23SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA23INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI23 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI23bits_t;*/
volatile __C2FIFOCI23bits_t C2FIFOCI23bits __asm__ ("C2FIFOCI23") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI23CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI23SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI23INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON24 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON24bits_t;*/
volatile __C2FIFOCON24bits_t C2FIFOCON24bits __asm__ ("C2FIFOCON24") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON24CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON24SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON24INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT24 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT24bits_t;*/
volatile __C2FIFOINT24bits_t C2FIFOINT24bits __asm__ ("C2FIFOINT24") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT24CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT24SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT24INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA24 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA24CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA24SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA24INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI24 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI24bits_t;*/
volatile __C2FIFOCI24bits_t C2FIFOCI24bits __asm__ ("C2FIFOCI24") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI24CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI24SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI24INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON25 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON25bits_t;*/
volatile __C2FIFOCON25bits_t C2FIFOCON25bits __asm__ ("C2FIFOCON25") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON25CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON25SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON25INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT25 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT25bits_t;*/
volatile __C2FIFOINT25bits_t C2FIFOINT25bits __asm__ ("C2FIFOINT25") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT25CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT25SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT25INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA25 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA25CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA25SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA25INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI25 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI25bits_t;*/
volatile __C2FIFOCI25bits_t C2FIFOCI25bits __asm__ ("C2FIFOCI25") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI25CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI25SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI25INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON26 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON26bits_t;*/
volatile __C2FIFOCON26bits_t C2FIFOCON26bits __asm__ ("C2FIFOCON26") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON26CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON26SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON26INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT26 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT26bits_t;*/
volatile __C2FIFOINT26bits_t C2FIFOINT26bits __asm__ ("C2FIFOINT26") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT26CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT26SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT26INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA26 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA26CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA26SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA26INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI26 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI26bits_t;*/
volatile __C2FIFOCI26bits_t C2FIFOCI26bits __asm__ ("C2FIFOCI26") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI26CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI26SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI26INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON27 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON27bits_t;*/
volatile __C2FIFOCON27bits_t C2FIFOCON27bits __asm__ ("C2FIFOCON27") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON27CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON27SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON27INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT27 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT27bits_t;*/
volatile __C2FIFOINT27bits_t C2FIFOINT27bits __asm__ ("C2FIFOINT27") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT27CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT27SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT27INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA27 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA27CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA27SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA27INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI27 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI27bits_t;*/
volatile __C2FIFOCI27bits_t C2FIFOCI27bits __asm__ ("C2FIFOCI27") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI27CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI27SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI27INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON28 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON28bits_t;*/
volatile __C2FIFOCON28bits_t C2FIFOCON28bits __asm__ ("C2FIFOCON28") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON28CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON28SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON28INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT28 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT28bits_t;*/
volatile __C2FIFOINT28bits_t C2FIFOINT28bits __asm__ ("C2FIFOINT28") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT28CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT28SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT28INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA28 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA28CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA28SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA28INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI28 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI28bits_t;*/
