HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __C2FIFOCI28bits_t C2FIFOCI28bits __asm__ ("C2FIFOCI28") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI28CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI28SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI28INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON29 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON29bits_t;*/
volatile __C2FIFOCON29bits_t C2FIFOCON29bits __asm__ ("C2FIFOCON29") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON29CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON29SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON29INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT29 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT29bits_t;*/
volatile __C2FIFOINT29bits_t C2FIFOINT29bits __asm__ ("C2FIFOINT29") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT29CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT29SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT29INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA29 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA29CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA29SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA29INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI29 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI29bits_t;*/
volatile __C2FIFOCI29bits_t C2FIFOCI29bits __asm__ ("C2FIFOCI29") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI29CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI29SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI29INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON30 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON30bits_t;*/
volatile __C2FIFOCON30bits_t C2FIFOCON30bits __asm__ ("C2FIFOCON30") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON30CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON30SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON30INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT30 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT30bits_t;*/
volatile __C2FIFOINT30bits_t C2FIFOINT30bits __asm__ ("C2FIFOINT30") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT30CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT30SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT30INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA30 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA30CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA30SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA30INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI30 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI30bits_t;*/
volatile __C2FIFOCI30bits_t C2FIFOCI30bits __asm__ ("C2FIFOCI30") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI30CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI30SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI30INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXPRI:2;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABAT:1;
    unsigned TXEN:1;
    unsigned :4;
    unsigned DONLY:1;
    unsigned UINC:1;
    unsigned FRESET:1;
    unsigned :1;
    unsigned FSIZE:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCON31bits_t;*/
volatile __C2FIFOCON31bits_t C2FIFOCON31bits __asm__ ("C2FIFOCON31") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON31CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON31SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCON31INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXNEMPTYIF:1;
    unsigned RXHALFIF:1;
    unsigned RXFULLIF:1;
    unsigned RXOVFLIF:1;
    unsigned :4;
    unsigned TXEMPTYIF:1;
    unsigned TXHALFIF:1;
    unsigned TXNFULLIF:1;
    unsigned :5;
    unsigned RXNEMPTYIE:1;
    unsigned RXHALFIE:1;
    unsigned RXFULLIE:1;
    unsigned RXOVFLIE:1;
    unsigned :4;
    unsigned TXEMPTYIE:1;
    unsigned TXHALFIE:1;
    unsigned TXNFULLIE:1;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOINT31bits_t;*/
volatile __C2FIFOINT31bits_t C2FIFOINT31bits __asm__ ("C2FIFOINT31") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT31CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT31SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOINT31INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA31 __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA31CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA31SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOUA31INV __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI31 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CFIFOCI:5;
  };
  struct {
    unsigned w:32;
  };
} __C2FIFOCI31bits_t;*/
volatile __C2FIFOCI31bits_t C2FIFOCI31bits __asm__ ("C2FIFOCI31") __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI31CLR __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI31SET __attribute__((section("sfrs")));
volatile unsigned int        C2FIFOCI31INV __attribute__((section("sfrs")));
volatile unsigned int        ETHCON1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned BUFCDEC:1;
    unsigned :3;
    unsigned MANFC:1;
    unsigned :2;
    unsigned AUTOFC:1;
    unsigned RXEN:1;
    unsigned TXRTS:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned PTV:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON1bits_t;*/
volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs")));
volatile unsigned int        ETHCON1CLR __attribute__((section("sfrs")));
volatile unsigned int        ETHCON1SET __attribute__((section("sfrs")));
volatile unsigned int        ETHCON1INV __attribute__((section("sfrs")));
volatile unsigned int        ETHCON2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :4;
    unsigned RXBUF_SZ:7;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON2bits_t;*/
volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs")));
volatile unsigned int        ETHCON2CLR __attribute__((section("sfrs")));
volatile unsigned int        ETHCON2SET __attribute__((section("sfrs")));
volatile unsigned int        ETHCON2INV __attribute__((section("sfrs")));
volatile unsigned int        ETHTXST __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :2;
    unsigned TXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHTXSTbits_t;*/
volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs")));
volatile unsigned int        ETHTXSTCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHTXSTSET __attribute__((section("sfrs")));
volatile unsigned int        ETHTXSTINV __attribute__((section("sfrs")));
volatile unsigned int        ETHRXST __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :2;
    unsigned RXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXSTbits_t;*/
volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs")));
volatile unsigned int        ETHRXSTCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHRXSTSET __attribute__((section("sfrs")));
volatile unsigned int        ETHRXSTINV __attribute__((section("sfrs")));
volatile unsigned int        ETHHT0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned HTLOWER:32;
  };
} __ETHHT0bits_t;*/
volatile __ETHHT0bits_t ETHHT0bits __asm__ ("ETHHT0") __attribute__((section("sfrs")));
volatile unsigned int        ETHHT0CLR __attribute__((section("sfrs")));
volatile unsigned int        ETHHT0SET __attribute__((section("sfrs")));
volatile unsigned int        ETHHT0INV __attribute__((section("sfrs")));
volatile unsigned int        ETHHT1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned HTUPPER:32;
  };
} __ETHHT1bits_t;*/
volatile __ETHHT1bits_t ETHHT1bits __asm__ ("ETHHT1") __attribute__((section("sfrs")));
volatile unsigned int        ETHHT1CLR __attribute__((section("sfrs")));
volatile unsigned int        ETHHT1SET __attribute__((section("sfrs")));
volatile unsigned int        ETHHT1INV __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned PMMLOWER:32;
  };
} __ETHPMM0bits_t;*/
volatile __ETHPMM0bits_t ETHPMM0bits __asm__ ("ETHPMM0") __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM0CLR __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM0SET __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM0INV __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned PMMUPPER:32;
  };
} __ETHPMM1bits_t;*/
volatile __ETHPMM1bits_t ETHPMM1bits __asm__ ("ETHPMM1") __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM1CLR __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM1SET __attribute__((section("sfrs")));
volatile unsigned int        ETHPMM1INV __attribute__((section("sfrs")));
volatile unsigned int        ETHPMCS __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMCS:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHPMCSbits_t;*/
volatile __ETHPMCSbits_t ETHPMCSbits __asm__ ("ETHPMCS") __attribute__((section("sfrs")));
volatile unsigned int        ETHPMCSCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHPMCSSET __attribute__((section("sfrs")));
volatile unsigned int        ETHPMCSINV __attribute__((section("sfrs")));
volatile unsigned int        ETHPMO __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMO:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHPMObits_t;*/
volatile __ETHPMObits_t ETHPMObits __asm__ ("ETHPMO") __attribute__((section("sfrs")));
volatile unsigned int        ETHPMOCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHPMOSET __attribute__((section("sfrs")));
volatile unsigned int        ETHPMOINV __attribute__((section("sfrs")));
volatile unsigned int        ETHRXFC __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned BCEN:1;
    unsigned MCEN:1;
    unsigned NOTMEEN:1;
    unsigned UCEN:1;
    unsigned RUNTEN:1;
    unsigned RUNTERREN:1;
    unsigned CRCOKEN:1;
    unsigned CRCERREN:1;
    unsigned PMMODE:4;
    unsigned NOTPM:1;
    unsigned :1;
    unsigned MPEN:1;
    unsigned HTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXFCbits_t;*/
volatile __ETHRXFCbits_t ETHRXFCbits __asm__ ("ETHRXFC") __attribute__((section("sfrs")));
volatile unsigned int        ETHRXFCCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHRXFCSET __attribute__((section("sfrs")));
volatile unsigned int        ETHRXFCINV __attribute__((section("sfrs")));
volatile unsigned int        ETHRXWM __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXEWM:8;
    unsigned :8;
    unsigned RXFWM:8;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXWMbits_t;*/
volatile __ETHRXWMbits_t ETHRXWMbits __asm__ ("ETHRXWM") __attribute__((section("sfrs")));
volatile unsigned int        ETHRXWMCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHRXWMSET __attribute__((section("sfrs")));
volatile unsigned int        ETHRXWMINV __attribute__((section("sfrs")));
volatile unsigned int        ETHIEN __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXOVFLWIE:1;
    unsigned RXBUFNAIE:1;
    unsigned TXABORTIE:1;
    unsigned TXDONEIE:1;
    unsigned :1;
    unsigned RXACTIE:1;
    unsigned PKTPENDIE:1;
    unsigned RXDONEIE:1;
    unsigned FWMARKIE:1;
    unsigned EWMARKIE:1;
    unsigned :3;
    unsigned RXBUSEIE:1;
    unsigned TXBUSEIE:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHIENbits_t;*/
volatile __ETHIENbits_t ETHIENbits __asm__ ("ETHIEN") __attribute__((section("sfrs")));
volatile unsigned int        ETHIENCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHIENSET __attribute__((section("sfrs")));
volatile unsigned int        ETHIENINV __attribute__((section("sfrs")));
volatile unsigned int        ETHIRQ __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXOVFLW:1;
    unsigned RXBUFNA:1;
    unsigned TXABORT:1;
    unsigned TXDONE:1;
    unsigned :1;
    unsigned RXACT:1;
    unsigned PKTPEND:1;
    unsigned RXDONE:1;
    unsigned FWMARK:1;
    unsigned EWMARK:1;
    unsigned :3;
    unsigned RXBUSE:1;
    unsigned TXBUSE:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHIRQbits_t;*/
