HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __ETHIRQbits_t ETHIRQbits __asm__ ("ETHIRQ") __attribute__((section("sfrs")));
volatile unsigned int        ETHIRQCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHIRQSET __attribute__((section("sfrs")));
volatile unsigned int        ETHIRQINV __attribute__((section("sfrs")));
volatile unsigned int        ETHSTAT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :5;
    unsigned RXBUSY:1;
    unsigned TXBUSY:1;
    unsigned BUSY:1;
    unsigned :8;
    unsigned BUFCNT:8;
  };
  struct {
    unsigned :7;
    unsigned ETHBUSY:1;
  };
  struct {
    unsigned w:32;
  };
} __ETHSTATbits_t;*/
volatile __ETHSTATbits_t ETHSTATbits __asm__ ("ETHSTAT") __attribute__((section("sfrs")));
volatile unsigned int        ETHSTATCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHSTATSET __attribute__((section("sfrs")));
volatile unsigned int        ETHSTATINV __attribute__((section("sfrs")));
volatile unsigned int        ETHRXOVFLOW __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXOVFLWCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXOVFLOWbits_t;*/
volatile __ETHRXOVFLOWbits_t ETHRXOVFLOWbits __asm__ ("ETHRXOVFLOW") __attribute__((section("sfrs")));
volatile unsigned int        ETHRXOVFLOWCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHRXOVFLOWSET __attribute__((section("sfrs")));
volatile unsigned int        ETHRXOVFLOWINV __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMTXOK __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FRMTXOKCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHFRMTXOKbits_t;*/
volatile __ETHFRMTXOKbits_t ETHFRMTXOKbits __asm__ ("ETHFRMTXOK") __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMTXOKCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMTXOKSET __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMTXOKINV __attribute__((section("sfrs")));
volatile unsigned int        ETHSCOLFRM __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SCOLFRMCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHSCOLFRMbits_t;*/
volatile __ETHSCOLFRMbits_t ETHSCOLFRMbits __asm__ ("ETHSCOLFRM") __attribute__((section("sfrs")));
volatile unsigned int        ETHSCOLFRMCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHSCOLFRMSET __attribute__((section("sfrs")));
volatile unsigned int        ETHSCOLFRMINV __attribute__((section("sfrs")));
volatile unsigned int        ETHMCOLFRM __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MCOLFRMCNT:16;
  };
  struct {
    unsigned MCOLFRM_CNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHMCOLFRMbits_t;*/
volatile __ETHMCOLFRMbits_t ETHMCOLFRMbits __asm__ ("ETHMCOLFRM") __attribute__((section("sfrs")));
volatile unsigned int        ETHMCOLFRMCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHMCOLFRMSET __attribute__((section("sfrs")));
volatile unsigned int        ETHMCOLFRMINV __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMRXOK __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FRMRXOKCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHFRMRXOKbits_t;*/
volatile __ETHFRMRXOKbits_t ETHFRMRXOKbits __asm__ ("ETHFRMRXOK") __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMRXOKCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMRXOKSET __attribute__((section("sfrs")));
volatile unsigned int        ETHFRMRXOKINV __attribute__((section("sfrs")));
volatile unsigned int        ETHFCSERR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FCSERRCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHFCSERRbits_t;*/
volatile __ETHFCSERRbits_t ETHFCSERRbits __asm__ ("ETHFCSERR") __attribute__((section("sfrs")));
volatile unsigned int        ETHFCSERRCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHFCSERRSET __attribute__((section("sfrs")));
volatile unsigned int        ETHFCSERRINV __attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ALGNERRCNT:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHALGNERRbits_t;*/
volatile __ETHALGNERRbits_t ETHALGNERRbits __asm__ ("ETHALGNERR") __attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERRCLR __attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERRSET __attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERRINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXENABLE:1;
    unsigned PASSALL:1;
    unsigned RXPAUSE:1;
    unsigned TXPAUSE:1;
    unsigned LOOPBACK:1;
    unsigned :3;
    unsigned RESETTFUN:1;
    unsigned RESETTMCS:1;
    unsigned RESETRFUN:1;
    unsigned RESETRMCS:1;
    unsigned :2;
    unsigned SIMRESET:1;
    unsigned SOFTRESET:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1CFG1bits_t;*/
volatile __EMAC1CFG1bits_t EMAC1CFG1bits __asm__ ("EMAC1CFG1") __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXENABLE:1;
    unsigned PASSALL:1;
    unsigned RXPAUSE:1;
    unsigned TXPAUSE:1;
    unsigned LOOPBACK:1;
    unsigned :3;
    unsigned RESETTFUN:1;
    unsigned RESETTMCS:1;
    unsigned RESETRFUN:1;
    unsigned RESETRMCS:1;
    unsigned :2;
    unsigned SIMRESET:1;
    unsigned SOFTRESET:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxCFG1bits_t;*/
volatile __EMACxCFG1bits_t EMACxCFG1bits __asm__ ("EMACxCFG1") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1CLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1CLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1SET __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1SET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1INV __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1INV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FULLDPLX:1;
    unsigned LENGTHCK:1;
    unsigned HUGEFRM:1;
    unsigned DELAYCRC:1;
    unsigned CRCENABLE:1;
    unsigned PADENABLE:1;
    unsigned VLANPAD:1;
    unsigned AUTOPAD:1;
    unsigned PUREPRE:1;
    unsigned LONGPRE:1;
    unsigned :2;
    unsigned NOBKOFF:1;
    unsigned BPNOBKOFF:1;
    unsigned EXCESSDFR:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1CFG2bits_t;*/
