HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __EMAC1CFG2bits_t EMAC1CFG2bits __asm__ ("EMAC1CFG2") __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FULLDPLX:1;
    unsigned LENGTHCK:1;
    unsigned HUGEFRM:1;
    unsigned DELAYCRC:1;
    unsigned CRCENABLE:1;
    unsigned PADENABLE:1;
    unsigned VLANPAD:1;
    unsigned AUTOPAD:1;
    unsigned PUREPRE:1;
    unsigned LONGPRE:1;
    unsigned :2;
    unsigned NOBKOFF:1;
    unsigned BPNOBKOFF:1;
    unsigned EXCESSDFR:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxCFG2bits_t;*/
volatile __EMACxCFG2bits_t EMACxCFG2bits __asm__ ("EMACxCFG2") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2CLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2CLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2SET __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2SET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2INV __attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2INV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned B2BIPKTGP:7;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1IPGTbits_t;*/
volatile __EMAC1IPGTbits_t EMAC1IPGTbits __asm__ ("EMAC1IPGT") __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned B2BIPKTGP:7;
  };
  struct {
    unsigned w:32;
  };
} __EMACxIPGTbits_t;*/
volatile __EMACxIPGTbits_t EMACxIPGTbits __asm__ ("EMACxIPGT") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGTCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGTCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGTSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGTSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGTINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGTINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned NB2BIPKTGP2:7;
    unsigned :1;
    unsigned NB2BIPKTGP1:7;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1IPGRbits_t;*/
volatile __EMAC1IPGRbits_t EMAC1IPGRbits __asm__ ("EMAC1IPGR") __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned NB2BIPKTGP2:7;
    unsigned :1;
    unsigned NB2BIPKTGP1:7;
  };
  struct {
    unsigned w:32;
  };
} __EMACxIPGRbits_t;*/
volatile __EMACxIPGRbits_t EMACxIPGRbits __asm__ ("EMACxIPGR") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGRCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGRCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGRSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGRSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGRINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGRINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RETX:4;
    unsigned :4;
    unsigned CWINDOW:6;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1CLRTbits_t;*/
volatile __EMAC1CLRTbits_t EMAC1CLRTbits __asm__ ("EMAC1CLRT") __attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRT __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RETX:4;
    unsigned :4;
    unsigned CWINDOW:6;
  };
  struct {
    unsigned w:32;
  };
} __EMACxCLRTbits_t;*/
volatile __EMACxCLRTbits_t EMACxCLRTbits __asm__ ("EMACxCLRT") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRTCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRTCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRTSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRTSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRTINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRTINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MACMAXF:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MAXFbits_t;*/
volatile __EMAC1MAXFbits_t EMAC1MAXFbits __asm__ ("EMAC1MAXF") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXF __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MACMAXF:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMAXFbits_t;*/
volatile __EMACxMAXFbits_t EMACxMAXFbits __asm__ ("EMACxMAXF") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXFCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXFCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXFSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXFSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXFINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXFINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPP __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SPEEDRMII:1;
    unsigned :2;
    unsigned RESETRMII:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SUPPbits_t;*/
volatile __EMAC1SUPPbits_t EMAC1SUPPbits __asm__ ("EMAC1SUPP") __attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPP __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SPEEDRMII:1;
    unsigned :2;
    unsigned RESETRMII:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSUPPbits_t;*/
