HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __EMACxSUPPbits_t EMACxSUPPbits __asm__ ("EMACxSUPP") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPPCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPPCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPPSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPPSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPPINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPPINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1TEST __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SHRTQNTA:1;
    unsigned TESTPAUSE:1;
    unsigned TESTBP:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1TESTbits_t;*/
volatile __EMAC1TESTbits_t EMAC1TESTbits __asm__ ("EMAC1TEST") __attribute__((section("sfrs")));
volatile unsigned int        EMACxTEST __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SHRTQNTA:1;
    unsigned TESTPAUSE:1;
    unsigned TESTBP:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxTESTbits_t;*/
volatile __EMACxTESTbits_t EMACxTESTbits __asm__ ("EMACxTEST") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1TESTCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxTESTCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1TESTSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxTESTSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1TESTINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxTESTINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SCANINC:1;
    unsigned NOPRE:1;
    unsigned CLKSEL:4;
    unsigned :9;
    unsigned RESETMGMT:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MCFGbits_t;*/
volatile __EMAC1MCFGbits_t EMAC1MCFGbits __asm__ ("EMAC1MCFG") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFG __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SCANINC:1;
    unsigned NOPRE:1;
    unsigned CLKSEL:4;
    unsigned :9;
    unsigned RESETMGMT:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMCFGbits_t;*/
volatile __EMACxMCFGbits_t EMACxMCFGbits __asm__ ("EMACxMCFG") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFGCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFGCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFGSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFGSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFGINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFGINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned READ:1;
    unsigned SCAN:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MCMDbits_t;*/
volatile __EMAC1MCMDbits_t EMAC1MCMDbits __asm__ ("EMAC1MCMD") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned READ:1;
    unsigned SCAN:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMCMDbits_t;*/
volatile __EMACxMCMDbits_t EMACxMCMDbits __asm__ ("EMACxMCMD") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMDSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMDSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMDINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMDINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned REGADDR:5;
    unsigned :3;
    unsigned PHYADDR:5;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MADRbits_t;*/
volatile __EMAC1MADRbits_t EMAC1MADRbits __asm__ ("EMAC1MADR") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMADR __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned REGADDR:5;
    unsigned :3;
    unsigned PHYADDR:5;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMADRbits_t;*/
volatile __EMACxMADRbits_t EMACxMADRbits __asm__ ("EMACxMADR") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADRCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMADRCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADRSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMADRSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADRINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMADRINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MWTD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MWTDbits_t;*/
volatile __EMAC1MWTDbits_t EMAC1MWTDbits __asm__ ("EMAC1MWTD") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MWTD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMWTDbits_t;*/
volatile __EMACxMWTDbits_t EMACxMWTDbits __asm__ ("EMACxMWTD") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTDSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTDSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTDINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTDINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MRDD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MRDDbits_t;*/
volatile __EMAC1MRDDbits_t EMAC1MRDDbits __asm__ ("EMAC1MRDD") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDD __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MRDD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMRDDbits_t;*/
volatile __EMACxMRDDbits_t EMACxMRDDbits __asm__ ("EMACxMRDD") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDDSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDDSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDDINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDDINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MIND __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MIIMBUSY:1;
    unsigned SCAN:1;
    unsigned NOTVALID:1;
    unsigned LINKFAIL:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MINDbits_t;*/
