HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __EMAC1MINDbits_t EMAC1MINDbits __asm__ ("EMAC1MIND") __attribute__((section("sfrs")));
volatile unsigned int        EMACxMIND __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MIIMBUSY:1;
    unsigned SCAN:1;
    unsigned NOTVALID:1;
    unsigned LINKFAIL:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMINDbits_t;*/
volatile __EMACxMINDbits_t EMACxMINDbits __asm__ ("EMACxMIND") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MINDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxMINDCLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MINDSET __attribute__((section("sfrs")));
volatile unsigned int        EMACxMINDSET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1MINDINV __attribute__((section("sfrs")));
volatile unsigned int        EMACxMINDINV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR5:8;
    unsigned STNADDR6:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA0bits_t;*/
volatile __EMAC1SA0bits_t EMAC1SA0bits __asm__ ("EMAC1SA0") __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR5:8;
    unsigned STNADDR6:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA0bits_t;*/
volatile __EMACxSA0bits_t EMACxSA0bits __asm__ ("EMACxSA0") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0CLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0CLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0SET __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0SET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0INV __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0INV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR3:8;
    unsigned STNADDR4:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA1bits_t;*/
volatile __EMAC1SA1bits_t EMAC1SA1bits __asm__ ("EMAC1SA1") __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR3:8;
    unsigned STNADDR4:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA1bits_t;*/
volatile __EMACxSA1bits_t EMACxSA1bits __asm__ ("EMACxSA1") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1CLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1CLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1SET __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1SET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1INV __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1INV __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR1:8;
    unsigned STNADDR2:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA2bits_t;*/
volatile __EMAC1SA2bits_t EMAC1SA2bits __asm__ ("EMAC1SA2") __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR1:8;
    unsigned STNADDR2:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA2bits_t;*/
volatile __EMACxSA2bits_t EMACxSA2bits __asm__ ("EMACxSA2") __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2CLR __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2CLR __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2SET __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2SET __attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2INV __attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2INV __attribute__((section("sfrs")));
volatile unsigned int        PRECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PFMWS:3;
  unsigned :1;
  unsigned PREFEN:2;
  unsigned :20;
  unsigned PFMSECEN:1;
} __PRECONbits_t;*/
volatile __PRECONbits_t PRECONbits __asm__ ("PRECON") __attribute__((section("sfrs")));
volatile unsigned int        PRECONCLR __attribute__((section("sfrs")));
volatile unsigned int        PRECONSET __attribute__((section("sfrs")));
volatile unsigned int        PRECONINV __attribute__((section("sfrs")));
volatile unsigned int        PRESTAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PFMSECCNT:8;
  unsigned :18;
  unsigned PFMSEC:1;
  unsigned PFMDED:1;
} __PRESTATbits_t;*/
volatile __PRESTATbits_t PRESTATbits __asm__ ("PRESTAT") __attribute__((section("sfrs")));
volatile unsigned int        PRESTATCLR __attribute__((section("sfrs")));
volatile unsigned int        PRESTATSET __attribute__((section("sfrs")));
volatile unsigned int        PRESTATINV __attribute__((section("sfrs")));
volatile unsigned int        EBICS0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS0bits_t;*/
volatile __EBICS0bits_t EBICS0bits __asm__ ("EBICS0") __attribute__((section("sfrs")));
volatile unsigned int        EBIMSK0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK0bits_t;*/
volatile __EBIMSK0bits_t EBIMSK0bits __asm__ ("EBIMSK0") __attribute__((section("sfrs")));
volatile unsigned int        EBISMT0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT0bits_t;*/
volatile __EBISMT0bits_t EBISMT0bits __asm__ ("EBISMT0") __attribute__((section("sfrs")));
volatile unsigned int        EBISMT1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT1bits_t;*/
volatile __EBISMT1bits_t EBISMT1bits __asm__ ("EBISMT1") __attribute__((section("sfrs")));
volatile unsigned int        EBISMT2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT2bits_t;*/
volatile __EBISMT2bits_t EBISMT2bits __asm__ ("EBISMT2") __attribute__((section("sfrs")));
volatile unsigned int        EBIFTRPD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRPD:32;
} __EBIFTRPDbits_t;*/
