HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __EBIFTRPDbits_t EBIFTRPDbits __asm__ ("EBIFTRPD") __attribute__((section("sfrs")));
volatile unsigned int        EBISMCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SMRP:1;
  unsigned :6;
  unsigned SMDWIDTH0:3;
  unsigned SMDWIDTH1:3;
  unsigned SMDWIDTH2:3;
} __EBISMCONbits_t;*/
volatile __EBISMCONbits_t EBISMCONbits __asm__ ("EBISMCON") __attribute__((section("sfrs")));
volatile unsigned int        SQI1XCON1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TYPECMD:2;
  unsigned TYPEADDR:2;
  unsigned TYPEMODE:2;
  unsigned TYPEDUMMY:2;
  unsigned TYPEDATA:2;
  unsigned READOPCODE:8;
  unsigned ADDRBYTES:3;
  unsigned DUMMYBYTES:3;
} __SQI1XCON1bits_t;*/
volatile __SQI1XCON1bits_t SQI1XCON1bits __asm__ ("SQI1XCON1") __attribute__((section("sfrs")));
volatile unsigned int        SQI1XCON2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned MODECODE:8;
  unsigned MODEBYTES:2;
  unsigned DEVSEL:2;
} __SQI1XCON2bits_t;*/
volatile __SQI1XCON2bits_t SQI1XCON2bits __asm__ ("SQI1XCON2") __attribute__((section("sfrs")));
volatile unsigned int        SQI1CFG __attribute__((section("sfrs")));
/*typedef struct {
  unsigned MODE:3;
  unsigned CPHA:1;
  unsigned CPOL:1;
  unsigned LSBF:1;
  unsigned RXLATCH:1;
  unsigned SERMODE:1;
  unsigned WP:1;
  unsigned HOLD:1;
  unsigned :1;
  unsigned BURSTEN:1;
  unsigned :2;
  unsigned RESET:1;
  unsigned :3;
  unsigned DATAEN:2;
  unsigned :2;
  unsigned CSEN:2;
  unsigned :5;
  unsigned SQIEN:1;
} __SQI1CFGbits_t;*/
volatile __SQI1CFGbits_t SQI1CFGbits __asm__ ("SQI1CFG") __attribute__((section("sfrs")));
volatile unsigned int        SQI1CON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXRXCOUNT:16;
  unsigned CMDINIT:2;
  unsigned LANEMODE:2;
  unsigned DEVSEL:2;
  unsigned DASSERT:1;
} __SQI1CONbits_t;*/
volatile __SQI1CONbits_t SQI1CONbits __asm__ ("SQI1CON") __attribute__((section("sfrs")));
volatile unsigned int        SQI1CLKCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned EN:1;
  unsigned STABLE:1;
  unsigned :6;
  unsigned CLKDIV:8;
} __SQI1CLKCONbits_t;*/
volatile __SQI1CLKCONbits_t SQI1CLKCONbits __asm__ ("SQI1CLKCON") __attribute__((section("sfrs")));
volatile unsigned int        SQI1CMDTHR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCMDTHR:5;
  unsigned :3;
  unsigned TXCMDTHR:5;
} __SQI1CMDTHRbits_t;*/
volatile __SQI1CMDTHRbits_t SQI1CMDTHRbits __asm__ ("SQI1CMDTHR") __attribute__((section("sfrs")));
volatile unsigned int        SQI1INTTHR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXINTTHR:5;
  unsigned :3;
  unsigned TXINTTHR:5;
} __SQI1INTTHRbits_t;*/
volatile __SQI1INTTHRbits_t SQI1INTTHRbits __asm__ ("SQI1INTTHR") __attribute__((section("sfrs")));
volatile unsigned int        SQI1INTEN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXEMPTYIE:1;
  unsigned TXFULLIE:1;
  unsigned TXTHRIE:1;
  unsigned RXEMPTYIE:1;
  unsigned RXFULLIE:1;
  unsigned RXTHRIE:1;
  unsigned CONFULLIE:1;
  unsigned CONEMPTYIE:1;
  unsigned CONTHRIE:1;
  unsigned BDDONEIE:1;
  unsigned PKTCOMPIE:1;
} __SQI1INTENbits_t;*/
volatile __SQI1INTENbits_t SQI1INTENbits __asm__ ("SQI1INTEN") __attribute__((section("sfrs")));
volatile unsigned int        SQI1INTSTAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXEMPTYIF:1;
  unsigned TXFULLIF:1;
  unsigned TXTHRIF:1;
  unsigned RXEMPTYIF:1;
  unsigned RXFULLIF:1;
  unsigned RXTHRIF:1;
  unsigned CONFULLIF:1;
  unsigned CONEMPTYIF:1;
  unsigned CONTHRIF:1;
  unsigned BDDONEIF:1;
  unsigned PKTCOMPIF:1;
} __SQI1INTSTATbits_t;*/
volatile __SQI1INTSTATbits_t SQI1INTSTATbits __asm__ ("SQI1INTSTAT") __attribute__((section("sfrs")));
volatile unsigned int        SQI1TXBUF __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXDATA:32;
} __SQI1TXBUFbits_t;*/
volatile __SQI1TXBUFbits_t SQI1TXBUFbits __asm__ ("SQI1TXBUF") __attribute__((section("sfrs")));
volatile unsigned int        SQI1RXBUF __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXDATA:32;
} __SQI1RXBUFbits_t;*/
volatile __SQI1RXBUFbits_t SQI1RXBUFbits __asm__ ("SQI1RXBUF") __attribute__((section("sfrs")));
volatile unsigned int        SQI1STAT1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXBUFCNT:8;
  unsigned :8;
  unsigned TXBUFFREE:8;
} __SQI1STAT1bits_t;*/
volatile __SQI1STAT1bits_t SQI1STAT1bits __asm__ ("SQI1STAT1") __attribute__((section("sfrs")));
volatile unsigned int        SQI1STAT2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXOV:1;
  unsigned RXUN:1;
  unsigned :1;
  unsigned SQID0:1;
  unsigned SQID1:1;
  unsigned SQID2:1;
  unsigned SQID3:1;
} __SQI1STAT2bits_t;*/
volatile __SQI1STAT2bits_t SQI1STAT2bits __asm__ ("SQI1STAT2") __attribute__((section("sfrs")));
volatile unsigned int        SQI1BDCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned POLLEN:1;
  unsigned START:1;
} __SQI1BDCONbits_t;*/
volatile __SQI1BDCONbits_t SQI1BDCONbits __asm__ ("SQI1BDCON") __attribute__((section("sfrs")));
volatile unsigned int        SQI1BDCURADD __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDCURRADDR:32;
} __SQI1BDCURADDbits_t;*/
volatile __SQI1BDCURADDbits_t SQI1BDCURADDbits __asm__ ("SQI1BDCURADD") __attribute__((section("sfrs")));
volatile unsigned int        SQI1BDBASEADDR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDADDR:32;
} __SQI1BDBASEADDRbits_t;*/
volatile __SQI1BDBASEADDRbits_t SQI1BDBASEADDRbits __asm__ ("SQI1BDBASEADDR") __attribute__((section("sfrs")));
volatile unsigned int        SQI1BDSTAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDCON:16;
  unsigned DMAACTV:1;
  unsigned DMASTART:1;
  unsigned BDSTATE:4;
} __SQI1BDSTATbits_t;*/
volatile __SQI1BDSTATbits_t SQI1BDSTATbits __asm__ ("SQI1BDSTAT") __attribute__((section("sfrs")));
volatile unsigned int        SQI1BDPOLLCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned POLLCON:16;
} __SQI1BDPOLLCONbits_t;*/
