HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __USBTMCON1bits_t USBTMCON1bits __asm__ ("USBTMCON1") __attribute__((section("sfrs")));
volatile unsigned int        USBTMCON2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned THSBT:4;
} __USBTMCON2bits_t;*/
volatile __USBTMCON2bits_t USBTMCON2bits __asm__ ("USBTMCON2") __attribute__((section("sfrs")));
volatile unsigned int        USBLPMR1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned LNKSTATE:4;
  unsigned HIRD:4;
  unsigned RMTWAK:1;
  unsigned :3;
  unsigned ENDPOINT:4;
  unsigned LPMXMT:1;
  unsigned LPMRES:1;
  unsigned LPMEN:2;
  unsigned LPMNAK:1;
  unsigned :3;
  unsigned LPMTOIE:1;
  unsigned LPMSTIE:1;
  unsigned LPMNYIE:1;
  unsigned LPMACKIE:1;
  unsigned LPMRESIE:1;
  unsigned LPMERRIE:1;
} __USBLPMR1bits_t;*/
volatile __USBLPMR1bits_t USBLPMR1bits __asm__ ("USBLPMR1") __attribute__((section("sfrs")));
volatile unsigned int        USBLMPR2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned LPMST:1;
  unsigned LPMNY:1;
  unsigned LPMACK:1;
  unsigned LPMNC:1;
  unsigned LPMRES:1;
  unsigned LPMERR:1;
  unsigned :2;
  unsigned LPMFADDR:7;
} __USBLMPR2bits_t;*/
volatile __USBLMPR2bits_t USBLMPR2bits __asm__ ("USBLMPR2") __attribute__((section("sfrs")));
volatile unsigned int        CEVER __attribute__((section("sfrs")));
/*typedef struct {
  unsigned ID:16;
  unsigned VERSION:8;
  unsigned REVISION:8;
} __CEVERbits_t;*/
volatile __CEVERbits_t CEVERbits __asm__ ("CEVER") __attribute__((section("sfrs")));
volatile unsigned int        CECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned BDPPLEN:1;
  unsigned BDPCHST:1;
  unsigned :2;
  unsigned SWAPEN:1;
  unsigned SWRST:1;
} __CECONbits_t;*/
volatile __CECONbits_t CECONbits __asm__ ("CECON") __attribute__((section("sfrs")));
volatile unsigned int        CEBDADDR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDPADDR:32;
} __CEBDADDRbits_t;*/
volatile __CEBDADDRbits_t CEBDADDRbits __asm__ ("CEBDADDR") __attribute__((section("sfrs")));
volatile unsigned int        CEBDPADDR __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BASEADDR:32;
} __CEBDPADDRbits_t;*/
volatile __CEBDPADDRbits_t CEBDPADDRbits __asm__ ("CEBDPADDR") __attribute__((section("sfrs")));
volatile unsigned int        CESTAT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDCTRL:16;
  unsigned ACTIVE:1;
  unsigned START:1;
  unsigned BDSTATE:4;
  unsigned :2;
  unsigned ERRPHASE:2;
  unsigned ERROP:3;
  unsigned ERRMODE:3;
} __CESTATbits_t;*/
volatile __CESTATbits_t CESTATbits __asm__ ("CESTAT") __attribute__((section("sfrs")));
volatile unsigned int        CEINTSRC __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PENDIF:1;
  unsigned CBDIF:1;
  unsigned PKTIF:1;
  unsigned AREIF:1;
} __CEINTSRCbits_t;*/
volatile __CEINTSRCbits_t CEINTSRCbits __asm__ ("CEINTSRC") __attribute__((section("sfrs")));
volatile unsigned int        CEINTEN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PENDIE:1;
  unsigned CBDIE:1;
  unsigned PKTIE:1;
  unsigned AREIE:1;
} __CEINTENbits_t;*/
volatile __CEINTENbits_t CEINTENbits __asm__ ("CEINTEN") __attribute__((section("sfrs")));
volatile unsigned int        CEPOLLCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDPPLCON:16;
} __CEPOLLCONbits_t;*/
volatile __CEPOLLCONbits_t CEPOLLCONbits __asm__ ("CEPOLLCON") __attribute__((section("sfrs")));
volatile unsigned int        CEHDLEN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned HDRLEN:8;
} __CEHDLENbits_t;*/
volatile __CEHDLENbits_t CEHDLENbits __asm__ ("CEHDLEN") __attribute__((section("sfrs")));
volatile unsigned int        CETRLLEN __attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRLRLEN:8;
} __CETRLLENbits_t;*/
volatile __CETRLLENbits_t CETRLLENbits __asm__ ("CETRLLEN") __attribute__((section("sfrs")));
volatile unsigned int        RNGVER __attribute__((section("sfrs")));
/*typedef struct {
  unsigned REVISION:7;
  unsigned VERSION:9;
  unsigned ID:16;
} __RNGVERbits_t;*/
volatile __RNGVERbits_t RNGVERbits __asm__ ("RNGVER") __attribute__((section("sfrs")));
volatile unsigned int        RNGCON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned PLEN:8;
  unsigned TRNGEN:1;
  unsigned PRNGEN:1;
  unsigned CONT:1;
  unsigned :1;
  unsigned LOAD:1;
} __RNGCONbits_t;*/
volatile __RNGCONbits_t RNGCONbits __asm__ ("RNGCON") __attribute__((section("sfrs")));
volatile unsigned int        RNGPOLY1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned POLY:32;
} __RNGPOLY1bits_t;*/
volatile __RNGPOLY1bits_t RNGPOLY1bits __asm__ ("RNGPOLY1") __attribute__((section("sfrs")));
volatile unsigned int        RNGPOLY2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned POLY:32;
} __RNGPOLY2bits_t;*/
volatile __RNGPOLY2bits_t RNGPOLY2bits __asm__ ("RNGPOLY2") __attribute__((section("sfrs")));
volatile unsigned int        RNGNUMGEN1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RNG:32;
} __RNGNUMGEN1bits_t;*/
volatile __RNGNUMGEN1bits_t RNGNUMGEN1bits __asm__ ("RNGNUMGEN1") __attribute__((section("sfrs")));
volatile unsigned int        RNGNUMGEN2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RNG:32;
} __RNGNUMGEN2bits_t;*/
volatile __RNGNUMGEN2bits_t RNGNUMGEN2bits __asm__ ("RNGNUMGEN2") __attribute__((section("sfrs")));
volatile unsigned int        RNGSEED1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SEED:32;
} __RNGSEED1bits_t;*/
volatile __RNGSEED1bits_t RNGSEED1bits __asm__ ("RNGSEED1") __attribute__((section("sfrs")));
volatile unsigned int        RNGSEED2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned SEED:32;
} __RNGSEED2bits_t;*/
volatile __RNGSEED2bits_t RNGSEED2bits __asm__ ("RNGSEED2") __attribute__((section("sfrs")));
volatile unsigned int        RNGCNT __attribute__((section("sfrs")));
/*typedef struct {
  unsigned RCNT:7;
} __RNGCNTbits_t;*/
volatile __RNGCNTbits_t RNGCNTbits __asm__ ("RNGCNT") __attribute__((section("sfrs")));
volatile unsigned int        SBFLAG __attribute__((section("sfrs")));
/*typedef struct {
  unsigned T0PGV:1;
  unsigned T1PGV:1;
  unsigned T2PGV:1;
  unsigned T3PGV:1;
  unsigned T4PGV:1;
  unsigned T5PGV:1;
  unsigned T6PGV:1;
  unsigned T7PGV:1;
  unsigned T8PGV:1;
  unsigned T9PGV:1;
  unsigned T10PGV:1;
  unsigned T11PGV:1;
  unsigned T12PGV:1;
  unsigned T13PGV:1;
} __SBFLAGbits_t;*/
volatile __SBFLAGbits_t SBFLAGbits __asm__ ("SBFLAG") __attribute__((section("sfrs")));
volatile unsigned int        SBT0ELOG1 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT0ELOG1bits_t;*/
volatile __SBT0ELOG1bits_t SBT0ELOG1bits __asm__ ("SBT0ELOG1") __attribute__((section("sfrs")));
volatile unsigned int        SBT0ELOG2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT0ELOG2bits_t;*/
