HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __SBT13ELOG1bits_t SBT13ELOG1bits __asm__ ("SBT13ELOG1") __attribute__((section("sfrs")));
volatile unsigned int        SBT13ELOG2 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT13ELOG2bits_t;*/
volatile __SBT13ELOG2bits_t SBT13ELOG2bits __asm__ ("SBT13ELOG2") __attribute__((section("sfrs")));
volatile unsigned int        SBT13ECON __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT13ECONbits_t;*/
volatile __SBT13ECONbits_t SBT13ECONbits __asm__ ("SBT13ECON") __attribute__((section("sfrs")));
volatile unsigned int        SBT13ECLRS __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT13ECLRSbits_t;*/
volatile __SBT13ECLRSbits_t SBT13ECLRSbits __asm__ ("SBT13ECLRS") __attribute__((section("sfrs")));
volatile unsigned int        SBT13ECLRM __attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT13ECLRMbits_t;*/
volatile __SBT13ECLRMbits_t SBT13ECLRMbits __asm__ ("SBT13ECLRM") __attribute__((section("sfrs")));
volatile unsigned int        SBT13REG0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT13REG0bits_t;*/
volatile __SBT13REG0bits_t SBT13REG0bits __asm__ ("SBT13REG0") __attribute__((section("sfrs")));
volatile unsigned int        SBT13RD0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT13RD0bits_t;*/
volatile __SBT13RD0bits_t SBT13RD0bits __asm__ ("SBT13RD0") __attribute__((section("sfrs")));
volatile unsigned int        SBT13WR0 __attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT13WR0bits_t;*/
volatile __SBT13WR0bits_t SBT13WR0bits __asm__ ("SBT13WR0") __attribute__((section("sfrs")));
volatile unsigned int        DEVCFG3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG3bits_t;*/
volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs")));
volatile unsigned int        DEVCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG2bits_t;*/
volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs")));
volatile unsigned int        DEVCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG1bits_t;*/
volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs")));
volatile unsigned int        DEVCFG0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG0bits_t;*/
volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs")));
volatile unsigned int        DEVCP3 __attribute__((section("sfrs")));
volatile unsigned int        DEVCP2 __attribute__((section("sfrs")));
volatile unsigned int        DEVCP1 __attribute__((section("sfrs")));
volatile unsigned int        DEVCP0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCP0bits_t;*/
volatile __DEVCP0bits_t DEVCP0bits __asm__ ("DEVCP0") __attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN3 __attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN2 __attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN1 __attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN0 __attribute__((section("sfrs")));
volatile unsigned int        SEQ3 __attribute__((section("sfrs")));
volatile unsigned int        SEQ2 __attribute__((section("sfrs")));
volatile unsigned int        SEQ1 __attribute__((section("sfrs")));
volatile unsigned int        SEQ0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __SEQ0bits_t;*/
volatile __SEQ0bits_t SEQ0bits __asm__ ("SEQ0") __attribute__((section("sfrs")));
volatile unsigned int        DEVADC1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC1bits_t;*/
volatile __DEVADC1bits_t DEVADC1bits __asm__ ("DEVADC1") __attribute__((section("sfrs")));
volatile unsigned int        DEVADC2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC2bits_t;*/
volatile __DEVADC2bits_t DEVADC2bits __asm__ ("DEVADC2") __attribute__((section("sfrs")));
volatile unsigned int        DEVADC3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC3bits_t;*/
volatile __DEVADC3bits_t DEVADC3bits __asm__ ("DEVADC3") __attribute__((section("sfrs")));
volatile unsigned int        DEVADC4 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC4bits_t;*/
volatile __DEVADC4bits_t DEVADC4bits __asm__ ("DEVADC4") __attribute__((section("sfrs")));
volatile unsigned int        DEVADC5 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCCALDATA:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVADC5bits_t;*/
volatile __DEVADC5bits_t DEVADC5bits __asm__ ("DEVADC5") __attribute__((section("sfrs")));
volatile unsigned int        DEVSN0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SN:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVSN0bits_t;*/
