HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
volatile __DEVSN0bits_t DEVSN0bits __asm__ ("DEVSN0") __attribute__((section("sfrs")));
volatile unsigned int        DEVSN1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SN:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVSN1bits_t;*/
volatile __DEVSN1bits_t DEVSN1bits __asm__ ("DEVSN1") __attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG3bits_t;*/
volatile __ADEVCFG3bits_t ADEVCFG3bits __asm__ ("ADEVCFG3") __attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG2bits_t;*/
volatile __ADEVCFG2bits_t ADEVCFG2bits __asm__ ("ADEVCFG2") __attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG1bits_t;*/
volatile __ADEVCFG1bits_t ADEVCFG1bits __asm__ ("ADEVCFG1") __attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG0bits_t;*/
volatile __ADEVCFG0bits_t ADEVCFG0bits __asm__ ("ADEVCFG0") __attribute__((section("sfrs")));
volatile unsigned int        ADEVCP3 __attribute__((section("sfrs")));
volatile unsigned int        ADEVCP2 __attribute__((section("sfrs")));
volatile unsigned int        ADEVCP1 __attribute__((section("sfrs")));
volatile unsigned int        ADEVCP0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCP0bits_t;*/
volatile __ADEVCP0bits_t ADEVCP0bits __asm__ ("ADEVCP0") __attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN3 __attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN2 __attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN1 __attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN0 __attribute__((section("sfrs")));
volatile unsigned int        ASEQ3 __attribute__((section("sfrs")));
volatile unsigned int        ASEQ2 __attribute__((section("sfrs")));
volatile unsigned int        ASEQ1 __attribute__((section("sfrs")));
volatile unsigned int        ASEQ0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ASEQ0bits_t;*/
volatile __ASEQ0bits_t ASEQ0bits __asm__ ("ASEQ0") __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG3bits_t;*/
volatile __ABF1DEVCFG3bits_t ABF1DEVCFG3bits __asm__ ("ABF1DEVCFG3") __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG2bits_t;*/
volatile __ABF1DEVCFG2bits_t ABF1DEVCFG2bits __asm__ ("ABF1DEVCFG2") __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG1bits_t;*/
volatile __ABF1DEVCFG1bits_t ABF1DEVCFG1bits __asm__ ("ABF1DEVCFG1") __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG0bits_t;*/
volatile __ABF1DEVCFG0bits_t ABF1DEVCFG0bits __asm__ ("ABF1DEVCFG0") __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP3 __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP2 __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP1 __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCP0bits_t;*/
volatile __ABF1DEVCP0bits_t ABF1DEVCP0bits __asm__ ("ABF1DEVCP0") __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN3 __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN2 __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN1 __attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN0 __attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ3 __attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ2 __attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ1 __attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ABF1SEQ0bits_t;*/
volatile __ABF1SEQ0bits_t ABF1SEQ0bits __asm__ ("ABF1SEQ0") __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG3bits_t;*/
volatile __BF1DEVCFG3bits_t BF1DEVCFG3bits __asm__ ("BF1DEVCFG3") __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG2bits_t;*/
volatile __BF1DEVCFG2bits_t BF1DEVCFG2bits __asm__ ("BF1DEVCFG2") __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG1bits_t;*/
volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits __asm__ ("BF1DEVCFG1") __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG0bits_t;*/
volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits __asm__ ("BF1DEVCFG0") __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP3 __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP2 __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP1 __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCP0bits_t;*/
volatile __BF1DEVCP0bits_t BF1DEVCP0bits __asm__ ("BF1DEVCP0") __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN3 __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN2 __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN1 __attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN0 __attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ3 __attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ2 __attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ1 __attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __BF1SEQ0bits_t;*/
volatile __BF1SEQ0bits_t BF1SEQ0bits __asm__ ("BF1SEQ0") __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG3bits_t;*/
volatile __ABF2DEVCFG3bits_t ABF2DEVCFG3bits __asm__ ("ABF2DEVCFG3") __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG2bits_t;*/
volatile __ABF2DEVCFG2bits_t ABF2DEVCFG2bits __asm__ ("ABF2DEVCFG2") __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG1bits_t;*/
volatile __ABF2DEVCFG1bits_t ABF2DEVCFG1bits __asm__ ("ABF2DEVCFG1") __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG0bits_t;*/
volatile __ABF2DEVCFG0bits_t ABF2DEVCFG0bits __asm__ ("ABF2DEVCFG0") __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP3 __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP2 __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP1 __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCP0bits_t;*/
volatile __ABF2DEVCP0bits_t ABF2DEVCP0bits __asm__ ("ABF2DEVCP0") __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN3 __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN2 __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN1 __attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN0 __attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ3 __attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ2 __attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ1 __attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ABF2SEQ0bits_t;*/
volatile __ABF2SEQ0bits_t ABF2SEQ0bits __asm__ ("ABF2SEQ0") __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG3 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG3bits_t;*/
volatile __BF2DEVCFG3bits_t BF2DEVCFG3bits __asm__ ("BF2DEVCFG3") __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG2 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
    unsigned UPLLEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG2bits_t;*/
volatile __BF2DEVCFG2bits_t BF2DEVCFG2bits __asm__ ("BF2DEVCFG2") __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG1 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG1bits_t;*/
volatile __BF2DEVCFG1bits_t BF2DEVCFG1bits __asm__ ("BF2DEVCFG1") __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned :15;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG0bits_t;*/
volatile __BF2DEVCFG0bits_t BF2DEVCFG0bits __asm__ ("BF2DEVCFG0") __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP3 __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP2 __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP1 __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCP0bits_t;*/
volatile __BF2DEVCP0bits_t BF2DEVCP0bits __asm__ ("BF2DEVCP0") __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN3 __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN2 __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN1 __attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN0 __attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ3 __attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ2 __attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ1 __attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ0 __attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __BF2SEQ0bits_t;*/
volatile __BF2SEQ0bits_t BF2SEQ0bits __asm__ ("BF2SEQ0") __attribute__((section("sfrs")));

//#define _CFGCON_TDOEN_POSITION                   0x00000000
//#define _CFGCON_TDOEN_MASK                       0x00000001
//#define _CFGCON_TDOEN_LENGTH                     0x00000001

//#define _CFGCON_TROEN_POSITION                   0x00000002
//#define _CFGCON_TROEN_MASK                       0x00000004
//#define _CFGCON_TROEN_LENGTH                     0x00000001

//#define _CFGCON_JTAGEN_POSITION                  0x00000003
//#define _CFGCON_JTAGEN_MASK                      0x00000008
//#define _CFGCON_JTAGEN_LENGTH                    0x00000001

//#define _CFGCON_ECCCON_POSITION                  0x00000004
//#define _CFGCON_ECCCON_MASK                      0x00000030
//#define _CFGCON_ECCCON_LENGTH                    0x00000002

//#define _CFGCON_USBSSEN_POSITION                 0x00000008
//#define _CFGCON_USBSSEN_MASK                     0x00000100
//#define _CFGCON_USBSSEN_LENGTH                   0x00000001

