HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CFGCON_PGLOCK_POSITION                  0x0000000B
//#define _CFGCON_PGLOCK_MASK                      0x00000800
//#define _CFGCON_PGLOCK_LENGTH                    0x00000001

//#define _CFGCON_PMDLOCK_POSITION                 0x0000000C
//#define _CFGCON_PMDLOCK_MASK                     0x00001000
//#define _CFGCON_PMDLOCK_LENGTH                   0x00000001

//#define _CFGCON_IOLOCK_POSITION                  0x0000000D
//#define _CFGCON_IOLOCK_MASK                      0x00002000
//#define _CFGCON_IOLOCK_LENGTH                    0x00000001

//#define _CFGCON_OCACLK_POSITION                  0x00000010
//#define _CFGCON_OCACLK_MASK                      0x00010000
//#define _CFGCON_OCACLK_LENGTH                    0x00000001

//#define _CFGCON_ICACLK_POSITION                  0x00000011
//#define _CFGCON_ICACLK_MASK                      0x00020000
//#define _CFGCON_ICACLK_LENGTH                    0x00000001

//#define _CFGCON_CPUPRI_POSITION                  0x00000018
//#define _CFGCON_CPUPRI_MASK                      0x01000000
//#define _CFGCON_CPUPRI_LENGTH                    0x00000001

//#define _CFGCON_DMAPRI_POSITION                  0x00000019
//#define _CFGCON_DMAPRI_MASK                      0x02000000
//#define _CFGCON_DMAPRI_LENGTH                    0x00000001

//#define _DEVID_DEVID_POSITION                    0x00000000
//#define _DEVID_DEVID_MASK                        0x0FFFFFFF
//#define _DEVID_DEVID_LENGTH                      0x0000001C

//#define _DEVID_VER_POSITION                      0x0000001C
//#define _DEVID_VER_MASK                          0xF0000000
//#define _DEVID_VER_LENGTH                        0x00000004

//#define _SYSKEY_SYSKEY_POSITION                  0x00000000
//#define _SYSKEY_SYSKEY_MASK                      0xFFFFFFFF
//#define _SYSKEY_SYSKEY_LENGTH                    0x00000020

//#define _PMD1_AD1MD_POSITION                     0x00000000
//#define _PMD1_AD1MD_MASK                         0x00000001
//#define _PMD1_AD1MD_LENGTH                       0x00000001

//#define _PMD1_CVRMD_POSITION                     0x0000000C
//#define _PMD1_CVRMD_MASK                         0x00001000
//#define _PMD1_CVRMD_LENGTH                       0x00000001

//#define _PMD2_CMP1MD_POSITION                    0x00000000
//#define _PMD2_CMP1MD_MASK                        0x00000001
//#define _PMD2_CMP1MD_LENGTH                      0x00000001

//#define _PMD2_CMP2MD_POSITION                    0x00000001
//#define _PMD2_CMP2MD_MASK                        0x00000002
//#define _PMD2_CMP2MD_LENGTH                      0x00000001

//#define _PMD3_IC1MD_POSITION                     0x00000000
//#define _PMD3_IC1MD_MASK                         0x00000001
//#define _PMD3_IC1MD_LENGTH                       0x00000001

//#define _PMD3_IC2MD_POSITION                     0x00000001
//#define _PMD3_IC2MD_MASK                         0x00000002
//#define _PMD3_IC2MD_LENGTH                       0x00000001

//#define _PMD3_IC3MD_POSITION                     0x00000002
//#define _PMD3_IC3MD_MASK                         0x00000004
//#define _PMD3_IC3MD_LENGTH                       0x00000001

//#define _PMD3_IC4MD_POSITION                     0x00000003
//#define _PMD3_IC4MD_MASK                         0x00000008
//#define _PMD3_IC4MD_LENGTH                       0x00000001

//#define _PMD3_IC5MD_POSITION                     0x00000004
//#define _PMD3_IC5MD_MASK                         0x00000010
//#define _PMD3_IC5MD_LENGTH                       0x00000001

//#define _PMD3_IC6MD_POSITION                     0x00000005
//#define _PMD3_IC6MD_MASK                         0x00000020
//#define _PMD3_IC6MD_LENGTH                       0x00000001

//#define _PMD3_IC7MD_POSITION                     0x00000006
//#define _PMD3_IC7MD_MASK                         0x00000040
//#define _PMD3_IC7MD_LENGTH                       0x00000001

//#define _PMD3_IC8MD_POSITION                     0x00000007
//#define _PMD3_IC8MD_MASK                         0x00000080
//#define _PMD3_IC8MD_LENGTH                       0x00000001

//#define _PMD3_IC9MD_POSITION                     0x00000008
//#define _PMD3_IC9MD_MASK                         0x00000100
//#define _PMD3_IC9MD_LENGTH                       0x00000001

//#define _PMD3_OC1MD_POSITION                     0x00000010
//#define _PMD3_OC1MD_MASK                         0x00010000
//#define _PMD3_OC1MD_LENGTH                       0x00000001

//#define _PMD3_OC2MD_POSITION                     0x00000011
//#define _PMD3_OC2MD_MASK                         0x00020000
//#define _PMD3_OC2MD_LENGTH                       0x00000001

//#define _PMD3_OC3MD_POSITION                     0x00000012
//#define _PMD3_OC3MD_MASK                         0x00040000
//#define _PMD3_OC3MD_LENGTH                       0x00000001

//#define _PMD3_OC4MD_POSITION                     0x00000013
//#define _PMD3_OC4MD_MASK                         0x00080000
//#define _PMD3_OC4MD_LENGTH                       0x00000001

//#define _PMD3_OC5MD_POSITION                     0x00000014
//#define _PMD3_OC5MD_MASK                         0x00100000
//#define _PMD3_OC5MD_LENGTH                       0x00000001

//#define _PMD3_OC6MD_POSITION                     0x00000015
//#define _PMD3_OC6MD_MASK                         0x00200000
//#define _PMD3_OC6MD_LENGTH                       0x00000001

//#define _PMD3_OC7MD_POSITION                     0x00000016
//#define _PMD3_OC7MD_MASK                         0x00400000
//#define _PMD3_OC7MD_LENGTH                       0x00000001

//#define _PMD3_OC8MD_POSITION                     0x00000017
//#define _PMD3_OC8MD_MASK                         0x00800000
//#define _PMD3_OC8MD_LENGTH                       0x00000001

//#define _PMD3_OC9MD_POSITION                     0x00000018
//#define _PMD3_OC9MD_MASK                         0x01000000
//#define _PMD3_OC9MD_LENGTH                       0x00000001

//#define _PMD4_T1MD_POSITION                      0x00000000
//#define _PMD4_T1MD_MASK                          0x00000001
//#define _PMD4_T1MD_LENGTH                        0x00000001

//#define _PMD4_T2MD_POSITION                      0x00000001
//#define _PMD4_T2MD_MASK                          0x00000002
//#define _PMD4_T2MD_LENGTH                        0x00000001

//#define _PMD4_T3MD_POSITION                      0x00000002
//#define _PMD4_T3MD_MASK                          0x00000004
//#define _PMD4_T3MD_LENGTH                        0x00000001

//#define _PMD4_T4MD_POSITION                      0x00000003
//#define _PMD4_T4MD_MASK                          0x00000008
//#define _PMD4_T4MD_LENGTH                        0x00000001

//#define _PMD4_T5MD_POSITION                      0x00000004
//#define _PMD4_T5MD_MASK                          0x00000010
//#define _PMD4_T5MD_LENGTH                        0x00000001

//#define _PMD4_T6MD_POSITION                      0x00000005
//#define _PMD4_T6MD_MASK                          0x00000020
//#define _PMD4_T6MD_LENGTH                        0x00000001

//#define _PMD4_T7MD_POSITION                      0x00000006
//#define _PMD4_T7MD_MASK                          0x00000040
//#define _PMD4_T7MD_LENGTH                        0x00000001

//#define _PMD4_T8MD_POSITION                      0x00000007
//#define _PMD4_T8MD_MASK                          0x00000080
//#define _PMD4_T8MD_LENGTH                        0x00000001

