HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _PMD4_T9MD_POSITION                      0x00000008
//#define _PMD4_T9MD_MASK                          0x00000100
//#define _PMD4_T9MD_LENGTH                        0x00000001

//#define _PMD5_U1MD_POSITION                      0x00000000
//#define _PMD5_U1MD_MASK                          0x00000001
//#define _PMD5_U1MD_LENGTH                        0x00000001

//#define _PMD5_U2MD_POSITION                      0x00000001
//#define _PMD5_U2MD_MASK                          0x00000002
//#define _PMD5_U2MD_LENGTH                        0x00000001

//#define _PMD5_U3MD_POSITION                      0x00000002
//#define _PMD5_U3MD_MASK                          0x00000004
//#define _PMD5_U3MD_LENGTH                        0x00000001

//#define _PMD5_U4MD_POSITION                      0x00000003
//#define _PMD5_U4MD_MASK                          0x00000008
//#define _PMD5_U4MD_LENGTH                        0x00000001

//#define _PMD5_U5MD_POSITION                      0x00000004
//#define _PMD5_U5MD_MASK                          0x00000010
//#define _PMD5_U5MD_LENGTH                        0x00000001

//#define _PMD5_U6MD_POSITION                      0x00000005
//#define _PMD5_U6MD_MASK                          0x00000020
//#define _PMD5_U6MD_LENGTH                        0x00000001

//#define _PMD5_SPI1MD_POSITION                    0x00000008
//#define _PMD5_SPI1MD_MASK                        0x00000100
//#define _PMD5_SPI1MD_LENGTH                      0x00000001

//#define _PMD5_SPI2MD_POSITION                    0x00000009
//#define _PMD5_SPI2MD_MASK                        0x00000200
//#define _PMD5_SPI2MD_LENGTH                      0x00000001

//#define _PMD5_SPI3MD_POSITION                    0x0000000A
//#define _PMD5_SPI3MD_MASK                        0x00000400
//#define _PMD5_SPI3MD_LENGTH                      0x00000001

//#define _PMD5_SPI4MD_POSITION                    0x0000000B
//#define _PMD5_SPI4MD_MASK                        0x00000800
//#define _PMD5_SPI4MD_LENGTH                      0x00000001

//#define _PMD5_SPI5MD_POSITION                    0x0000000C
//#define _PMD5_SPI5MD_MASK                        0x00001000
//#define _PMD5_SPI5MD_LENGTH                      0x00000001

//#define _PMD5_SPI6MD_POSITION                    0x0000000D
//#define _PMD5_SPI6MD_MASK                        0x00002000
//#define _PMD5_SPI6MD_LENGTH                      0x00000001

//#define _PMD5_I2C1MD_POSITION                    0x00000010
//#define _PMD5_I2C1MD_MASK                        0x00010000
//#define _PMD5_I2C1MD_LENGTH                      0x00000001

//#define _PMD5_I2C2MD_POSITION                    0x00000011
//#define _PMD5_I2C2MD_MASK                        0x00020000
//#define _PMD5_I2C2MD_LENGTH                      0x00000001

//#define _PMD5_I2C3MD_POSITION                    0x00000012
//#define _PMD5_I2C3MD_MASK                        0x00040000
//#define _PMD5_I2C3MD_LENGTH                      0x00000001

//#define _PMD5_I2C4MD_POSITION                    0x00000013
//#define _PMD5_I2C4MD_MASK                        0x00080000
//#define _PMD5_I2C4MD_LENGTH                      0x00000001

//#define _PMD5_I2C5MD_POSITION                    0x00000014
//#define _PMD5_I2C5MD_MASK                        0x00100000
//#define _PMD5_I2C5MD_LENGTH                      0x00000001

//#define _PMD5_USBMD_POSITION                     0x00000018
//#define _PMD5_USBMD_MASK                         0x01000000
//#define _PMD5_USBMD_LENGTH                       0x00000001

//#define _PMD5_CAN1MD_POSITION                    0x0000001C
//#define _PMD5_CAN1MD_MASK                        0x10000000
//#define _PMD5_CAN1MD_LENGTH                      0x00000001

//#define _PMD5_CAN2MD_POSITION                    0x0000001D
//#define _PMD5_CAN2MD_MASK                        0x20000000
//#define _PMD5_CAN2MD_LENGTH                      0x00000001

//#define _PMD6_RTCCMD_POSITION                    0x00000000
//#define _PMD6_RTCCMD_MASK                        0x00000001
//#define _PMD6_RTCCMD_LENGTH                      0x00000001

//#define _PMD6_REFO1MD_POSITION                   0x00000008
//#define _PMD6_REFO1MD_MASK                       0x00000100
//#define _PMD6_REFO1MD_LENGTH                     0x00000001

//#define _PMD6_REFO2MD_POSITION                   0x00000009
//#define _PMD6_REFO2MD_MASK                       0x00000200
//#define _PMD6_REFO2MD_LENGTH                     0x00000001

//#define _PMD6_REFO3MD_POSITION                   0x0000000A
//#define _PMD6_REFO3MD_MASK                       0x00000400
//#define _PMD6_REFO3MD_LENGTH                     0x00000001

//#define _PMD6_REFO4MD_POSITION                   0x0000000B
//#define _PMD6_REFO4MD_MASK                       0x00000800
//#define _PMD6_REFO4MD_LENGTH                     0x00000001

//#define _PMD6_PMPMD_POSITION                     0x00000010
//#define _PMD6_PMPMD_MASK                         0x00010000
//#define _PMD6_PMPMD_LENGTH                       0x00000001

//#define _PMD6_EBIMD_POSITION                     0x00000011
//#define _PMD6_EBIMD_MASK                         0x00020000
//#define _PMD6_EBIMD_LENGTH                       0x00000001

//#define _PMD6_SQI1MD_POSITION                    0x00000017
//#define _PMD6_SQI1MD_MASK                        0x00800000
//#define _PMD6_SQI1MD_LENGTH                      0x00000001

//#define _PMD6_ETHMD_POSITION                     0x0000001C
//#define _PMD6_ETHMD_MASK                         0x10000000
//#define _PMD6_ETHMD_LENGTH                       0x00000001

//#define _PMD7_DMAMD_POSITION                     0x00000004
//#define _PMD7_DMAMD_MASK                         0x00000010
//#define _PMD7_DMAMD_LENGTH                       0x00000001

//#define _PMD7_RNGMD_POSITION                     0x00000014
//#define _PMD7_RNGMD_MASK                         0x00100000
//#define _PMD7_RNGMD_LENGTH                       0x00000001

//#define _PMD7_CRYPTMD_POSITION                   0x00000016
//#define _PMD7_CRYPTMD_MASK                       0x00400000
//#define _PMD7_CRYPTMD_LENGTH                     0x00000001

//#define _CFGEBIA_EBIA0EN_POSITION                0x00000000
//#define _CFGEBIA_EBIA0EN_MASK                    0x00000001
//#define _CFGEBIA_EBIA0EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA1EN_POSITION                0x00000001
//#define _CFGEBIA_EBIA1EN_MASK                    0x00000002
//#define _CFGEBIA_EBIA1EN_LENGTH                  0x00000001

