HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CFGEBIA_EBIA2EN_POSITION                0x00000002
//#define _CFGEBIA_EBIA2EN_MASK                    0x00000004
//#define _CFGEBIA_EBIA2EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA3EN_POSITION                0x00000003
//#define _CFGEBIA_EBIA3EN_MASK                    0x00000008
//#define _CFGEBIA_EBIA3EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA4EN_POSITION                0x00000004
//#define _CFGEBIA_EBIA4EN_MASK                    0x00000010
//#define _CFGEBIA_EBIA4EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA5EN_POSITION                0x00000005
//#define _CFGEBIA_EBIA5EN_MASK                    0x00000020
//#define _CFGEBIA_EBIA5EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA6EN_POSITION                0x00000006
//#define _CFGEBIA_EBIA6EN_MASK                    0x00000040
//#define _CFGEBIA_EBIA6EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA7EN_POSITION                0x00000007
//#define _CFGEBIA_EBIA7EN_MASK                    0x00000080
//#define _CFGEBIA_EBIA7EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA8EN_POSITION                0x00000008
//#define _CFGEBIA_EBIA8EN_MASK                    0x00000100
//#define _CFGEBIA_EBIA8EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA9EN_POSITION                0x00000009
//#define _CFGEBIA_EBIA9EN_MASK                    0x00000200
//#define _CFGEBIA_EBIA9EN_LENGTH                  0x00000001

//#define _CFGEBIA_EBIA10EN_POSITION               0x0000000A
//#define _CFGEBIA_EBIA10EN_MASK                   0x00000400
//#define _CFGEBIA_EBIA10EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA11EN_POSITION               0x0000000B
//#define _CFGEBIA_EBIA11EN_MASK                   0x00000800
//#define _CFGEBIA_EBIA11EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA12EN_POSITION               0x0000000C
//#define _CFGEBIA_EBIA12EN_MASK                   0x00001000
//#define _CFGEBIA_EBIA12EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA13EN_POSITION               0x0000000D
//#define _CFGEBIA_EBIA13EN_MASK                   0x00002000
//#define _CFGEBIA_EBIA13EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA14EN_POSITION               0x0000000E
//#define _CFGEBIA_EBIA14EN_MASK                   0x00004000
//#define _CFGEBIA_EBIA14EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA15EN_POSITION               0x0000000F
//#define _CFGEBIA_EBIA15EN_MASK                   0x00008000
//#define _CFGEBIA_EBIA15EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA16EN_POSITION               0x00000010
//#define _CFGEBIA_EBIA16EN_MASK                   0x00010000
//#define _CFGEBIA_EBIA16EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA17EN_POSITION               0x00000011
//#define _CFGEBIA_EBIA17EN_MASK                   0x00020000
//#define _CFGEBIA_EBIA17EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA18EN_POSITION               0x00000012
//#define _CFGEBIA_EBIA18EN_MASK                   0x00040000
//#define _CFGEBIA_EBIA18EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIA19EN_POSITION               0x00000013
//#define _CFGEBIA_EBIA19EN_MASK                   0x00080000
//#define _CFGEBIA_EBIA19EN_LENGTH                 0x00000001

//#define _CFGEBIA_EBIPINEN_POSITION               0x0000001F
//#define _CFGEBIA_EBIPINEN_MASK                   0x80000000
//#define _CFGEBIA_EBIPINEN_LENGTH                 0x00000001

//#define _CFGEBIC_EBIDEN0_POSITION                0x00000000
//#define _CFGEBIC_EBIDEN0_MASK                    0x00000001
//#define _CFGEBIC_EBIDEN0_LENGTH                  0x00000001

//#define _CFGEBIC_EBIDEN1_POSITION                0x00000001
//#define _CFGEBIC_EBIDEN1_MASK                    0x00000002
//#define _CFGEBIC_EBIDEN1_LENGTH                  0x00000001

//#define _CFGEBIC_EBICSEN0_POSITION               0x00000004
//#define _CFGEBIC_EBICSEN0_MASK                   0x00000010
//#define _CFGEBIC_EBICSEN0_LENGTH                 0x00000001

//#define _CFGEBIC_EBIOEEN_POSITION                0x0000000C
//#define _CFGEBIC_EBIOEEN_MASK                    0x00001000
//#define _CFGEBIC_EBIOEEN_LENGTH                  0x00000001

//#define _CFGEBIC_EBIWEEN_POSITION                0x0000000D
//#define _CFGEBIC_EBIWEEN_MASK                    0x00002000
//#define _CFGEBIC_EBIWEEN_LENGTH                  0x00000001

//#define _CFGEBIC_EBIRDYLVL_POSITION              0x00000011
//#define _CFGEBIC_EBIRDYLVL_MASK                  0x00020000
//#define _CFGEBIC_EBIRDYLVL_LENGTH                0x00000001

//#define _CFGEBIC_EBIRDYEN1_POSITION              0x00000018
//#define _CFGEBIC_EBIRDYEN1_MASK                  0x01000000
//#define _CFGEBIC_EBIRDYEN1_LENGTH                0x00000001

//#define _CFGEBIC_EBIRDYEN2_POSITION              0x00000019
//#define _CFGEBIC_EBIRDYEN2_MASK                  0x02000000
//#define _CFGEBIC_EBIRDYEN2_LENGTH                0x00000001

//#define _CFGEBIC_EBIRDYEN3_POSITION              0x0000001A
//#define _CFGEBIC_EBIRDYEN3_MASK                  0x04000000
//#define _CFGEBIC_EBIRDYEN3_LENGTH                0x00000001

//#define _CFGEBIC_EBIRDYINV1_POSITION             0x0000001C
//#define _CFGEBIC_EBIRDYINV1_MASK                 0x10000000
//#define _CFGEBIC_EBIRDYINV1_LENGTH               0x00000001

//#define _CFGEBIC_EBIRDYINV2_POSITION             0x0000001D
//#define _CFGEBIC_EBIRDYINV2_MASK                 0x20000000
//#define _CFGEBIC_EBIRDYINV2_LENGTH               0x00000001

//#define _CFGEBIC_EBIRDYINV3_POSITION             0x0000001E
//#define _CFGEBIC_EBIRDYINV3_MASK                 0x40000000
//#define _CFGEBIC_EBIRDYINV3_LENGTH               0x00000001

//#define _CFGPG_CPUPG_POSITION                    0x00000000
//#define _CFGPG_CPUPG_MASK                        0x00000003
//#define _CFGPG_CPUPG_LENGTH                      0x00000002

//#define _CFGPG_DMAPG_POSITION                    0x00000004
//#define _CFGPG_DMAPG_MASK                        0x00000030
//#define _CFGPG_DMAPG_LENGTH                      0x00000002

