HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CFGPG_USBPG_POSITION                    0x00000008
//#define _CFGPG_USBPG_MASK                        0x00000300
//#define _CFGPG_USBPG_LENGTH                      0x00000002

//#define _CFGPG_CAN1PG_POSITION                   0x0000000C
//#define _CFGPG_CAN1PG_MASK                       0x00003000
//#define _CFGPG_CAN1PG_LENGTH                     0x00000002

//#define _CFGPG_CAN2PG_POSITION                   0x0000000E
//#define _CFGPG_CAN2PG_MASK                       0x0000C000
//#define _CFGPG_CAN2PG_LENGTH                     0x00000002

//#define _CFGPG_ETHPG_POSITION                    0x00000010
//#define _CFGPG_ETHPG_MASK                        0x00030000
//#define _CFGPG_ETHPG_LENGTH                      0x00000002

//#define _CFGPG_SQI1PG_POSITION                   0x00000014
//#define _CFGPG_SQI1PG_MASK                       0x00300000
//#define _CFGPG_SQI1PG_LENGTH                     0x00000002

//#define _CFGPG_FCPG_POSITION                     0x00000016
//#define _CFGPG_FCPG_MASK                         0x00C00000
//#define _CFGPG_FCPG_LENGTH                       0x00000002

//#define _CFGPG_CRYPTPG_POSITION                  0x00000018
//#define _CFGPG_CRYPTPG_MASK                      0x03000000
//#define _CFGPG_CRYPTPG_LENGTH                    0x00000002

//#define _NVMCON_NVMOP_POSITION                   0x00000000
//#define _NVMCON_NVMOP_MASK                       0x0000000F
//#define _NVMCON_NVMOP_LENGTH                     0x00000004

//#define _NVMCON_SWAP_POSITION                    0x00000007
//#define _NVMCON_SWAP_MASK                        0x00000080
//#define _NVMCON_SWAP_LENGTH                      0x00000001

//#define _NVMCON_LVDERR_POSITION                  0x0000000C
//#define _NVMCON_LVDERR_MASK                      0x00001000
//#define _NVMCON_LVDERR_LENGTH                    0x00000001

//#define _NVMCON_WRERR_POSITION                   0x0000000D
//#define _NVMCON_WRERR_MASK                       0x00002000
//#define _NVMCON_WRERR_LENGTH                     0x00000001

//#define _NVMCON_WREN_POSITION                    0x0000000E
//#define _NVMCON_WREN_MASK                        0x00004000
//#define _NVMCON_WREN_LENGTH                      0x00000001

//#define _NVMCON_WR_POSITION                      0x0000000F
//#define _NVMCON_WR_MASK                          0x00008000
//#define _NVMCON_WR_LENGTH                        0x00000001

//#define _NVMCON_NVMOP0_POSITION                  0x00000000
//#define _NVMCON_NVMOP0_MASK                      0x00000001
//#define _NVMCON_NVMOP0_LENGTH                    0x00000001

//#define _NVMCON_NVMOP1_POSITION                  0x00000001
//#define _NVMCON_NVMOP1_MASK                      0x00000002
//#define _NVMCON_NVMOP1_LENGTH                    0x00000001

//#define _NVMCON_NVMOP2_POSITION                  0x00000002
//#define _NVMCON_NVMOP2_MASK                      0x00000004
//#define _NVMCON_NVMOP2_LENGTH                    0x00000001

//#define _NVMCON_NVMOP3_POSITION                  0x00000003
//#define _NVMCON_NVMOP3_MASK                      0x00000008
//#define _NVMCON_NVMOP3_LENGTH                    0x00000001

//#define _NVMCON_PROGOP_POSITION                  0x00000000
//#define _NVMCON_PROGOP_MASK                      0x0000000F
//#define _NVMCON_PROGOP_LENGTH                    0x00000004

//#define _NVMCON_PROGOP0_POSITION                 0x00000000
//#define _NVMCON_PROGOP0_MASK                     0x00000001
//#define _NVMCON_PROGOP0_LENGTH                   0x00000001

//#define _NVMCON_PROGOP1_POSITION                 0x00000001
//#define _NVMCON_PROGOP1_MASK                     0x00000002
//#define _NVMCON_PROGOP1_LENGTH                   0x00000001

//#define _NVMCON_PROGOP2_POSITION                 0x00000002
//#define _NVMCON_PROGOP2_MASK                     0x00000004
//#define _NVMCON_PROGOP2_LENGTH                   0x00000001

//#define _NVMCON_PROGOP3_POSITION                 0x00000003
//#define _NVMCON_PROGOP3_MASK                     0x00000008
//#define _NVMCON_PROGOP3_LENGTH                   0x00000001

//#define _NVMCON_w_POSITION                       0x00000000
//#define _NVMCON_w_MASK                           0xFFFFFFFF
//#define _NVMCON_w_LENGTH                         0x00000020

//#define _NVMPWP_PWP_POSITION                     0x00000000
//#define _NVMPWP_PWP_MASK                         0x00FFFFFF
//#define _NVMPWP_PWP_LENGTH                       0x00000018

//#define _NVMPWP_PWPULOCK_POSITION                0x0000001F
//#define _NVMPWP_PWPULOCK_MASK                    0x80000000
//#define _NVMPWP_PWPULOCK_LENGTH                  0x00000001

//#define _NVMBWP_UBWP0_POSITION                   0x00000000
//#define _NVMBWP_UBWP0_MASK                       0x00000001
//#define _NVMBWP_UBWP0_LENGTH                     0x00000001

//#define _NVMBWP_UBWP1_POSITION                   0x00000001
//#define _NVMBWP_UBWP1_MASK                       0x00000002
//#define _NVMBWP_UBWP1_LENGTH                     0x00000001

//#define _NVMBWP_UBWP2_POSITION                   0x00000002
//#define _NVMBWP_UBWP2_MASK                       0x00000004
//#define _NVMBWP_UBWP2_LENGTH                     0x00000001

//#define _NVMBWP_UBWP3_POSITION                   0x00000003
//#define _NVMBWP_UBWP3_MASK                       0x00000008
//#define _NVMBWP_UBWP3_LENGTH                     0x00000001

//#define _NVMBWP_UBWP4_POSITION                   0x00000004
//#define _NVMBWP_UBWP4_MASK                       0x00000010
//#define _NVMBWP_UBWP4_LENGTH                     0x00000001

//#define _NVMBWP_UBWPULOCK_POSITION               0x00000007
//#define _NVMBWP_UBWPULOCK_MASK                   0x00000080
//#define _NVMBWP_UBWPULOCK_LENGTH                 0x00000001

//#define _NVMBWP_LBWP0_POSITION                   0x00000008
//#define _NVMBWP_LBWP0_MASK                       0x00000100
//#define _NVMBWP_LBWP0_LENGTH                     0x00000001

//#define _NVMBWP_LBWP1_POSITION                   0x00000009
//#define _NVMBWP_LBWP1_MASK                       0x00000200
//#define _NVMBWP_LBWP1_LENGTH                     0x00000001

//#define _NVMBWP_LBWP2_POSITION                   0x0000000A
//#define _NVMBWP_LBWP2_MASK                       0x00000400
//#define _NVMBWP_LBWP2_LENGTH                     0x00000001

//#define _NVMBWP_LBWP3_POSITION                   0x0000000B
//#define _NVMBWP_LBWP3_MASK                       0x00000800
//#define _NVMBWP_LBWP3_LENGTH                     0x00000001

//#define _NVMBWP_LBWP4_POSITION                   0x0000000C
//#define _NVMBWP_LBWP4_MASK                       0x00001000
//#define _NVMBWP_LBWP4_LENGTH                     0x00000001

//#define _NVMBWP_LBWPULOCK_POSITION               0x0000000F
//#define _NVMBWP_LBWPULOCK_MASK                   0x00008000
//#define _NVMBWP_LBWPULOCK_LENGTH                 0x00000001

