HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ALRMTIME_w_POSITION                     0x00000000
//#define _ALRMTIME_w_MASK                         0xFFFFFFFF
//#define _ALRMTIME_w_LENGTH                       0x00000020

//#define _ALRMDATE_WDAY01_POSITION                0x00000000
//#define _ALRMDATE_WDAY01_MASK                    0x0000000F
//#define _ALRMDATE_WDAY01_LENGTH                  0x00000004

//#define _ALRMDATE_DAY01_POSITION                 0x00000008
//#define _ALRMDATE_DAY01_MASK                     0x00000F00
//#define _ALRMDATE_DAY01_LENGTH                   0x00000004

//#define _ALRMDATE_DAY10_POSITION                 0x0000000C
//#define _ALRMDATE_DAY10_MASK                     0x0000F000
//#define _ALRMDATE_DAY10_LENGTH                   0x00000004

//#define _ALRMDATE_MONTH01_POSITION               0x00000010
//#define _ALRMDATE_MONTH01_MASK                   0x000F0000
//#define _ALRMDATE_MONTH01_LENGTH                 0x00000004

//#define _ALRMDATE_MONTH10_POSITION               0x00000014
//#define _ALRMDATE_MONTH10_MASK                   0x00F00000
//#define _ALRMDATE_MONTH10_LENGTH                 0x00000004

//#define _ALRMDATE_w_POSITION                     0x00000000
//#define _ALRMDATE_w_MASK                         0xFFFFFFFF
//#define _ALRMDATE_w_LENGTH                       0x00000020

//#define _CVRCON_CVR_POSITION                     0x00000000
//#define _CVRCON_CVR_MASK                         0x0000000F
//#define _CVRCON_CVR_LENGTH                       0x00000004

//#define _CVRCON_CVRSS_POSITION                   0x00000004
//#define _CVRCON_CVRSS_MASK                       0x00000010
//#define _CVRCON_CVRSS_LENGTH                     0x00000001

//#define _CVRCON_CVRR_POSITION                    0x00000005
//#define _CVRCON_CVRR_MASK                        0x00000020
//#define _CVRCON_CVRR_LENGTH                      0x00000001

//#define _CVRCON_CVROE_POSITION                   0x00000006
//#define _CVRCON_CVROE_MASK                       0x00000040
//#define _CVRCON_CVROE_LENGTH                     0x00000001

//#define _CVRCON_ON_POSITION                      0x0000000F
//#define _CVRCON_ON_MASK                          0x00008000
//#define _CVRCON_ON_LENGTH                        0x00000001

//#define _CVRCON_CVR0_POSITION                    0x00000000
//#define _CVRCON_CVR0_MASK                        0x00000001
//#define _CVRCON_CVR0_LENGTH                      0x00000001

//#define _CVRCON_CVR1_POSITION                    0x00000001
//#define _CVRCON_CVR1_MASK                        0x00000002
//#define _CVRCON_CVR1_LENGTH                      0x00000001

//#define _CVRCON_CVR2_POSITION                    0x00000002
//#define _CVRCON_CVR2_MASK                        0x00000004
//#define _CVRCON_CVR2_LENGTH                      0x00000001

//#define _CVRCON_CVR3_POSITION                    0x00000003
//#define _CVRCON_CVR3_MASK                        0x00000008
//#define _CVRCON_CVR3_LENGTH                      0x00000001

//#define _CVRCON_w_POSITION                       0x00000000
//#define _CVRCON_w_MASK                           0xFFFFFFFF
//#define _CVRCON_w_LENGTH                         0x00000020

//#define __ICDCON_CKSWBKEN_POSITION               0x00000000
//#define __ICDCON_CKSWBKEN_MASK                   0x00000001
//#define __ICDCON_CKSWBKEN_LENGTH                 0x00000001

//#define __ICDCON_SLPBKEN_POSITION                0x00000001
//#define __ICDCON_SLPBKEN_MASK                    0x00000002
//#define __ICDCON_SLPBKEN_LENGTH                  0x00000001

//#define __ICDCON_WDTBKEN_POSITION                0x00000002
//#define __ICDCON_WDTBKEN_MASK                    0x00000004
//#define __ICDCON_WDTBKEN_LENGTH                  0x00000001

//#define __ICDCON_WDTEN_POSITION                  0x00000003
//#define __ICDCON_WDTEN_MASK                      0x00000008
//#define __ICDCON_WDTEN_LENGTH                    0x00000001

//#define __ICDCON_RSTBUG_POSITION                 0x00000004
//#define __ICDCON_RSTBUG_MASK                     0x00000010
//#define __ICDCON_RSTBUG_LENGTH                   0x00000001

//#define __ICDCON_DMTBKEN_POSITION                0x00000005
//#define __ICDCON_DMTBKEN_MASK                    0x00000020
//#define __ICDCON_DMTBKEN_LENGTH                  0x00000001

//#define __ICDCON_DMTEN_POSITION                  0x00000006
//#define __ICDCON_DMTEN_MASK                      0x00000040
//#define __ICDCON_DMTEN_LENGTH                    0x00000001

//#define __ICDCON_FRZ_POSITION                    0x0000000E
//#define __ICDCON_FRZ_MASK                        0x00004000
//#define __ICDCON_FRZ_LENGTH                      0x00000001

//#define __ICDSTAT_CKSWBF_POSITION                0x00000000
//#define __ICDSTAT_CKSWBF_MASK                    0x00000001
//#define __ICDSTAT_CKSWBF_LENGTH                  0x00000001

//#define __ICDSTAT_SLPBF_POSITION                 0x00000001
//#define __ICDSTAT_SLPBF_MASK                     0x00000002
//#define __ICDSTAT_SLPBF_LENGTH                   0x00000001

//#define __ICDSTAT_WDTBF_POSITION                 0x00000002
//#define __ICDSTAT_WDTBF_MASK                     0x00000004
//#define __ICDSTAT_WDTBF_LENGTH                   0x00000001

//#define __ICDSTAT_DMTBF_POSITION                 0x00000003
//#define __ICDSTAT_DMTBF_MASK                     0x00000008
//#define __ICDSTAT_DMTBF_LENGTH                   0x00000001

//#define _OSCCON_OSWEN_POSITION                   0x00000000
//#define _OSCCON_OSWEN_MASK                       0x00000001
//#define _OSCCON_OSWEN_LENGTH                     0x00000001

//#define _OSCCON_SOSCEN_POSITION                  0x00000001
//#define _OSCCON_SOSCEN_MASK                      0x00000002
//#define _OSCCON_SOSCEN_LENGTH                    0x00000001

//#define _OSCCON_CF_POSITION                      0x00000003
//#define _OSCCON_CF_MASK                          0x00000008
//#define _OSCCON_CF_LENGTH                        0x00000001

//#define _OSCCON_SLPEN_POSITION                   0x00000004
//#define _OSCCON_SLPEN_MASK                       0x00000010
//#define _OSCCON_SLPEN_LENGTH                     0x00000001

//#define _OSCCON_SLOCK_POSITION                   0x00000005
//#define _OSCCON_SLOCK_MASK                       0x00000020
//#define _OSCCON_SLOCK_LENGTH                     0x00000001

