HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _PB1DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB1DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB1DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB2DIV_PBDIV_POSITION                   0x00000000
//#define _PB2DIV_PBDIV_MASK                       0x0000007F
//#define _PB2DIV_PBDIV_LENGTH                     0x00000007

//#define _PB2DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB2DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB2DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB2DIV_ON_POSITION                      0x0000000F
//#define _PB2DIV_ON_MASK                          0x00008000
//#define _PB2DIV_ON_LENGTH                        0x00000001

//#define _PB3DIV_PBDIV_POSITION                   0x00000000
//#define _PB3DIV_PBDIV_MASK                       0x0000007F
//#define _PB3DIV_PBDIV_LENGTH                     0x00000007

//#define _PB3DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB3DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB3DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB3DIV_ON_POSITION                      0x0000000F
//#define _PB3DIV_ON_MASK                          0x00008000
//#define _PB3DIV_ON_LENGTH                        0x00000001

//#define _PB4DIV_PBDIV_POSITION                   0x00000000
//#define _PB4DIV_PBDIV_MASK                       0x0000007F
//#define _PB4DIV_PBDIV_LENGTH                     0x00000007

//#define _PB4DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB4DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB4DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB4DIV_ON_POSITION                      0x0000000F
//#define _PB4DIV_ON_MASK                          0x00008000
//#define _PB4DIV_ON_LENGTH                        0x00000001

//#define _PB5DIV_PBDIV_POSITION                   0x00000000
//#define _PB5DIV_PBDIV_MASK                       0x0000007F
//#define _PB5DIV_PBDIV_LENGTH                     0x00000007

//#define _PB5DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB5DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB5DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB5DIV_ON_POSITION                      0x0000000F
//#define _PB5DIV_ON_MASK                          0x00008000
//#define _PB5DIV_ON_LENGTH                        0x00000001

//#define _PB7DIV_PBDIV_POSITION                   0x00000000
//#define _PB7DIV_PBDIV_MASK                       0x0000007F
//#define _PB7DIV_PBDIV_LENGTH                     0x00000007

//#define _PB7DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB7DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB7DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB7DIV_ON_POSITION                      0x0000000F
//#define _PB7DIV_ON_MASK                          0x00008000
//#define _PB7DIV_ON_LENGTH                        0x00000001

//#define _PB8DIV_PBDIV_POSITION                   0x00000000
//#define _PB8DIV_PBDIV_MASK                       0x0000007F
//#define _PB8DIV_PBDIV_LENGTH                     0x00000007

//#define _PB8DIV_PBDIVRDY_POSITION                0x0000000B
//#define _PB8DIV_PBDIVRDY_MASK                    0x00000800
//#define _PB8DIV_PBDIVRDY_LENGTH                  0x00000001

//#define _PB8DIV_ON_POSITION                      0x0000000F
//#define _PB8DIV_ON_MASK                          0x00008000
//#define _PB8DIV_ON_LENGTH                        0x00000001

//#define _INT1R_INT1R_POSITION                    0x00000000
//#define _INT1R_INT1R_MASK                        0x0000000F
//#define _INT1R_INT1R_LENGTH                      0x00000004

//#define _INT2R_INT2R_POSITION                    0x00000000
//#define _INT2R_INT2R_MASK                        0x0000000F
//#define _INT2R_INT2R_LENGTH                      0x00000004

//#define _INT3R_INT3R_POSITION                    0x00000000
//#define _INT3R_INT3R_MASK                        0x0000000F
//#define _INT3R_INT3R_LENGTH                      0x00000004

//#define _INT4R_INT4R_POSITION                    0x00000000
//#define _INT4R_INT4R_MASK                        0x0000000F
//#define _INT4R_INT4R_LENGTH                      0x00000004

//#define _T2CKR_T2CKR_POSITION                    0x00000000
//#define _T2CKR_T2CKR_MASK                        0x0000000F
//#define _T2CKR_T2CKR_LENGTH                      0x00000004

//#define _T3CKR_T3CKR_POSITION                    0x00000000
//#define _T3CKR_T3CKR_MASK                        0x0000000F
//#define _T3CKR_T3CKR_LENGTH                      0x00000004

//#define _T4CKR_T4CKR_POSITION                    0x00000000
//#define _T4CKR_T4CKR_MASK                        0x0000000F
//#define _T4CKR_T4CKR_LENGTH                      0x00000004

//#define _T5CKR_T5CKR_POSITION                    0x00000000
//#define _T5CKR_T5CKR_MASK                        0x0000000F
//#define _T5CKR_T5CKR_LENGTH                      0x00000004

//#define _T6CKR_T6CKR_POSITION                    0x00000000
//#define _T6CKR_T6CKR_MASK                        0x0000000F
//#define _T6CKR_T6CKR_LENGTH                      0x00000004

//#define _T7CKR_T7CKR_POSITION                    0x00000000
//#define _T7CKR_T7CKR_MASK                        0x0000000F
//#define _T7CKR_T7CKR_LENGTH                      0x00000004

//#define _T8CKR_T8CKR_POSITION                    0x00000000
//#define _T8CKR_T8CKR_MASK                        0x0000000F
//#define _T8CKR_T8CKR_LENGTH                      0x00000004

//#define _T9CKR_T9CKR_POSITION                    0x00000000
//#define _T9CKR_T9CKR_MASK                        0x0000000F
//#define _T9CKR_T9CKR_LENGTH                      0x00000004

//#define _IC1R_IC1R_POSITION                      0x00000000
//#define _IC1R_IC1R_MASK                          0x0000000F
//#define _IC1R_IC1R_LENGTH                        0x00000004

//#define _IC2R_IC2R_POSITION                      0x00000000
//#define _IC2R_IC2R_MASK                          0x0000000F
//#define _IC2R_IC2R_LENGTH                        0x00000004

//#define _IC3R_IC3R_POSITION                      0x00000000
//#define _IC3R_IC3R_MASK                          0x0000000F
//#define _IC3R_IC3R_LENGTH                        0x00000004

//#define _IC4R_IC4R_POSITION                      0x00000000
//#define _IC4R_IC4R_MASK                          0x0000000F
//#define _IC4R_IC4R_LENGTH                        0x00000004

//#define _IC5R_IC5R_POSITION                      0x00000000
//#define _IC5R_IC5R_MASK                          0x0000000F
//#define _IC5R_IC5R_LENGTH                        0x00000004

//#define _IC6R_IC6R_POSITION                      0x00000000
//#define _IC6R_IC6R_MASK                          0x0000000F
//#define _IC6R_IC6R_LENGTH                        0x00000004

