HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IC7R_IC7R_POSITION                      0x00000000
//#define _IC7R_IC7R_MASK                          0x0000000F
//#define _IC7R_IC7R_LENGTH                        0x00000004

//#define _IC8R_IC8R_POSITION                      0x00000000
//#define _IC8R_IC8R_MASK                          0x0000000F
//#define _IC8R_IC8R_LENGTH                        0x00000004

//#define _IC9R_IC9R_POSITION                      0x00000000
//#define _IC9R_IC9R_MASK                          0x0000000F
//#define _IC9R_IC9R_LENGTH                        0x00000004

//#define _OCFAR_OCFAR_POSITION                    0x00000000
//#define _OCFAR_OCFAR_MASK                        0x0000000F
//#define _OCFAR_OCFAR_LENGTH                      0x00000004

//#define _U1RXR_U1RXR_POSITION                    0x00000000
//#define _U1RXR_U1RXR_MASK                        0x0000000F
//#define _U1RXR_U1RXR_LENGTH                      0x00000004

//#define _U1CTSR_U1CTSR_POSITION                  0x00000000
//#define _U1CTSR_U1CTSR_MASK                      0x0000000F
//#define _U1CTSR_U1CTSR_LENGTH                    0x00000004

//#define _U2RXR_U2RXR_POSITION                    0x00000000
//#define _U2RXR_U2RXR_MASK                        0x0000000F
//#define _U2RXR_U2RXR_LENGTH                      0x00000004

//#define _U2CTSR_U2CTSR_POSITION                  0x00000000
//#define _U2CTSR_U2CTSR_MASK                      0x0000000F
//#define _U2CTSR_U2CTSR_LENGTH                    0x00000004

//#define _U3RXR_U3RXR_POSITION                    0x00000000
//#define _U3RXR_U3RXR_MASK                        0x0000000F
//#define _U3RXR_U3RXR_LENGTH                      0x00000004

//#define _U3CTSR_U3CTSR_POSITION                  0x00000000
//#define _U3CTSR_U3CTSR_MASK                      0x0000000F
//#define _U3CTSR_U3CTSR_LENGTH                    0x00000004

//#define _U4RXR_U4RXR_POSITION                    0x00000000
//#define _U4RXR_U4RXR_MASK                        0x0000000F
//#define _U4RXR_U4RXR_LENGTH                      0x00000004

//#define _U4CTSR_U4CTSR_POSITION                  0x00000000
//#define _U4CTSR_U4CTSR_MASK                      0x0000000F
//#define _U4CTSR_U4CTSR_LENGTH                    0x00000004

//#define _U5RXR_U5RXR_POSITION                    0x00000000
//#define _U5RXR_U5RXR_MASK                        0x0000000F
//#define _U5RXR_U5RXR_LENGTH                      0x00000004

//#define _U5CTSR_U5CTSR_POSITION                  0x00000000
//#define _U5CTSR_U5CTSR_MASK                      0x0000000F
//#define _U5CTSR_U5CTSR_LENGTH                    0x00000004

//#define _U6RXR_U6RXR_POSITION                    0x00000000
//#define _U6RXR_U6RXR_MASK                        0x0000000F
//#define _U6RXR_U6RXR_LENGTH                      0x00000004

//#define _U6CTSR_U6CTSR_POSITION                  0x00000000
//#define _U6CTSR_U6CTSR_MASK                      0x0000000F
//#define _U6CTSR_U6CTSR_LENGTH                    0x00000004

//#define _SDI1R_SDI1R_POSITION                    0x00000000
//#define _SDI1R_SDI1R_MASK                        0x0000000F
//#define _SDI1R_SDI1R_LENGTH                      0x00000004

//#define _SS1R_SS1R_POSITION                      0x00000000
//#define _SS1R_SS1R_MASK                          0x0000000F
//#define _SS1R_SS1R_LENGTH                        0x00000004

//#define _SDI2R_SDI2R_POSITION                    0x00000000
//#define _SDI2R_SDI2R_MASK                        0x0000000F
//#define _SDI2R_SDI2R_LENGTH                      0x00000004

//#define _SS2R_SS2R_POSITION                      0x00000000
//#define _SS2R_SS2R_MASK                          0x0000000F
//#define _SS2R_SS2R_LENGTH                        0x00000004

//#define _SDI3R_SDI3R_POSITION                    0x00000000
//#define _SDI3R_SDI3R_MASK                        0x0000000F
//#define _SDI3R_SDI3R_LENGTH                      0x00000004

//#define _SS3R_SS3R_POSITION                      0x00000000
//#define _SS3R_SS3R_MASK                          0x0000000F
//#define _SS3R_SS3R_LENGTH                        0x00000004

//#define _SDI4R_SDI4R_POSITION                    0x00000000
//#define _SDI4R_SDI4R_MASK                        0x0000000F
//#define _SDI4R_SDI4R_LENGTH                      0x00000004

//#define _SS4R_SS4R_POSITION                      0x00000000
//#define _SS4R_SS4R_MASK                          0x0000000F
//#define _SS4R_SS4R_LENGTH                        0x00000004

//#define _SDI5R_SDI5R_POSITION                    0x00000000
//#define _SDI5R_SDI5R_MASK                        0x0000000F
//#define _SDI5R_SDI5R_LENGTH                      0x00000004

//#define _SS5R_SS5R_POSITION                      0x00000000
//#define _SS5R_SS5R_MASK                          0x0000000F
//#define _SS5R_SS5R_LENGTH                        0x00000004

//#define _SDI6R_SDI6R_POSITION                    0x00000000
//#define _SDI6R_SDI6R_MASK                        0x0000000F
//#define _SDI6R_SDI6R_LENGTH                      0x00000004

//#define _SS6R_SS6R_POSITION                      0x00000000
//#define _SS6R_SS6R_MASK                          0x0000000F
//#define _SS6R_SS6R_LENGTH                        0x00000004

//#define _C1RXR_C1RXR_POSITION                    0x00000000
//#define _C1RXR_C1RXR_MASK                        0x0000000F
//#define _C1RXR_C1RXR_LENGTH                      0x00000004

//#define _C2RXR_C2RXR_POSITION                    0x00000000
//#define _C2RXR_C2RXR_MASK                        0x0000000F
//#define _C2RXR_C2RXR_LENGTH                      0x00000004

//#define _REFCLKI1R_REFCLKI1R_POSITION            0x00000000
//#define _REFCLKI1R_REFCLKI1R_MASK                0x0000000F
//#define _REFCLKI1R_REFCLKI1R_LENGTH              0x00000004

//#define _REFCLKI3R_REFCLKI3R_POSITION            0x00000000
//#define _REFCLKI3R_REFCLKI3R_MASK                0x0000000F
//#define _REFCLKI3R_REFCLKI3R_LENGTH              0x00000004

//#define _REFCLKI4R_REFCLKI4R_POSITION            0x00000000
//#define _REFCLKI4R_REFCLKI4R_MASK                0x0000000F
//#define _REFCLKI4R_REFCLKI4R_LENGTH              0x00000004

//#define _RPA14R_RPA14R_POSITION                  0x00000000
//#define _RPA14R_RPA14R_MASK                      0x0000000F
//#define _RPA14R_RPA14R_LENGTH                    0x00000004

//#define _RPA15R_RPA15R_POSITION                  0x00000000
//#define _RPA15R_RPA15R_MASK                      0x0000000F
//#define _RPA15R_RPA15R_LENGTH                    0x00000004

//#define _RPB0R_RPB0R_POSITION                    0x00000000
//#define _RPB0R_RPB0R_MASK                        0x0000000F
//#define _RPB0R_RPB0R_LENGTH                      0x00000004

//#define _RPB1R_RPB1R_POSITION                    0x00000000
//#define _RPB1R_RPB1R_MASK                        0x0000000F
//#define _RPB1R_RPB1R_LENGTH                      0x00000004

//#define _RPB2R_RPB2R_POSITION                    0x00000000
//#define _RPB2R_RPB2R_MASK                        0x0000000F
//#define _RPB2R_RPB2R_LENGTH                      0x00000004

//#define _RPB3R_RPB3R_POSITION                    0x00000000
//#define _RPB3R_RPB3R_MASK                        0x0000000F
//#define _RPB3R_RPB3R_LENGTH                      0x00000004

