HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _RPG6R_RPG6R_POSITION                    0x00000000
//#define _RPG6R_RPG6R_MASK                        0x0000000F
//#define _RPG6R_RPG6R_LENGTH                      0x00000004

//#define _RPG7R_RPG7R_POSITION                    0x00000000
//#define _RPG7R_RPG7R_MASK                        0x0000000F
//#define _RPG7R_RPG7R_LENGTH                      0x00000004

//#define _RPG8R_RPG8R_POSITION                    0x00000000
//#define _RPG8R_RPG8R_MASK                        0x0000000F
//#define _RPG8R_RPG8R_LENGTH                      0x00000004

//#define _RPG9R_RPG9R_POSITION                    0x00000000
//#define _RPG9R_RPG9R_MASK                        0x0000000F
//#define _RPG9R_RPG9R_LENGTH                      0x00000004

//#define _INTCON_INT0EP_POSITION                  0x00000000
//#define _INTCON_INT0EP_MASK                      0x00000001
//#define _INTCON_INT0EP_LENGTH                    0x00000001

//#define _INTCON_INT1EP_POSITION                  0x00000001
//#define _INTCON_INT1EP_MASK                      0x00000002
//#define _INTCON_INT1EP_LENGTH                    0x00000001

//#define _INTCON_INT2EP_POSITION                  0x00000002
//#define _INTCON_INT2EP_MASK                      0x00000004
//#define _INTCON_INT2EP_LENGTH                    0x00000001

//#define _INTCON_INT3EP_POSITION                  0x00000003
//#define _INTCON_INT3EP_MASK                      0x00000008
//#define _INTCON_INT3EP_LENGTH                    0x00000001

//#define _INTCON_INT4EP_POSITION                  0x00000004
//#define _INTCON_INT4EP_MASK                      0x00000010
//#define _INTCON_INT4EP_LENGTH                    0x00000001

//#define _INTCON_TPC_POSITION                     0x00000008
//#define _INTCON_TPC_MASK                         0x00000700
//#define _INTCON_TPC_LENGTH                       0x00000003

//#define _INTCON_MVEC_POSITION                    0x0000000C
//#define _INTCON_MVEC_MASK                        0x00001000
//#define _INTCON_MVEC_LENGTH                      0x00000001

//#define _PRISS_SS0_POSITION                      0x00000000
//#define _PRISS_SS0_MASK                          0x00000001
//#define _PRISS_SS0_LENGTH                        0x00000001

//#define _PRISS_PRI1SS_POSITION                   0x00000004
//#define _PRISS_PRI1SS_MASK                       0x000000F0
//#define _PRISS_PRI1SS_LENGTH                     0x00000004

//#define _PRISS_PRI2SS_POSITION                   0x00000008
//#define _PRISS_PRI2SS_MASK                       0x00000F00
//#define _PRISS_PRI2SS_LENGTH                     0x00000004

//#define _PRISS_PRI3SS_POSITION                   0x0000000C
//#define _PRISS_PRI3SS_MASK                       0x0000F000
//#define _PRISS_PRI3SS_LENGTH                     0x00000004

//#define _PRISS_PRI4SS_POSITION                   0x00000010
//#define _PRISS_PRI4SS_MASK                       0x000F0000
//#define _PRISS_PRI4SS_LENGTH                     0x00000004

//#define _PRISS_PRI5SS_POSITION                   0x00000014
//#define _PRISS_PRI5SS_MASK                       0x00F00000
//#define _PRISS_PRI5SS_LENGTH                     0x00000004

//#define _PRISS_PRI6SS_POSITION                   0x00000018
//#define _PRISS_PRI6SS_MASK                       0x0F000000
//#define _PRISS_PRI6SS_LENGTH                     0x00000004

//#define _PRISS_PRI7SS_POSITION                   0x0000001C
//#define _PRISS_PRI7SS_MASK                       0xF0000000
//#define _PRISS_PRI7SS_LENGTH                     0x00000004

//#define _INTSTAT_SIRQ_POSITION                   0x00000000
//#define _INTSTAT_SIRQ_MASK                       0x000000FF
//#define _INTSTAT_SIRQ_LENGTH                     0x00000008

//#define _INTSTAT_SRIPL_POSITION                  0x00000008
//#define _INTSTAT_SRIPL_MASK                      0x00000700
//#define _INTSTAT_SRIPL_LENGTH                    0x00000003

//#define _IPTMR_IPTMR_POSITION                    0x00000000
//#define _IPTMR_IPTMR_MASK                        0xFFFFFFFF
//#define _IPTMR_IPTMR_LENGTH                      0x00000020

//#define _IFS0_CTIF_POSITION                      0x00000000
//#define _IFS0_CTIF_MASK                          0x00000001
//#define _IFS0_CTIF_LENGTH                        0x00000001

//#define _IFS0_CS0IF_POSITION                     0x00000001
//#define _IFS0_CS0IF_MASK                         0x00000002
//#define _IFS0_CS0IF_LENGTH                       0x00000001

//#define _IFS0_CS1IF_POSITION                     0x00000002
//#define _IFS0_CS1IF_MASK                         0x00000004
//#define _IFS0_CS1IF_LENGTH                       0x00000001

//#define _IFS0_INT0IF_POSITION                    0x00000003
//#define _IFS0_INT0IF_MASK                        0x00000008
//#define _IFS0_INT0IF_LENGTH                      0x00000001

//#define _IFS0_T1IF_POSITION                      0x00000004
//#define _IFS0_T1IF_MASK                          0x00000010
//#define _IFS0_T1IF_LENGTH                        0x00000001

//#define _IFS0_IC1EIF_POSITION                    0x00000005
//#define _IFS0_IC1EIF_MASK                        0x00000020
//#define _IFS0_IC1EIF_LENGTH                      0x00000001

//#define _IFS0_IC1IF_POSITION                     0x00000006
//#define _IFS0_IC1IF_MASK                         0x00000040
//#define _IFS0_IC1IF_LENGTH                       0x00000001

//#define _IFS0_OC1IF_POSITION                     0x00000007
//#define _IFS0_OC1IF_MASK                         0x00000080
//#define _IFS0_OC1IF_LENGTH                       0x00000001

//#define _IFS0_INT1IF_POSITION                    0x00000008
//#define _IFS0_INT1IF_MASK                        0x00000100
//#define _IFS0_INT1IF_LENGTH                      0x00000001

//#define _IFS0_T2IF_POSITION                      0x00000009
//#define _IFS0_T2IF_MASK                          0x00000200
//#define _IFS0_T2IF_LENGTH                        0x00000001

//#define _IFS0_IC2EIF_POSITION                    0x0000000A
//#define _IFS0_IC2EIF_MASK                        0x00000400
//#define _IFS0_IC2EIF_LENGTH                      0x00000001

//#define _IFS0_IC2IF_POSITION                     0x0000000B
//#define _IFS0_IC2IF_MASK                         0x00000800
//#define _IFS0_IC2IF_LENGTH                       0x00000001

//#define _IFS0_OC2IF_POSITION                     0x0000000C
//#define _IFS0_OC2IF_MASK                         0x00001000
//#define _IFS0_OC2IF_LENGTH                       0x00000001

