HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IFS4_PMPIF_POSITION                     0x00000000
//#define _IFS4_PMPIF_MASK                         0x00000001
//#define _IFS4_PMPIF_LENGTH                       0x00000001

//#define _IFS4_PMPEIF_POSITION                    0x00000001
//#define _IFS4_PMPEIF_MASK                        0x00000002
//#define _IFS4_PMPEIF_LENGTH                      0x00000001

//#define _IFS4_CMP1IF_POSITION                    0x00000002
//#define _IFS4_CMP1IF_MASK                        0x00000004
//#define _IFS4_CMP1IF_LENGTH                      0x00000001

//#define _IFS4_CMP2IF_POSITION                    0x00000003
//#define _IFS4_CMP2IF_MASK                        0x00000008
//#define _IFS4_CMP2IF_LENGTH                      0x00000001

//#define _IFS4_USBIF_POSITION                     0x00000004
//#define _IFS4_USBIF_MASK                         0x00000010
//#define _IFS4_USBIF_LENGTH                       0x00000001

//#define _IFS4_USBDMAIF_POSITION                  0x00000005
//#define _IFS4_USBDMAIF_MASK                      0x00000020
//#define _IFS4_USBDMAIF_LENGTH                    0x00000001

//#define _IFS4_DMA0IF_POSITION                    0x00000006
//#define _IFS4_DMA0IF_MASK                        0x00000040
//#define _IFS4_DMA0IF_LENGTH                      0x00000001

//#define _IFS4_DMA1IF_POSITION                    0x00000007
//#define _IFS4_DMA1IF_MASK                        0x00000080
//#define _IFS4_DMA1IF_LENGTH                      0x00000001

//#define _IFS4_DMA2IF_POSITION                    0x00000008
//#define _IFS4_DMA2IF_MASK                        0x00000100
//#define _IFS4_DMA2IF_LENGTH                      0x00000001

//#define _IFS4_DMA3IF_POSITION                    0x00000009
//#define _IFS4_DMA3IF_MASK                        0x00000200
//#define _IFS4_DMA3IF_LENGTH                      0x00000001

//#define _IFS4_DMA4IF_POSITION                    0x0000000A
//#define _IFS4_DMA4IF_MASK                        0x00000400
//#define _IFS4_DMA4IF_LENGTH                      0x00000001

//#define _IFS4_DMA5IF_POSITION                    0x0000000B
//#define _IFS4_DMA5IF_MASK                        0x00000800
//#define _IFS4_DMA5IF_LENGTH                      0x00000001

//#define _IFS4_DMA6IF_POSITION                    0x0000000C
//#define _IFS4_DMA6IF_MASK                        0x00001000
//#define _IFS4_DMA6IF_LENGTH                      0x00000001

//#define _IFS4_DMA7IF_POSITION                    0x0000000D
//#define _IFS4_DMA7IF_MASK                        0x00002000
//#define _IFS4_DMA7IF_LENGTH                      0x00000001

//#define _IFS4_SPI2EIF_POSITION                   0x0000000E
//#define _IFS4_SPI2EIF_MASK                       0x00004000
//#define _IFS4_SPI2EIF_LENGTH                     0x00000001

//#define _IFS4_SPI2RXIF_POSITION                  0x0000000F
//#define _IFS4_SPI2RXIF_MASK                      0x00008000
//#define _IFS4_SPI2RXIF_LENGTH                    0x00000001

//#define _IFS4_SPI2TXIF_POSITION                  0x00000010
//#define _IFS4_SPI2TXIF_MASK                      0x00010000
//#define _IFS4_SPI2TXIF_LENGTH                    0x00000001

//#define _IFS4_U2EIF_POSITION                     0x00000011
//#define _IFS4_U2EIF_MASK                         0x00020000
//#define _IFS4_U2EIF_LENGTH                       0x00000001

//#define _IFS4_U2RXIF_POSITION                    0x00000012
//#define _IFS4_U2RXIF_MASK                        0x00040000
//#define _IFS4_U2RXIF_LENGTH                      0x00000001

//#define _IFS4_U2TXIF_POSITION                    0x00000013
//#define _IFS4_U2TXIF_MASK                        0x00080000
//#define _IFS4_U2TXIF_LENGTH                      0x00000001

//#define _IFS4_I2C2BIF_POSITION                   0x00000014
//#define _IFS4_I2C2BIF_MASK                       0x00100000
//#define _IFS4_I2C2BIF_LENGTH                     0x00000001

//#define _IFS4_I2C2SIF_POSITION                   0x00000015
//#define _IFS4_I2C2SIF_MASK                       0x00200000
//#define _IFS4_I2C2SIF_LENGTH                     0x00000001

//#define _IFS4_I2C2MIF_POSITION                   0x00000016
//#define _IFS4_I2C2MIF_MASK                       0x00400000
//#define _IFS4_I2C2MIF_LENGTH                     0x00000001

//#define _IFS4_CAN1IF_POSITION                    0x00000017
//#define _IFS4_CAN1IF_MASK                        0x00800000
//#define _IFS4_CAN1IF_LENGTH                      0x00000001

//#define _IFS4_CAN2IF_POSITION                    0x00000018
//#define _IFS4_CAN2IF_MASK                        0x01000000
//#define _IFS4_CAN2IF_LENGTH                      0x00000001

//#define _IFS4_ETHIF_POSITION                     0x00000019
//#define _IFS4_ETHIF_MASK                         0x02000000
//#define _IFS4_ETHIF_LENGTH                       0x00000001

//#define _IFS4_SPI3EIF_POSITION                   0x0000001A
//#define _IFS4_SPI3EIF_MASK                       0x04000000
//#define _IFS4_SPI3EIF_LENGTH                     0x00000001

//#define _IFS4_SPI3RXIF_POSITION                  0x0000001B
//#define _IFS4_SPI3RXIF_MASK                      0x08000000
//#define _IFS4_SPI3RXIF_LENGTH                    0x00000001

//#define _IFS4_SPI3TXIF_POSITION                  0x0000001C
//#define _IFS4_SPI3TXIF_MASK                      0x10000000
//#define _IFS4_SPI3TXIF_LENGTH                    0x00000001

//#define _IFS4_U3EIF_POSITION                     0x0000001D
//#define _IFS4_U3EIF_MASK                         0x20000000
//#define _IFS4_U3EIF_LENGTH                       0x00000001

//#define _IFS4_U3RXIF_POSITION                    0x0000001E
//#define _IFS4_U3RXIF_MASK                        0x40000000
//#define _IFS4_U3RXIF_LENGTH                      0x00000001

//#define _IFS4_U3TXIF_POSITION                    0x0000001F
//#define _IFS4_U3TXIF_MASK                        0x80000000
//#define _IFS4_U3TXIF_LENGTH                      0x00000001

//#define _IFS4_w_POSITION                         0x00000000
//#define _IFS4_w_MASK                             0xFFFFFFFF
//#define _IFS4_w_LENGTH                           0x00000020

//#define _IFS5_I2C3BIF_POSITION                   0x00000000
//#define _IFS5_I2C3BIF_MASK                       0x00000001
//#define _IFS5_I2C3BIF_LENGTH                     0x00000001

//#define _IFS5_I2C3SIF_POSITION                   0x00000001
//#define _IFS5_I2C3SIF_MASK                       0x00000002
//#define _IFS5_I2C3SIF_LENGTH                     0x00000001

//#define _IFS5_I2C3MIF_POSITION                   0x00000002
//#define _IFS5_I2C3MIF_MASK                       0x00000004
//#define _IFS5_I2C3MIF_LENGTH                     0x00000001

