HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IEC0_T1IE_POSITION                      0x00000004
//#define _IEC0_T1IE_MASK                          0x00000010
//#define _IEC0_T1IE_LENGTH                        0x00000001

//#define _IEC0_IC1EIE_POSITION                    0x00000005
//#define _IEC0_IC1EIE_MASK                        0x00000020
//#define _IEC0_IC1EIE_LENGTH                      0x00000001

//#define _IEC0_IC1IE_POSITION                     0x00000006
//#define _IEC0_IC1IE_MASK                         0x00000040
//#define _IEC0_IC1IE_LENGTH                       0x00000001

//#define _IEC0_OC1IE_POSITION                     0x00000007
//#define _IEC0_OC1IE_MASK                         0x00000080
//#define _IEC0_OC1IE_LENGTH                       0x00000001

//#define _IEC0_INT1IE_POSITION                    0x00000008
//#define _IEC0_INT1IE_MASK                        0x00000100
//#define _IEC0_INT1IE_LENGTH                      0x00000001

//#define _IEC0_T2IE_POSITION                      0x00000009
//#define _IEC0_T2IE_MASK                          0x00000200
//#define _IEC0_T2IE_LENGTH                        0x00000001

//#define _IEC0_IC2EIE_POSITION                    0x0000000A
//#define _IEC0_IC2EIE_MASK                        0x00000400
//#define _IEC0_IC2EIE_LENGTH                      0x00000001

//#define _IEC0_IC2IE_POSITION                     0x0000000B
//#define _IEC0_IC2IE_MASK                         0x00000800
//#define _IEC0_IC2IE_LENGTH                       0x00000001

//#define _IEC0_OC2IE_POSITION                     0x0000000C
//#define _IEC0_OC2IE_MASK                         0x00001000
//#define _IEC0_OC2IE_LENGTH                       0x00000001

//#define _IEC0_INT2IE_POSITION                    0x0000000D
//#define _IEC0_INT2IE_MASK                        0x00002000
//#define _IEC0_INT2IE_LENGTH                      0x00000001

//#define _IEC0_T3IE_POSITION                      0x0000000E
//#define _IEC0_T3IE_MASK                          0x00004000
//#define _IEC0_T3IE_LENGTH                        0x00000001

//#define _IEC0_IC3EIE_POSITION                    0x0000000F
//#define _IEC0_IC3EIE_MASK                        0x00008000
//#define _IEC0_IC3EIE_LENGTH                      0x00000001

//#define _IEC0_IC3IE_POSITION                     0x00000010
//#define _IEC0_IC3IE_MASK                         0x00010000
//#define _IEC0_IC3IE_LENGTH                       0x00000001

//#define _IEC0_OC3IE_POSITION                     0x00000011
//#define _IEC0_OC3IE_MASK                         0x00020000
//#define _IEC0_OC3IE_LENGTH                       0x00000001

//#define _IEC0_INT3IE_POSITION                    0x00000012
//#define _IEC0_INT3IE_MASK                        0x00040000
//#define _IEC0_INT3IE_LENGTH                      0x00000001

//#define _IEC0_T4IE_POSITION                      0x00000013
//#define _IEC0_T4IE_MASK                          0x00080000
//#define _IEC0_T4IE_LENGTH                        0x00000001

//#define _IEC0_IC4EIE_POSITION                    0x00000014
//#define _IEC0_IC4EIE_MASK                        0x00100000
//#define _IEC0_IC4EIE_LENGTH                      0x00000001

//#define _IEC0_IC4IE_POSITION                     0x00000015
//#define _IEC0_IC4IE_MASK                         0x00200000
//#define _IEC0_IC4IE_LENGTH                       0x00000001

//#define _IEC0_OC4IE_POSITION                     0x00000016
//#define _IEC0_OC4IE_MASK                         0x00400000
//#define _IEC0_OC4IE_LENGTH                       0x00000001

//#define _IEC0_INT4IE_POSITION                    0x00000017
//#define _IEC0_INT4IE_MASK                        0x00800000
//#define _IEC0_INT4IE_LENGTH                      0x00000001

//#define _IEC0_T5IE_POSITION                      0x00000018
//#define _IEC0_T5IE_MASK                          0x01000000
//#define _IEC0_T5IE_LENGTH                        0x00000001

//#define _IEC0_IC5EIE_POSITION                    0x00000019
//#define _IEC0_IC5EIE_MASK                        0x02000000
//#define _IEC0_IC5EIE_LENGTH                      0x00000001

//#define _IEC0_IC5IE_POSITION                     0x0000001A
//#define _IEC0_IC5IE_MASK                         0x04000000
//#define _IEC0_IC5IE_LENGTH                       0x00000001

//#define _IEC0_OC5IE_POSITION                     0x0000001B
//#define _IEC0_OC5IE_MASK                         0x08000000
//#define _IEC0_OC5IE_LENGTH                       0x00000001

//#define _IEC0_T6IE_POSITION                      0x0000001C
//#define _IEC0_T6IE_MASK                          0x10000000
//#define _IEC0_T6IE_LENGTH                        0x00000001

//#define _IEC0_IC6EIE_POSITION                    0x0000001D
//#define _IEC0_IC6EIE_MASK                        0x20000000
//#define _IEC0_IC6EIE_LENGTH                      0x00000001

//#define _IEC0_IC6IE_POSITION                     0x0000001E
//#define _IEC0_IC6IE_MASK                         0x40000000
//#define _IEC0_IC6IE_LENGTH                       0x00000001

//#define _IEC0_OC6IE_POSITION                     0x0000001F
//#define _IEC0_OC6IE_MASK                         0x80000000
//#define _IEC0_OC6IE_LENGTH                       0x00000001

//#define _IEC0_w_POSITION                         0x00000000
//#define _IEC0_w_MASK                             0xFFFFFFFF
//#define _IEC0_w_LENGTH                           0x00000020

//#define _IEC1_T7IE_POSITION                      0x00000000
//#define _IEC1_T7IE_MASK                          0x00000001
//#define _IEC1_T7IE_LENGTH                        0x00000001

//#define _IEC1_IC7EIE_POSITION                    0x00000001
//#define _IEC1_IC7EIE_MASK                        0x00000002
//#define _IEC1_IC7EIE_LENGTH                      0x00000001

//#define _IEC1_IC7IE_POSITION                     0x00000002
//#define _IEC1_IC7IE_MASK                         0x00000004
//#define _IEC1_IC7IE_LENGTH                       0x00000001

//#define _IEC1_OC7IE_POSITION                     0x00000003
//#define _IEC1_OC7IE_MASK                         0x00000008
//#define _IEC1_OC7IE_LENGTH                       0x00000001

//#define _IEC1_T8IE_POSITION                      0x00000004
//#define _IEC1_T8IE_MASK                          0x00000010
//#define _IEC1_T8IE_LENGTH                        0x00000001

