HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IEC1_IC8EIE_POSITION                    0x00000005
//#define _IEC1_IC8EIE_MASK                        0x00000020
//#define _IEC1_IC8EIE_LENGTH                      0x00000001

//#define _IEC1_IC8IE_POSITION                     0x00000006
//#define _IEC1_IC8IE_MASK                         0x00000040
//#define _IEC1_IC8IE_LENGTH                       0x00000001

//#define _IEC1_OC8IE_POSITION                     0x00000007
//#define _IEC1_OC8IE_MASK                         0x00000080
//#define _IEC1_OC8IE_LENGTH                       0x00000001

//#define _IEC1_T9IE_POSITION                      0x00000008
//#define _IEC1_T9IE_MASK                          0x00000100
//#define _IEC1_T9IE_LENGTH                        0x00000001

//#define _IEC1_IC9EIE_POSITION                    0x00000009
//#define _IEC1_IC9EIE_MASK                        0x00000200
//#define _IEC1_IC9EIE_LENGTH                      0x00000001

//#define _IEC1_IC9IE_POSITION                     0x0000000A
//#define _IEC1_IC9IE_MASK                         0x00000400
//#define _IEC1_IC9IE_LENGTH                       0x00000001

//#define _IEC1_OC9IE_POSITION                     0x0000000B
//#define _IEC1_OC9IE_MASK                         0x00000800
//#define _IEC1_OC9IE_LENGTH                       0x00000001

//#define _IEC1_AD1IE_POSITION                     0x0000000C
//#define _IEC1_AD1IE_MASK                         0x00001000
//#define _IEC1_AD1IE_LENGTH                       0x00000001

//#define _IEC1_AD1DC1IE_POSITION                  0x0000000E
//#define _IEC1_AD1DC1IE_MASK                      0x00004000
//#define _IEC1_AD1DC1IE_LENGTH                    0x00000001

//#define _IEC1_AD1DC2IE_POSITION                  0x0000000F
//#define _IEC1_AD1DC2IE_MASK                      0x00008000
//#define _IEC1_AD1DC2IE_LENGTH                    0x00000001

//#define _IEC1_AD1DC3IE_POSITION                  0x00000010
//#define _IEC1_AD1DC3IE_MASK                      0x00010000
//#define _IEC1_AD1DC3IE_LENGTH                    0x00000001

//#define _IEC1_AD1DC4IE_POSITION                  0x00000011
//#define _IEC1_AD1DC4IE_MASK                      0x00020000
//#define _IEC1_AD1DC4IE_LENGTH                    0x00000001

//#define _IEC1_AD1DC5IE_POSITION                  0x00000012
//#define _IEC1_AD1DC5IE_MASK                      0x00040000
//#define _IEC1_AD1DC5IE_LENGTH                    0x00000001

//#define _IEC1_AD1DC6IE_POSITION                  0x00000013
//#define _IEC1_AD1DC6IE_MASK                      0x00080000
//#define _IEC1_AD1DC6IE_LENGTH                    0x00000001

//#define _IEC1_AD1DF1IE_POSITION                  0x00000014
//#define _IEC1_AD1DF1IE_MASK                      0x00100000
//#define _IEC1_AD1DF1IE_LENGTH                    0x00000001

//#define _IEC1_AD1DF2IE_POSITION                  0x00000015
//#define _IEC1_AD1DF2IE_MASK                      0x00200000
//#define _IEC1_AD1DF2IE_LENGTH                    0x00000001

//#define _IEC1_AD1DF3IE_POSITION                  0x00000016
//#define _IEC1_AD1DF3IE_MASK                      0x00400000
//#define _IEC1_AD1DF3IE_LENGTH                    0x00000001

//#define _IEC1_AD1DF4IE_POSITION                  0x00000017
//#define _IEC1_AD1DF4IE_MASK                      0x00800000
//#define _IEC1_AD1DF4IE_LENGTH                    0x00000001

//#define _IEC1_AD1DF5IE_POSITION                  0x00000018
//#define _IEC1_AD1DF5IE_MASK                      0x01000000
//#define _IEC1_AD1DF5IE_LENGTH                    0x00000001

//#define _IEC1_AD1DF6IE_POSITION                  0x00000019
//#define _IEC1_AD1DF6IE_MASK                      0x02000000
//#define _IEC1_AD1DF6IE_LENGTH                    0x00000001

//#define _IEC1_AD1D0IE_POSITION                   0x0000001B
//#define _IEC1_AD1D0IE_MASK                       0x08000000
//#define _IEC1_AD1D0IE_LENGTH                     0x00000001

//#define _IEC1_AD1D1IE_POSITION                   0x0000001C
//#define _IEC1_AD1D1IE_MASK                       0x10000000
//#define _IEC1_AD1D1IE_LENGTH                     0x00000001

//#define _IEC1_AD1D2IE_POSITION                   0x0000001D
//#define _IEC1_AD1D2IE_MASK                       0x20000000
//#define _IEC1_AD1D2IE_LENGTH                     0x00000001

//#define _IEC1_AD1D3IE_POSITION                   0x0000001E
//#define _IEC1_AD1D3IE_MASK                       0x40000000
//#define _IEC1_AD1D3IE_LENGTH                     0x00000001

//#define _IEC1_AD1D4IE_POSITION                   0x0000001F
//#define _IEC1_AD1D4IE_MASK                       0x80000000
//#define _IEC1_AD1D4IE_LENGTH                     0x00000001

//#define _IEC1_w_POSITION                         0x00000000
//#define _IEC1_w_MASK                             0xFFFFFFFF
//#define _IEC1_w_LENGTH                           0x00000020

//#define _IEC2_AD1D5IE_POSITION                   0x00000000
//#define _IEC2_AD1D5IE_MASK                       0x00000001
//#define _IEC2_AD1D5IE_LENGTH                     0x00000001

//#define _IEC2_AD1D6IE_POSITION                   0x00000001
//#define _IEC2_AD1D6IE_MASK                       0x00000002
//#define _IEC2_AD1D6IE_LENGTH                     0x00000001

//#define _IEC2_AD1D7IE_POSITION                   0x00000002
//#define _IEC2_AD1D7IE_MASK                       0x00000004
//#define _IEC2_AD1D7IE_LENGTH                     0x00000001

//#define _IEC2_AD1D8IE_POSITION                   0x00000003
//#define _IEC2_AD1D8IE_MASK                       0x00000008
//#define _IEC2_AD1D8IE_LENGTH                     0x00000001

//#define _IEC2_AD1D9IE_POSITION                   0x00000004
//#define _IEC2_AD1D9IE_MASK                       0x00000010
//#define _IEC2_AD1D9IE_LENGTH                     0x00000001

//#define _IEC2_AD1D10IE_POSITION                  0x00000005
//#define _IEC2_AD1D10IE_MASK                      0x00000020
//#define _IEC2_AD1D10IE_LENGTH                    0x00000001

//#define _IEC2_AD1D11IE_POSITION                  0x00000006
//#define _IEC2_AD1D11IE_MASK                      0x00000040
//#define _IEC2_AD1D11IE_LENGTH                    0x00000001

//#define _IEC2_AD1D12IE_POSITION                  0x00000007
//#define _IEC2_AD1D12IE_MASK                      0x00000080
//#define _IEC2_AD1D12IE_LENGTH                    0x00000001

