HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IEC2_AD1D13IE_POSITION                  0x00000008
//#define _IEC2_AD1D13IE_MASK                      0x00000100
//#define _IEC2_AD1D13IE_LENGTH                    0x00000001

//#define _IEC2_AD1D14IE_POSITION                  0x00000009
//#define _IEC2_AD1D14IE_MASK                      0x00000200
//#define _IEC2_AD1D14IE_LENGTH                    0x00000001

//#define _IEC2_AD1D15IE_POSITION                  0x0000000A
//#define _IEC2_AD1D15IE_MASK                      0x00000400
//#define _IEC2_AD1D15IE_LENGTH                    0x00000001

//#define _IEC2_AD1D16IE_POSITION                  0x0000000B
//#define _IEC2_AD1D16IE_MASK                      0x00000800
//#define _IEC2_AD1D16IE_LENGTH                    0x00000001

//#define _IEC2_AD1D17IE_POSITION                  0x0000000C
//#define _IEC2_AD1D17IE_MASK                      0x00001000
//#define _IEC2_AD1D17IE_LENGTH                    0x00000001

//#define _IEC2_AD1D18IE_POSITION                  0x0000000D
//#define _IEC2_AD1D18IE_MASK                      0x00002000
//#define _IEC2_AD1D18IE_LENGTH                    0x00000001

//#define _IEC2_AD1D19IE_POSITION                  0x0000000E
//#define _IEC2_AD1D19IE_MASK                      0x00004000
//#define _IEC2_AD1D19IE_LENGTH                    0x00000001

//#define _IEC2_AD1D20IE_POSITION                  0x0000000F
//#define _IEC2_AD1D20IE_MASK                      0x00008000
//#define _IEC2_AD1D20IE_LENGTH                    0x00000001

//#define _IEC2_AD1D21IE_POSITION                  0x00000010
//#define _IEC2_AD1D21IE_MASK                      0x00010000
//#define _IEC2_AD1D21IE_LENGTH                    0x00000001

//#define _IEC2_AD1D22IE_POSITION                  0x00000011
//#define _IEC2_AD1D22IE_MASK                      0x00020000
//#define _IEC2_AD1D22IE_LENGTH                    0x00000001

//#define _IEC2_AD1D23IE_POSITION                  0x00000012
//#define _IEC2_AD1D23IE_MASK                      0x00040000
//#define _IEC2_AD1D23IE_LENGTH                    0x00000001

//#define _IEC2_AD1D24IE_POSITION                  0x00000013
//#define _IEC2_AD1D24IE_MASK                      0x00080000
//#define _IEC2_AD1D24IE_LENGTH                    0x00000001

//#define _IEC2_AD1D25IE_POSITION                  0x00000014
//#define _IEC2_AD1D25IE_MASK                      0x00100000
//#define _IEC2_AD1D25IE_LENGTH                    0x00000001

//#define _IEC2_AD1D26IE_POSITION                  0x00000015
//#define _IEC2_AD1D26IE_MASK                      0x00200000
//#define _IEC2_AD1D26IE_LENGTH                    0x00000001

//#define _IEC2_AD1D27IE_POSITION                  0x00000016
//#define _IEC2_AD1D27IE_MASK                      0x00400000
//#define _IEC2_AD1D27IE_LENGTH                    0x00000001

//#define _IEC2_AD1D28IE_POSITION                  0x00000017
//#define _IEC2_AD1D28IE_MASK                      0x00800000
//#define _IEC2_AD1D28IE_LENGTH                    0x00000001

//#define _IEC2_AD1D29IE_POSITION                  0x00000018
//#define _IEC2_AD1D29IE_MASK                      0x01000000
//#define _IEC2_AD1D29IE_LENGTH                    0x00000001

//#define _IEC2_AD1D30IE_POSITION                  0x00000019
//#define _IEC2_AD1D30IE_MASK                      0x02000000
//#define _IEC2_AD1D30IE_LENGTH                    0x00000001

//#define _IEC2_AD1D31IE_POSITION                  0x0000001A
//#define _IEC2_AD1D31IE_MASK                      0x04000000
//#define _IEC2_AD1D31IE_LENGTH                    0x00000001

//#define _IEC2_AD1D32IE_POSITION                  0x0000001B
//#define _IEC2_AD1D32IE_MASK                      0x08000000
//#define _IEC2_AD1D32IE_LENGTH                    0x00000001

//#define _IEC2_AD1D33IE_POSITION                  0x0000001C
//#define _IEC2_AD1D33IE_MASK                      0x10000000
//#define _IEC2_AD1D33IE_LENGTH                    0x00000001

//#define _IEC2_AD1D34IE_POSITION                  0x0000001D
//#define _IEC2_AD1D34IE_MASK                      0x20000000
//#define _IEC2_AD1D34IE_LENGTH                    0x00000001

//#define _IEC2_w_POSITION                         0x00000000
//#define _IEC2_w_MASK                             0xFFFFFFFF
//#define _IEC2_w_LENGTH                           0x00000020

//#define _IEC3_AD1D43IE_POSITION                  0x00000006
//#define _IEC3_AD1D43IE_MASK                      0x00000040
//#define _IEC3_AD1D43IE_LENGTH                    0x00000001

//#define _IEC3_AD1D44IE_POSITION                  0x00000007
//#define _IEC3_AD1D44IE_MASK                      0x00000080
//#define _IEC3_AD1D44IE_LENGTH                    0x00000001

//#define _IEC3_CPCIE_POSITION                     0x00000008
//#define _IEC3_CPCIE_MASK                         0x00000100
//#define _IEC3_CPCIE_LENGTH                       0x00000001

//#define _IEC3_CFDCIE_POSITION                    0x00000009
//#define _IEC3_CFDCIE_MASK                        0x00000200
//#define _IEC3_CFDCIE_LENGTH                      0x00000001

//#define _IEC3_SBIE_POSITION                      0x0000000A
//#define _IEC3_SBIE_MASK                          0x00000400
//#define _IEC3_SBIE_LENGTH                        0x00000001

//#define _IEC3_CRPTIE_POSITION                    0x0000000B
//#define _IEC3_CRPTIE_MASK                        0x00000800
//#define _IEC3_CRPTIE_LENGTH                      0x00000001

//#define _IEC3_SPI1EIE_POSITION                   0x0000000D
//#define _IEC3_SPI1EIE_MASK                       0x00002000
//#define _IEC3_SPI1EIE_LENGTH                     0x00000001

//#define _IEC3_SPI1RXIE_POSITION                  0x0000000E
//#define _IEC3_SPI1RXIE_MASK                      0x00004000
//#define _IEC3_SPI1RXIE_LENGTH                    0x00000001

//#define _IEC3_SPI1TXIE_POSITION                  0x0000000F
//#define _IEC3_SPI1TXIE_MASK                      0x00008000
//#define _IEC3_SPI1TXIE_LENGTH                    0x00000001

//#define _IEC3_U1EIE_POSITION                     0x00000010
//#define _IEC3_U1EIE_MASK                         0x00010000
//#define _IEC3_U1EIE_LENGTH                       0x00000001

//#define _IEC3_U1RXIE_POSITION                    0x00000011
//#define _IEC3_U1RXIE_MASK                        0x00020000
//#define _IEC3_U1RXIE_LENGTH                      0x00000001

