HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IPC6_w_POSITION                         0x00000000
//#define _IPC6_w_MASK                             0xFFFFFFFF
//#define _IPC6_w_LENGTH                           0x00000020

//#define _IPC7_T6IS_POSITION                      0x00000000
//#define _IPC7_T6IS_MASK                          0x00000003
//#define _IPC7_T6IS_LENGTH                        0x00000002

//#define _IPC7_T6IP_POSITION                      0x00000002
//#define _IPC7_T6IP_MASK                          0x0000001C
//#define _IPC7_T6IP_LENGTH                        0x00000003

//#define _IPC7_IC6EIS_POSITION                    0x00000008
//#define _IPC7_IC6EIS_MASK                        0x00000300
//#define _IPC7_IC6EIS_LENGTH                      0x00000002

//#define _IPC7_IC6EIP_POSITION                    0x0000000A
//#define _IPC7_IC6EIP_MASK                        0x00001C00
//#define _IPC7_IC6EIP_LENGTH                      0x00000003

//#define _IPC7_IC6IS_POSITION                     0x00000010
//#define _IPC7_IC6IS_MASK                         0x00030000
//#define _IPC7_IC6IS_LENGTH                       0x00000002

//#define _IPC7_IC6IP_POSITION                     0x00000012
//#define _IPC7_IC6IP_MASK                         0x001C0000
//#define _IPC7_IC6IP_LENGTH                       0x00000003

//#define _IPC7_OC6IS_POSITION                     0x00000018
//#define _IPC7_OC6IS_MASK                         0x03000000
//#define _IPC7_OC6IS_LENGTH                       0x00000002

//#define _IPC7_OC6IP_POSITION                     0x0000001A
//#define _IPC7_OC6IP_MASK                         0x1C000000
//#define _IPC7_OC6IP_LENGTH                       0x00000003

//#define _IPC7_w_POSITION                         0x00000000
//#define _IPC7_w_MASK                             0xFFFFFFFF
//#define _IPC7_w_LENGTH                           0x00000020

//#define _IPC8_T7IS_POSITION                      0x00000000
//#define _IPC8_T7IS_MASK                          0x00000003
//#define _IPC8_T7IS_LENGTH                        0x00000002

//#define _IPC8_T7IP_POSITION                      0x00000002
//#define _IPC8_T7IP_MASK                          0x0000001C
//#define _IPC8_T7IP_LENGTH                        0x00000003

//#define _IPC8_IC7EIS_POSITION                    0x00000008
//#define _IPC8_IC7EIS_MASK                        0x00000300
//#define _IPC8_IC7EIS_LENGTH                      0x00000002

//#define _IPC8_IC7EIP_POSITION                    0x0000000A
//#define _IPC8_IC7EIP_MASK                        0x00001C00
//#define _IPC8_IC7EIP_LENGTH                      0x00000003

//#define _IPC8_IC7IS_POSITION                     0x00000010
//#define _IPC8_IC7IS_MASK                         0x00030000
//#define _IPC8_IC7IS_LENGTH                       0x00000002

//#define _IPC8_IC7IP_POSITION                     0x00000012
//#define _IPC8_IC7IP_MASK                         0x001C0000
//#define _IPC8_IC7IP_LENGTH                       0x00000003

//#define _IPC8_OC7IS_POSITION                     0x00000018
//#define _IPC8_OC7IS_MASK                         0x03000000
//#define _IPC8_OC7IS_LENGTH                       0x00000002

//#define _IPC8_OC7IP_POSITION                     0x0000001A
//#define _IPC8_OC7IP_MASK                         0x1C000000
//#define _IPC8_OC7IP_LENGTH                       0x00000003

//#define _IPC8_w_POSITION                         0x00000000
//#define _IPC8_w_MASK                             0xFFFFFFFF
//#define _IPC8_w_LENGTH                           0x00000020

//#define _IPC9_T8IS_POSITION                      0x00000000
//#define _IPC9_T8IS_MASK                          0x00000003
//#define _IPC9_T8IS_LENGTH                        0x00000002

//#define _IPC9_T8IP_POSITION                      0x00000002
//#define _IPC9_T8IP_MASK                          0x0000001C
//#define _IPC9_T8IP_LENGTH                        0x00000003

//#define _IPC9_IC8EIS_POSITION                    0x00000008
//#define _IPC9_IC8EIS_MASK                        0x00000300
//#define _IPC9_IC8EIS_LENGTH                      0x00000002

//#define _IPC9_IC8EIP_POSITION                    0x0000000A
//#define _IPC9_IC8EIP_MASK                        0x00001C00
//#define _IPC9_IC8EIP_LENGTH                      0x00000003

//#define _IPC9_IC8IS_POSITION                     0x00000010
//#define _IPC9_IC8IS_MASK                         0x00030000
//#define _IPC9_IC8IS_LENGTH                       0x00000002

//#define _IPC9_IC8IP_POSITION                     0x00000012
//#define _IPC9_IC8IP_MASK                         0x001C0000
//#define _IPC9_IC8IP_LENGTH                       0x00000003

//#define _IPC9_OC8IS_POSITION                     0x00000018
//#define _IPC9_OC8IS_MASK                         0x03000000
//#define _IPC9_OC8IS_LENGTH                       0x00000002

//#define _IPC9_OC8IP_POSITION                     0x0000001A
//#define _IPC9_OC8IP_MASK                         0x1C000000
//#define _IPC9_OC8IP_LENGTH                       0x00000003

//#define _IPC9_w_POSITION                         0x00000000
//#define _IPC9_w_MASK                             0xFFFFFFFF
//#define _IPC9_w_LENGTH                           0x00000020

//#define _IPC10_T9IS_POSITION                     0x00000000
//#define _IPC10_T9IS_MASK                         0x00000003
//#define _IPC10_T9IS_LENGTH                       0x00000002

//#define _IPC10_T9IP_POSITION                     0x00000002
//#define _IPC10_T9IP_MASK                         0x0000001C
//#define _IPC10_T9IP_LENGTH                       0x00000003

//#define _IPC10_IC9EIS_POSITION                   0x00000008
//#define _IPC10_IC9EIS_MASK                       0x00000300
//#define _IPC10_IC9EIS_LENGTH                     0x00000002

//#define _IPC10_IC9EIP_POSITION                   0x0000000A
//#define _IPC10_IC9EIP_MASK                       0x00001C00
//#define _IPC10_IC9EIP_LENGTH                     0x00000003

//#define _IPC10_IC9IS_POSITION                    0x00000010
//#define _IPC10_IC9IS_MASK                        0x00030000
//#define _IPC10_IC9IS_LENGTH                      0x00000002

