HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _IPC10_IC9IP_POSITION                    0x00000012
//#define _IPC10_IC9IP_MASK                        0x001C0000
//#define _IPC10_IC9IP_LENGTH                      0x00000003

//#define _IPC10_OC9IS_POSITION                    0x00000018
//#define _IPC10_OC9IS_MASK                        0x03000000
//#define _IPC10_OC9IS_LENGTH                      0x00000002

//#define _IPC10_OC9IP_POSITION                    0x0000001A
//#define _IPC10_OC9IP_MASK                        0x1C000000
//#define _IPC10_OC9IP_LENGTH                      0x00000003

//#define _IPC10_w_POSITION                        0x00000000
//#define _IPC10_w_MASK                            0xFFFFFFFF
//#define _IPC10_w_LENGTH                          0x00000020

//#define _IPC11_AD1IS_POSITION                    0x00000000
//#define _IPC11_AD1IS_MASK                        0x00000003
//#define _IPC11_AD1IS_LENGTH                      0x00000002

//#define _IPC11_AD1IP_POSITION                    0x00000002
//#define _IPC11_AD1IP_MASK                        0x0000001C
//#define _IPC11_AD1IP_LENGTH                      0x00000003

//#define _IPC11_AD1DC1IS_POSITION                 0x00000010
//#define _IPC11_AD1DC1IS_MASK                     0x00030000
//#define _IPC11_AD1DC1IS_LENGTH                   0x00000002

//#define _IPC11_AD1DC1IP_POSITION                 0x00000012
//#define _IPC11_AD1DC1IP_MASK                     0x001C0000
//#define _IPC11_AD1DC1IP_LENGTH                   0x00000003

//#define _IPC11_AD1DC2IS_POSITION                 0x00000018
//#define _IPC11_AD1DC2IS_MASK                     0x03000000
//#define _IPC11_AD1DC2IS_LENGTH                   0x00000002

//#define _IPC11_AD1DC2IP_POSITION                 0x0000001A
//#define _IPC11_AD1DC2IP_MASK                     0x1C000000
//#define _IPC11_AD1DC2IP_LENGTH                   0x00000003

//#define _IPC11_w_POSITION                        0x00000000
//#define _IPC11_w_MASK                            0xFFFFFFFF
//#define _IPC11_w_LENGTH                          0x00000020

//#define _IPC12_AD1DC3IS_POSITION                 0x00000000
//#define _IPC12_AD1DC3IS_MASK                     0x00000003
//#define _IPC12_AD1DC3IS_LENGTH                   0x00000002

//#define _IPC12_AD1DC3IP_POSITION                 0x00000002
//#define _IPC12_AD1DC3IP_MASK                     0x0000001C
//#define _IPC12_AD1DC3IP_LENGTH                   0x00000003

//#define _IPC12_AD1DC4IS_POSITION                 0x00000008
//#define _IPC12_AD1DC4IS_MASK                     0x00000300
//#define _IPC12_AD1DC4IS_LENGTH                   0x00000002

//#define _IPC12_AD1DC4IP_POSITION                 0x0000000A
//#define _IPC12_AD1DC4IP_MASK                     0x00001C00
//#define _IPC12_AD1DC4IP_LENGTH                   0x00000003

//#define _IPC12_AD1DC5IS_POSITION                 0x00000010
//#define _IPC12_AD1DC5IS_MASK                     0x00030000
//#define _IPC12_AD1DC5IS_LENGTH                   0x00000002

//#define _IPC12_AD1DC5IP_POSITION                 0x00000012
//#define _IPC12_AD1DC5IP_MASK                     0x001C0000
//#define _IPC12_AD1DC5IP_LENGTH                   0x00000003

//#define _IPC12_AD1DC6IS_POSITION                 0x00000018
//#define _IPC12_AD1DC6IS_MASK                     0x03000000
//#define _IPC12_AD1DC6IS_LENGTH                   0x00000002

//#define _IPC12_AD1DC6IP_POSITION                 0x0000001A
//#define _IPC12_AD1DC6IP_MASK                     0x1C000000
//#define _IPC12_AD1DC6IP_LENGTH                   0x00000003

//#define _IPC12_w_POSITION                        0x00000000
//#define _IPC12_w_MASK                            0xFFFFFFFF
//#define _IPC12_w_LENGTH                          0x00000020

//#define _IPC13_AD1DF1IS_POSITION                 0x00000000
//#define _IPC13_AD1DF1IS_MASK                     0x00000003
//#define _IPC13_AD1DF1IS_LENGTH                   0x00000002

//#define _IPC13_AD1DF1IP_POSITION                 0x00000002
//#define _IPC13_AD1DF1IP_MASK                     0x0000001C
//#define _IPC13_AD1DF1IP_LENGTH                   0x00000003

//#define _IPC13_AD1DF2IS_POSITION                 0x00000008
//#define _IPC13_AD1DF2IS_MASK                     0x00000300
//#define _IPC13_AD1DF2IS_LENGTH                   0x00000002

//#define _IPC13_AD1DF2IP_POSITION                 0x0000000A
//#define _IPC13_AD1DF2IP_MASK                     0x00001C00
//#define _IPC13_AD1DF2IP_LENGTH                   0x00000003

//#define _IPC13_AD1DF3IS_POSITION                 0x00000010
//#define _IPC13_AD1DF3IS_MASK                     0x00030000
//#define _IPC13_AD1DF3IS_LENGTH                   0x00000002

//#define _IPC13_AD1DF3IP_POSITION                 0x00000012
//#define _IPC13_AD1DF3IP_MASK                     0x001C0000
//#define _IPC13_AD1DF3IP_LENGTH                   0x00000003

//#define _IPC13_AD1DF4IS_POSITION                 0x00000018
//#define _IPC13_AD1DF4IS_MASK                     0x03000000
//#define _IPC13_AD1DF4IS_LENGTH                   0x00000002

//#define _IPC13_AD1DF4IP_POSITION                 0x0000001A
//#define _IPC13_AD1DF4IP_MASK                     0x1C000000
//#define _IPC13_AD1DF4IP_LENGTH                   0x00000003

//#define _IPC13_w_POSITION                        0x00000000
//#define _IPC13_w_MASK                            0xFFFFFFFF
//#define _IPC13_w_LENGTH                          0x00000020

//#define _IPC14_AD1DF5IS_POSITION                 0x00000000
//#define _IPC14_AD1DF5IS_MASK                     0x00000003
//#define _IPC14_AD1DF5IS_LENGTH                   0x00000002

//#define _IPC14_AD1DF5IP_POSITION                 0x00000002
//#define _IPC14_AD1DF5IP_MASK                     0x0000001C
//#define _IPC14_AD1DF5IP_LENGTH                   0x00000003

//#define _IPC14_AD1DF6IS_POSITION                 0x00000008
//#define _IPC14_AD1DF6IS_MASK                     0x00000300
//#define _IPC14_AD1DF6IS_LENGTH                   0x00000002

//#define _IPC14_AD1DF6IP_POSITION                 0x0000000A
//#define _IPC14_AD1DF6IP_MASK                     0x00001C00
//#define _IPC14_AD1DF6IP_LENGTH                   0x00000003

//#define _IPC14_AD1D0IS_POSITION                  0x00000018
//#define _IPC14_AD1D0IS_MASK                      0x03000000
//#define _IPC14_AD1D0IS_LENGTH                    0x00000002

