HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _OFF162_VOFF_POSITION                    0x00000001
//#define _OFF162_VOFF_MASK                        0x0003FFFE
//#define _OFF162_VOFF_LENGTH                      0x00000011

//#define _OFF163_VOFF_POSITION                    0x00000001
//#define _OFF163_VOFF_MASK                        0x0003FFFE
//#define _OFF163_VOFF_LENGTH                      0x00000011

//#define _OFF164_VOFF_POSITION                    0x00000001
//#define _OFF164_VOFF_MASK                        0x0003FFFE
//#define _OFF164_VOFF_LENGTH                      0x00000011

//#define _OFF165_VOFF_POSITION                    0x00000001
//#define _OFF165_VOFF_MASK                        0x0003FFFE
//#define _OFF165_VOFF_LENGTH                      0x00000011

//#define _OFF166_VOFF_POSITION                    0x00000001
//#define _OFF166_VOFF_MASK                        0x0003FFFE
//#define _OFF166_VOFF_LENGTH                      0x00000011

//#define _OFF167_VOFF_POSITION                    0x00000001
//#define _OFF167_VOFF_MASK                        0x0003FFFE
//#define _OFF167_VOFF_LENGTH                      0x00000011

//#define _OFF168_VOFF_POSITION                    0x00000001
//#define _OFF168_VOFF_MASK                        0x0003FFFE
//#define _OFF168_VOFF_LENGTH                      0x00000011

//#define _OFF169_VOFF_POSITION                    0x00000001
//#define _OFF169_VOFF_MASK                        0x0003FFFE
//#define _OFF169_VOFF_LENGTH                      0x00000011

//#define _OFF170_VOFF_POSITION                    0x00000001
//#define _OFF170_VOFF_MASK                        0x0003FFFE
//#define _OFF170_VOFF_LENGTH                      0x00000011

//#define _OFF171_VOFF_POSITION                    0x00000001
//#define _OFF171_VOFF_MASK                        0x0003FFFE
//#define _OFF171_VOFF_LENGTH                      0x00000011

//#define _OFF172_VOFF_POSITION                    0x00000001
//#define _OFF172_VOFF_MASK                        0x0003FFFE
//#define _OFF172_VOFF_LENGTH                      0x00000011

//#define _OFF173_VOFF_POSITION                    0x00000001
//#define _OFF173_VOFF_MASK                        0x0003FFFE
//#define _OFF173_VOFF_LENGTH                      0x00000011

//#define _OFF174_VOFF_POSITION                    0x00000001
//#define _OFF174_VOFF_MASK                        0x0003FFFE
//#define _OFF174_VOFF_LENGTH                      0x00000011

//#define _OFF175_VOFF_POSITION                    0x00000001
//#define _OFF175_VOFF_MASK                        0x0003FFFE
//#define _OFF175_VOFF_LENGTH                      0x00000011

//#define _OFF176_VOFF_POSITION                    0x00000001
//#define _OFF176_VOFF_MASK                        0x0003FFFE
//#define _OFF176_VOFF_LENGTH                      0x00000011

//#define _OFF177_VOFF_POSITION                    0x00000001
//#define _OFF177_VOFF_MASK                        0x0003FFFE
//#define _OFF177_VOFF_LENGTH                      0x00000011

//#define _OFF178_VOFF_POSITION                    0x00000001
//#define _OFF178_VOFF_MASK                        0x0003FFFE
//#define _OFF178_VOFF_LENGTH                      0x00000011

//#define _OFF179_VOFF_POSITION                    0x00000001
//#define _OFF179_VOFF_MASK                        0x0003FFFE
//#define _OFF179_VOFF_LENGTH                      0x00000011

//#define _OFF180_VOFF_POSITION                    0x00000001
//#define _OFF180_VOFF_MASK                        0x0003FFFE
//#define _OFF180_VOFF_LENGTH                      0x00000011

//#define _OFF181_VOFF_POSITION                    0x00000001
//#define _OFF181_VOFF_MASK                        0x0003FFFE
//#define _OFF181_VOFF_LENGTH                      0x00000011

//#define _OFF182_VOFF_POSITION                    0x00000001
//#define _OFF182_VOFF_MASK                        0x0003FFFE
//#define _OFF182_VOFF_LENGTH                      0x00000011

//#define _OFF183_VOFF_POSITION                    0x00000001
//#define _OFF183_VOFF_MASK                        0x0003FFFE
//#define _OFF183_VOFF_LENGTH                      0x00000011

//#define _OFF184_VOFF_POSITION                    0x00000001
//#define _OFF184_VOFF_MASK                        0x0003FFFE
//#define _OFF184_VOFF_LENGTH                      0x00000011

//#define _OFF185_VOFF_POSITION                    0x00000001
//#define _OFF185_VOFF_MASK                        0x0003FFFE
//#define _OFF185_VOFF_LENGTH                      0x00000011

//#define _OFF186_VOFF_POSITION                    0x00000001
//#define _OFF186_VOFF_MASK                        0x0003FFFE
//#define _OFF186_VOFF_LENGTH                      0x00000011

//#define _OFF187_VOFF_POSITION                    0x00000001
//#define _OFF187_VOFF_MASK                        0x0003FFFE
//#define _OFF187_VOFF_LENGTH                      0x00000011

//#define _OFF188_VOFF_POSITION                    0x00000001
//#define _OFF188_VOFF_MASK                        0x0003FFFE
//#define _OFF188_VOFF_LENGTH                      0x00000011

//#define _OFF189_VOFF_POSITION                    0x00000001
//#define _OFF189_VOFF_MASK                        0x0003FFFE
//#define _OFF189_VOFF_LENGTH                      0x00000011

//#define _OFF190_VOFF_POSITION                    0x00000001
//#define _OFF190_VOFF_MASK                        0x0003FFFE
//#define _OFF190_VOFF_LENGTH                      0x00000011

//#define _DMACON_DMABUSY_POSITION                 0x0000000B
//#define _DMACON_DMABUSY_MASK                     0x00000800
//#define _DMACON_DMABUSY_LENGTH                   0x00000001

//#define _DMACON_SUSPEND_POSITION                 0x0000000C
//#define _DMACON_SUSPEND_MASK                     0x00001000
//#define _DMACON_SUSPEND_LENGTH                   0x00000001

//#define _DMACON_ON_POSITION                      0x0000000F
//#define _DMACON_ON_MASK                          0x00008000
//#define _DMACON_ON_LENGTH                        0x00000001

//#define _DMASTAT_DMACH_POSITION                  0x00000000
//#define _DMASTAT_DMACH_MASK                      0x00000007
//#define _DMASTAT_DMACH_LENGTH                    0x00000003

//#define _DMASTAT_RDWR_POSITION                   0x0000001F
//#define _DMASTAT_RDWR_MASK                       0x80000000
//#define _DMASTAT_RDWR_LENGTH                     0x00000001

