HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _DMAADDR_DMAADDR_POSITION                0x00000000
//#define _DMAADDR_DMAADDR_MASK                    0xFFFFFFFF
//#define _DMAADDR_DMAADDR_LENGTH                  0x00000020

//#define _DCRCCON_CRCCH_POSITION                  0x00000000
//#define _DCRCCON_CRCCH_MASK                      0x00000007
//#define _DCRCCON_CRCCH_LENGTH                    0x00000003

//#define _DCRCCON_CRCTYP_POSITION                 0x00000005
//#define _DCRCCON_CRCTYP_MASK                     0x00000020
//#define _DCRCCON_CRCTYP_LENGTH                   0x00000001

//#define _DCRCCON_CRCAPP_POSITION                 0x00000006
//#define _DCRCCON_CRCAPP_MASK                     0x00000040
//#define _DCRCCON_CRCAPP_LENGTH                   0x00000001

//#define _DCRCCON_CRCEN_POSITION                  0x00000007
//#define _DCRCCON_CRCEN_MASK                      0x00000080
//#define _DCRCCON_CRCEN_LENGTH                    0x00000001

//#define _DCRCCON_PLEN_POSITION                   0x00000008
//#define _DCRCCON_PLEN_MASK                       0x00001F00
//#define _DCRCCON_PLEN_LENGTH                     0x00000005

//#define _DCRCCON_BITO_POSITION                   0x00000018
//#define _DCRCCON_BITO_MASK                       0x01000000
//#define _DCRCCON_BITO_LENGTH                     0x00000001

//#define _DCRCCON_WBO_POSITION                    0x0000001B
//#define _DCRCCON_WBO_MASK                        0x08000000
//#define _DCRCCON_WBO_LENGTH                      0x00000001

//#define _DCRCCON_BYTO_POSITION                   0x0000001C
//#define _DCRCCON_BYTO_MASK                       0x30000000
//#define _DCRCCON_BYTO_LENGTH                     0x00000002

//#define _DCRCDATA_DCRCDATA_POSITION              0x00000000
//#define _DCRCDATA_DCRCDATA_MASK                  0xFFFFFFFF
//#define _DCRCDATA_DCRCDATA_LENGTH                0x00000020

//#define _DCRCXOR_DCRCXOR_POSITION                0x00000000
//#define _DCRCXOR_DCRCXOR_MASK                    0xFFFFFFFF
//#define _DCRCXOR_DCRCXOR_LENGTH                  0x00000020

//#define _DCH0CON_CHPRI_POSITION                  0x00000000
//#define _DCH0CON_CHPRI_MASK                      0x00000003
//#define _DCH0CON_CHPRI_LENGTH                    0x00000002

//#define _DCH0CON_CHEDET_POSITION                 0x00000002
//#define _DCH0CON_CHEDET_MASK                     0x00000004
//#define _DCH0CON_CHEDET_LENGTH                   0x00000001

//#define _DCH0CON_CHAEN_POSITION                  0x00000004
//#define _DCH0CON_CHAEN_MASK                      0x00000010
//#define _DCH0CON_CHAEN_LENGTH                    0x00000001

//#define _DCH0CON_CHCHN_POSITION                  0x00000005
//#define _DCH0CON_CHCHN_MASK                      0x00000020
//#define _DCH0CON_CHCHN_LENGTH                    0x00000001

//#define _DCH0CON_CHAED_POSITION                  0x00000006
//#define _DCH0CON_CHAED_MASK                      0x00000040
//#define _DCH0CON_CHAED_LENGTH                    0x00000001

//#define _DCH0CON_CHEN_POSITION                   0x00000007
//#define _DCH0CON_CHEN_MASK                       0x00000080
//#define _DCH0CON_CHEN_LENGTH                     0x00000001

//#define _DCH0CON_CHCHNS_POSITION                 0x00000008
//#define _DCH0CON_CHCHNS_MASK                     0x00000100
//#define _DCH0CON_CHCHNS_LENGTH                   0x00000001

//#define _DCH0CON_CHPATLEN_POSITION               0x0000000B
//#define _DCH0CON_CHPATLEN_MASK                   0x00000800
//#define _DCH0CON_CHPATLEN_LENGTH                 0x00000001

//#define _DCH0CON_CHPIGNEN_POSITION               0x0000000D
//#define _DCH0CON_CHPIGNEN_MASK                   0x00002000
//#define _DCH0CON_CHPIGNEN_LENGTH                 0x00000001

//#define _DCH0CON_CHBUSY_POSITION                 0x0000000F
//#define _DCH0CON_CHBUSY_MASK                     0x00008000
//#define _DCH0CON_CHBUSY_LENGTH                   0x00000001

//#define _DCH0CON_CHPIGN_POSITION                 0x00000018
//#define _DCH0CON_CHPIGN_MASK                     0xFF000000
//#define _DCH0CON_CHPIGN_LENGTH                   0x00000008

//#define _DCH0ECON_AIRQEN_POSITION                0x00000003
//#define _DCH0ECON_AIRQEN_MASK                    0x00000008
//#define _DCH0ECON_AIRQEN_LENGTH                  0x00000001

//#define _DCH0ECON_SIRQEN_POSITION                0x00000004
//#define _DCH0ECON_SIRQEN_MASK                    0x00000010
//#define _DCH0ECON_SIRQEN_LENGTH                  0x00000001

//#define _DCH0ECON_PATEN_POSITION                 0x00000005
//#define _DCH0ECON_PATEN_MASK                     0x00000020
//#define _DCH0ECON_PATEN_LENGTH                   0x00000001

//#define _DCH0ECON_CABORT_POSITION                0x00000006
//#define _DCH0ECON_CABORT_MASK                    0x00000040
//#define _DCH0ECON_CABORT_LENGTH                  0x00000001

//#define _DCH0ECON_CFORCE_POSITION                0x00000007
//#define _DCH0ECON_CFORCE_MASK                    0x00000080
//#define _DCH0ECON_CFORCE_LENGTH                  0x00000001

//#define _DCH0ECON_CHSIRQ_POSITION                0x00000008
//#define _DCH0ECON_CHSIRQ_MASK                    0x0000FF00
//#define _DCH0ECON_CHSIRQ_LENGTH                  0x00000008

//#define _DCH0ECON_CHAIRQ_POSITION                0x00000010
//#define _DCH0ECON_CHAIRQ_MASK                    0x00FF0000
//#define _DCH0ECON_CHAIRQ_LENGTH                  0x00000008

//#define _DCH0INT_CHERIF_POSITION                 0x00000000
//#define _DCH0INT_CHERIF_MASK                     0x00000001
//#define _DCH0INT_CHERIF_LENGTH                   0x00000001

//#define _DCH0INT_CHTAIF_POSITION                 0x00000001
//#define _DCH0INT_CHTAIF_MASK                     0x00000002
//#define _DCH0INT_CHTAIF_LENGTH                   0x00000001

//#define _DCH0INT_CHCCIF_POSITION                 0x00000002
//#define _DCH0INT_CHCCIF_MASK                     0x00000004
//#define _DCH0INT_CHCCIF_LENGTH                   0x00000001

//#define _DCH0INT_CHBCIF_POSITION                 0x00000003
//#define _DCH0INT_CHBCIF_MASK                     0x00000008
//#define _DCH0INT_CHBCIF_LENGTH                   0x00000001

//#define _DCH0INT_CHDHIF_POSITION                 0x00000004
//#define _DCH0INT_CHDHIF_MASK                     0x00000010
//#define _DCH0INT_CHDHIF_LENGTH                   0x00000001

//#define _DCH0INT_CHDDIF_POSITION                 0x00000005
//#define _DCH0INT_CHDDIF_MASK                     0x00000020
//#define _DCH0INT_CHDDIF_LENGTH                   0x00000001

//#define _DCH0INT_CHSHIF_POSITION                 0x00000006
//#define _DCH0INT_CHSHIF_MASK                     0x00000040
//#define _DCH0INT_CHSHIF_LENGTH                   0x00000001

//#define _DCH0INT_CHSDIF_POSITION                 0x00000007
//#define _DCH0INT_CHSDIF_MASK                     0x00000080
//#define _DCH0INT_CHSDIF_LENGTH                   0x00000001

//#define _DCH0INT_CHERIE_POSITION                 0x00000010
//#define _DCH0INT_CHERIE_MASK                     0x00010000
//#define _DCH0INT_CHERIE_LENGTH                   0x00000001

