HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _DCH0INT_CHTAIE_POSITION                 0x00000011
//#define _DCH0INT_CHTAIE_MASK                     0x00020000
//#define _DCH0INT_CHTAIE_LENGTH                   0x00000001

//#define _DCH0INT_CHCCIE_POSITION                 0x00000012
//#define _DCH0INT_CHCCIE_MASK                     0x00040000
//#define _DCH0INT_CHCCIE_LENGTH                   0x00000001

//#define _DCH0INT_CHBCIE_POSITION                 0x00000013
//#define _DCH0INT_CHBCIE_MASK                     0x00080000
//#define _DCH0INT_CHBCIE_LENGTH                   0x00000001

//#define _DCH0INT_CHDHIE_POSITION                 0x00000014
//#define _DCH0INT_CHDHIE_MASK                     0x00100000
//#define _DCH0INT_CHDHIE_LENGTH                   0x00000001

//#define _DCH0INT_CHDDIE_POSITION                 0x00000015
//#define _DCH0INT_CHDDIE_MASK                     0x00200000
//#define _DCH0INT_CHDDIE_LENGTH                   0x00000001

//#define _DCH0INT_CHSHIE_POSITION                 0x00000016
//#define _DCH0INT_CHSHIE_MASK                     0x00400000
//#define _DCH0INT_CHSHIE_LENGTH                   0x00000001

//#define _DCH0INT_CHSDIE_POSITION                 0x00000017
//#define _DCH0INT_CHSDIE_MASK                     0x00800000
//#define _DCH0INT_CHSDIE_LENGTH                   0x00000001

//#define _DCH0SSA_CHSSA_POSITION                  0x00000000
//#define _DCH0SSA_CHSSA_MASK                      0xFFFFFFFF
//#define _DCH0SSA_CHSSA_LENGTH                    0x00000020

//#define _DCH0DSA_CHDSA_POSITION                  0x00000000
//#define _DCH0DSA_CHDSA_MASK                      0xFFFFFFFF
//#define _DCH0DSA_CHDSA_LENGTH                    0x00000020

//#define _DCH0SSIZ_CHSSIZ_POSITION                0x00000000
//#define _DCH0SSIZ_CHSSIZ_MASK                    0x0000FFFF
//#define _DCH0SSIZ_CHSSIZ_LENGTH                  0x00000010

//#define _DCH0DSIZ_CHDSIZ_POSITION                0x00000000
//#define _DCH0DSIZ_CHDSIZ_MASK                    0x0000FFFF
//#define _DCH0DSIZ_CHDSIZ_LENGTH                  0x00000010

//#define _DCH0SPTR_CHSPTR_POSITION                0x00000000
//#define _DCH0SPTR_CHSPTR_MASK                    0x0000FFFF
//#define _DCH0SPTR_CHSPTR_LENGTH                  0x00000010

//#define _DCH0DPTR_CHDPTR_POSITION                0x00000000
//#define _DCH0DPTR_CHDPTR_MASK                    0x0000FFFF
//#define _DCH0DPTR_CHDPTR_LENGTH                  0x00000010

//#define _DCH0CSIZ_CHCSIZ_POSITION                0x00000000
//#define _DCH0CSIZ_CHCSIZ_MASK                    0x0000FFFF
//#define _DCH0CSIZ_CHCSIZ_LENGTH                  0x00000010

//#define _DCS0CPTR_CHCPTR_POSITION                0x00000000
//#define _DCS0CPTR_CHCPTR_MASK                    0x0000FFFF
//#define _DCS0CPTR_CHCPTR_LENGTH                  0x00000010

//#define _DCH0DAT_CHPDAT_POSITION                 0x00000000
//#define _DCH0DAT_CHPDAT_MASK                     0x0000FFFF
//#define _DCH0DAT_CHPDAT_LENGTH                   0x00000010

//#define _DCH1CON_CHPRI_POSITION                  0x00000000
//#define _DCH1CON_CHPRI_MASK                      0x00000003
//#define _DCH1CON_CHPRI_LENGTH                    0x00000002

//#define _DCH1CON_CHEDET_POSITION                 0x00000002
//#define _DCH1CON_CHEDET_MASK                     0x00000004
//#define _DCH1CON_CHEDET_LENGTH                   0x00000001

//#define _DCH1CON_CHAEN_POSITION                  0x00000004
//#define _DCH1CON_CHAEN_MASK                      0x00000010
//#define _DCH1CON_CHAEN_LENGTH                    0x00000001

//#define _DCH1CON_CHCHN_POSITION                  0x00000005
//#define _DCH1CON_CHCHN_MASK                      0x00000020
//#define _DCH1CON_CHCHN_LENGTH                    0x00000001

//#define _DCH1CON_CHAED_POSITION                  0x00000006
//#define _DCH1CON_CHAED_MASK                      0x00000040
//#define _DCH1CON_CHAED_LENGTH                    0x00000001

//#define _DCH1CON_CHEN_POSITION                   0x00000007
//#define _DCH1CON_CHEN_MASK                       0x00000080
//#define _DCH1CON_CHEN_LENGTH                     0x00000001

//#define _DCH1CON_CHCHNS_POSITION                 0x00000008
//#define _DCH1CON_CHCHNS_MASK                     0x00000100
//#define _DCH1CON_CHCHNS_LENGTH                   0x00000001

//#define _DCH1CON_CHPATLEN_POSITION               0x0000000B
//#define _DCH1CON_CHPATLEN_MASK                   0x00000800
//#define _DCH1CON_CHPATLEN_LENGTH                 0x00000001

//#define _DCH1CON_CHPIGNEN_POSITION               0x0000000D
//#define _DCH1CON_CHPIGNEN_MASK                   0x00002000
//#define _DCH1CON_CHPIGNEN_LENGTH                 0x00000001

//#define _DCH1CON_CHBUSY_POSITION                 0x0000000F
//#define _DCH1CON_CHBUSY_MASK                     0x00008000
//#define _DCH1CON_CHBUSY_LENGTH                   0x00000001

//#define _DCH1CON_CHPIGN_POSITION                 0x00000018
//#define _DCH1CON_CHPIGN_MASK                     0xFF000000
//#define _DCH1CON_CHPIGN_LENGTH                   0x00000008

//#define _DCH1ECON_AIRQEN_POSITION                0x00000003
//#define _DCH1ECON_AIRQEN_MASK                    0x00000008
//#define _DCH1ECON_AIRQEN_LENGTH                  0x00000001

//#define _DCH1ECON_SIRQEN_POSITION                0x00000004
//#define _DCH1ECON_SIRQEN_MASK                    0x00000010
//#define _DCH1ECON_SIRQEN_LENGTH                  0x00000001

//#define _DCH1ECON_PATEN_POSITION                 0x00000005
//#define _DCH1ECON_PATEN_MASK                     0x00000020
//#define _DCH1ECON_PATEN_LENGTH                   0x00000001

//#define _DCH1ECON_CABORT_POSITION                0x00000006
//#define _DCH1ECON_CABORT_MASK                    0x00000040
//#define _DCH1ECON_CABORT_LENGTH                  0x00000001

//#define _DCH1ECON_CFORCE_POSITION                0x00000007
//#define _DCH1ECON_CFORCE_MASK                    0x00000080
//#define _DCH1ECON_CFORCE_LENGTH                  0x00000001

//#define _DCH1ECON_CHSIRQ_POSITION                0x00000008
//#define _DCH1ECON_CHSIRQ_MASK                    0x0000FF00
//#define _DCH1ECON_CHSIRQ_LENGTH                  0x00000008

//#define _DCH1ECON_CHAIRQ_POSITION                0x00000010
//#define _DCH1ECON_CHAIRQ_MASK                    0x00FF0000
//#define _DCH1ECON_CHAIRQ_LENGTH                  0x00000008

//#define _DCH1INT_CHERIF_POSITION                 0x00000000
//#define _DCH1INT_CHERIF_MASK                     0x00000001
//#define _DCH1INT_CHERIF_LENGTH                   0x00000001

