HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _I2C2CON_RSEN_POSITION                   0x00000001
//#define _I2C2CON_RSEN_MASK                       0x00000002
//#define _I2C2CON_RSEN_LENGTH                     0x00000001

//#define _I2C2CON_PEN_POSITION                    0x00000002
//#define _I2C2CON_PEN_MASK                        0x00000004
//#define _I2C2CON_PEN_LENGTH                      0x00000001

//#define _I2C2CON_RCEN_POSITION                   0x00000003
//#define _I2C2CON_RCEN_MASK                       0x00000008
//#define _I2C2CON_RCEN_LENGTH                     0x00000001

//#define _I2C2CON_ACKEN_POSITION                  0x00000004
//#define _I2C2CON_ACKEN_MASK                      0x00000010
//#define _I2C2CON_ACKEN_LENGTH                    0x00000001

//#define _I2C2CON_ACKDT_POSITION                  0x00000005
//#define _I2C2CON_ACKDT_MASK                      0x00000020
//#define _I2C2CON_ACKDT_LENGTH                    0x00000001

//#define _I2C2CON_STREN_POSITION                  0x00000006
//#define _I2C2CON_STREN_MASK                      0x00000040
//#define _I2C2CON_STREN_LENGTH                    0x00000001

//#define _I2C2CON_GCEN_POSITION                   0x00000007
//#define _I2C2CON_GCEN_MASK                       0x00000080
//#define _I2C2CON_GCEN_LENGTH                     0x00000001

//#define _I2C2CON_SMEN_POSITION                   0x00000008
//#define _I2C2CON_SMEN_MASK                       0x00000100
//#define _I2C2CON_SMEN_LENGTH                     0x00000001

//#define _I2C2CON_DISSLW_POSITION                 0x00000009
//#define _I2C2CON_DISSLW_MASK                     0x00000200
//#define _I2C2CON_DISSLW_LENGTH                   0x00000001

//#define _I2C2CON_A10M_POSITION                   0x0000000A
//#define _I2C2CON_A10M_MASK                       0x00000400
//#define _I2C2CON_A10M_LENGTH                     0x00000001

//#define _I2C2CON_STRICT_POSITION                 0x0000000B
//#define _I2C2CON_STRICT_MASK                     0x00000800
//#define _I2C2CON_STRICT_LENGTH                   0x00000001

//#define _I2C2CON_SCLREL_POSITION                 0x0000000C
//#define _I2C2CON_SCLREL_MASK                     0x00001000
//#define _I2C2CON_SCLREL_LENGTH                   0x00000001

//#define _I2C2CON_SIDL_POSITION                   0x0000000D
//#define _I2C2CON_SIDL_MASK                       0x00002000
//#define _I2C2CON_SIDL_LENGTH                     0x00000001

//#define _I2C2CON_ON_POSITION                     0x0000000F
//#define _I2C2CON_ON_MASK                         0x00008000
//#define _I2C2CON_ON_LENGTH                       0x00000001

//#define _I2C2CON_DHEN_POSITION                   0x00000010
//#define _I2C2CON_DHEN_MASK                       0x00010000
//#define _I2C2CON_DHEN_LENGTH                     0x00000001

//#define _I2C2CON_AHEN_POSITION                   0x00000011
//#define _I2C2CON_AHEN_MASK                       0x00020000
//#define _I2C2CON_AHEN_LENGTH                     0x00000001

//#define _I2C2CON_SBCDE_POSITION                  0x00000012
//#define _I2C2CON_SBCDE_MASK                      0x00040000
//#define _I2C2CON_SBCDE_LENGTH                    0x00000001

//#define _I2C2CON_SDAHT_POSITION                  0x00000013
//#define _I2C2CON_SDAHT_MASK                      0x00080000
//#define _I2C2CON_SDAHT_LENGTH                    0x00000001

//#define _I2C2CON_BOEN_POSITION                   0x00000014
//#define _I2C2CON_BOEN_MASK                       0x00100000
//#define _I2C2CON_BOEN_LENGTH                     0x00000001

//#define _I2C2CON_SCIE_POSITION                   0x00000015
//#define _I2C2CON_SCIE_MASK                       0x00200000
//#define _I2C2CON_SCIE_LENGTH                     0x00000001

//#define _I2C2CON_PCIE_POSITION                   0x00000016
//#define _I2C2CON_PCIE_MASK                       0x00400000
//#define _I2C2CON_PCIE_LENGTH                     0x00000001

//#define _I2C2CON_IPMIEN_POSITION                 0x0000000B
//#define _I2C2CON_IPMIEN_MASK                     0x00000800
//#define _I2C2CON_IPMIEN_LENGTH                   0x00000001

//#define _I2C2CON_I2CSIDL_POSITION                0x0000000D
//#define _I2C2CON_I2CSIDL_MASK                    0x00002000
//#define _I2C2CON_I2CSIDL_LENGTH                  0x00000001

//#define _I2C2CON_I2CEN_POSITION                  0x0000000F
//#define _I2C2CON_I2CEN_MASK                      0x00008000
//#define _I2C2CON_I2CEN_LENGTH                    0x00000001

//#define _I2C2STAT_TBF_POSITION                   0x00000000
//#define _I2C2STAT_TBF_MASK                       0x00000001
//#define _I2C2STAT_TBF_LENGTH                     0x00000001

//#define _I2C2STAT_RBF_POSITION                   0x00000001
//#define _I2C2STAT_RBF_MASK                       0x00000002
//#define _I2C2STAT_RBF_LENGTH                     0x00000001

//#define _I2C2STAT_R_W_POSITION                   0x00000002
//#define _I2C2STAT_R_W_MASK                       0x00000004
//#define _I2C2STAT_R_W_LENGTH                     0x00000001

//#define _I2C2STAT_S_POSITION                     0x00000003
//#define _I2C2STAT_S_MASK                         0x00000008
//#define _I2C2STAT_S_LENGTH                       0x00000001

//#define _I2C2STAT_P_POSITION                     0x00000004
//#define _I2C2STAT_P_MASK                         0x00000010
//#define _I2C2STAT_P_LENGTH                       0x00000001

//#define _I2C2STAT_D_A_POSITION                   0x00000005
//#define _I2C2STAT_D_A_MASK                       0x00000020
//#define _I2C2STAT_D_A_LENGTH                     0x00000001

//#define _I2C2STAT_I2COV_POSITION                 0x00000006
//#define _I2C2STAT_I2COV_MASK                     0x00000040
//#define _I2C2STAT_I2COV_LENGTH                   0x00000001

//#define _I2C2STAT_IWCOL_POSITION                 0x00000007
//#define _I2C2STAT_IWCOL_MASK                     0x00000080
//#define _I2C2STAT_IWCOL_LENGTH                   0x00000001

//#define _I2C2STAT_ADD10_POSITION                 0x00000008
//#define _I2C2STAT_ADD10_MASK                     0x00000100
//#define _I2C2STAT_ADD10_LENGTH                   0x00000001

//#define _I2C2STAT_GCSTAT_POSITION                0x00000009
//#define _I2C2STAT_GCSTAT_MASK                    0x00000200
//#define _I2C2STAT_GCSTAT_LENGTH                  0x00000001

