HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _U2STA_URXISEL_POSITION                  0x00000006
//#define _U2STA_URXISEL_MASK                      0x000000C0
//#define _U2STA_URXISEL_LENGTH                    0x00000002

//#define _U2STA_TRMT_POSITION                     0x00000008
//#define _U2STA_TRMT_MASK                         0x00000100
//#define _U2STA_TRMT_LENGTH                       0x00000001

//#define _U2STA_UTXBF_POSITION                    0x00000009
//#define _U2STA_UTXBF_MASK                        0x00000200
//#define _U2STA_UTXBF_LENGTH                      0x00000001

//#define _U2STA_UTXEN_POSITION                    0x0000000A
//#define _U2STA_UTXEN_MASK                        0x00000400
//#define _U2STA_UTXEN_LENGTH                      0x00000001

//#define _U2STA_UTXBRK_POSITION                   0x0000000B
//#define _U2STA_UTXBRK_MASK                       0x00000800
//#define _U2STA_UTXBRK_LENGTH                     0x00000001

//#define _U2STA_URXEN_POSITION                    0x0000000C
//#define _U2STA_URXEN_MASK                        0x00001000
//#define _U2STA_URXEN_LENGTH                      0x00000001

//#define _U2STA_UTXINV_POSITION                   0x0000000D
//#define _U2STA_UTXINV_MASK                       0x00002000
//#define _U2STA_UTXINV_LENGTH                     0x00000001

//#define _U2STA_UTXISEL_POSITION                  0x0000000E
//#define _U2STA_UTXISEL_MASK                      0x0000C000
//#define _U2STA_UTXISEL_LENGTH                    0x00000002

//#define _U2STA_ADDR_POSITION                     0x00000010
//#define _U2STA_ADDR_MASK                         0x00FF0000
//#define _U2STA_ADDR_LENGTH                       0x00000008

//#define _U2STA_ADM_EN_POSITION                   0x00000018
//#define _U2STA_ADM_EN_MASK                       0x01000000
//#define _U2STA_ADM_EN_LENGTH                     0x00000001

//#define _U2STA_URXISEL0_POSITION                 0x00000006
//#define _U2STA_URXISEL0_MASK                     0x00000040
//#define _U2STA_URXISEL0_LENGTH                   0x00000001

//#define _U2STA_URXISEL1_POSITION                 0x00000007
//#define _U2STA_URXISEL1_MASK                     0x00000080
//#define _U2STA_URXISEL1_LENGTH                   0x00000001

//#define _U2STA_UTXISEL0_POSITION                 0x0000000E
//#define _U2STA_UTXISEL0_MASK                     0x00004000
//#define _U2STA_UTXISEL0_LENGTH                   0x00000001

//#define _U2STA_UTXISEL1_POSITION                 0x0000000F
//#define _U2STA_UTXISEL1_MASK                     0x00008000
//#define _U2STA_UTXISEL1_LENGTH                   0x00000001

//#define _U2STA_UTXSEL_POSITION                   0x0000000E
//#define _U2STA_UTXSEL_MASK                       0x0000C000
//#define _U2STA_UTXSEL_LENGTH                     0x00000002

//#define _U2STA_w_POSITION                        0x00000000
//#define _U2STA_w_MASK                            0xFFFFFFFF
//#define _U2STA_w_LENGTH                          0x00000020

//#define _UCDSTA_URXDA_POSITION                   0x00000000
//#define _UCDSTA_URXDA_MASK                       0x00000001
//#define _UCDSTA_URXDA_LENGTH                     0x00000001

//#define _UCDSTA_OERR_POSITION                    0x00000001
//#define _UCDSTA_OERR_MASK                        0x00000002
//#define _UCDSTA_OERR_LENGTH                      0x00000001

//#define _UCDSTA_FERR_POSITION                    0x00000002
//#define _UCDSTA_FERR_MASK                        0x00000004
//#define _UCDSTA_FERR_LENGTH                      0x00000001

//#define _UCDSTA_PERR_POSITION                    0x00000003
//#define _UCDSTA_PERR_MASK                        0x00000008
//#define _UCDSTA_PERR_LENGTH                      0x00000001

//#define _UCDSTA_RIDLE_POSITION                   0x00000004
//#define _UCDSTA_RIDLE_MASK                       0x00000010
//#define _UCDSTA_RIDLE_LENGTH                     0x00000001

//#define _UCDSTA_ADDEN_POSITION                   0x00000005
//#define _UCDSTA_ADDEN_MASK                       0x00000020
//#define _UCDSTA_ADDEN_LENGTH                     0x00000001

//#define _UCDSTA_URXISEL_POSITION                 0x00000006
//#define _UCDSTA_URXISEL_MASK                     0x000000C0
//#define _UCDSTA_URXISEL_LENGTH                   0x00000002

//#define _UCDSTA_TRMT_POSITION                    0x00000008
//#define _UCDSTA_TRMT_MASK                        0x00000100
//#define _UCDSTA_TRMT_LENGTH                      0x00000001

//#define _UCDSTA_UTXBF_POSITION                   0x00000009
//#define _UCDSTA_UTXBF_MASK                       0x00000200
//#define _UCDSTA_UTXBF_LENGTH                     0x00000001

//#define _UCDSTA_UTXEN_POSITION                   0x0000000A
//#define _UCDSTA_UTXEN_MASK                       0x00000400
//#define _UCDSTA_UTXEN_LENGTH                     0x00000001

//#define _UCDSTA_UTXBRK_POSITION                  0x0000000B
//#define _UCDSTA_UTXBRK_MASK                      0x00000800
//#define _UCDSTA_UTXBRK_LENGTH                    0x00000001

//#define _UCDSTA_URXEN_POSITION                   0x0000000C
//#define _UCDSTA_URXEN_MASK                       0x00001000
//#define _UCDSTA_URXEN_LENGTH                     0x00000001

//#define _UCDSTA_UTXINV_POSITION                  0x0000000D
//#define _UCDSTA_UTXINV_MASK                      0x00002000
//#define _UCDSTA_UTXINV_LENGTH                    0x00000001

//#define _UCDSTA_UTXISEL_POSITION                 0x0000000E
//#define _UCDSTA_UTXISEL_MASK                     0x0000C000
//#define _UCDSTA_UTXISEL_LENGTH                   0x00000002

//#define _UCDSTA_ADDR_POSITION                    0x00000010
//#define _UCDSTA_ADDR_MASK                        0x00FF0000
//#define _UCDSTA_ADDR_LENGTH                      0x00000008

//#define _UCDSTA_ADM_EN_POSITION                  0x00000018
//#define _UCDSTA_ADM_EN_MASK                      0x01000000
//#define _UCDSTA_ADM_EN_LENGTH                    0x00000001

//#define _UCDSTA_URXISEL0_POSITION                0x00000006
//#define _UCDSTA_URXISEL0_MASK                    0x00000040
//#define _UCDSTA_URXISEL0_LENGTH                  0x00000001

//#define _UCDSTA_URXISEL1_POSITION                0x00000007
//#define _UCDSTA_URXISEL1_MASK                    0x00000080
//#define _UCDSTA_URXISEL1_LENGTH                  0x00000001

//#define _UCDSTA_UTXISEL0_POSITION                0x0000000E
//#define _UCDSTA_UTXISEL0_MASK                    0x00004000
//#define _UCDSTA_UTXISEL0_LENGTH                  0x00000001

//#define _UCDSTA_UTXISEL1_POSITION                0x0000000F
//#define _UCDSTA_UTXISEL1_MASK                    0x00008000
//#define _UCDSTA_UTXISEL1_LENGTH                  0x00000001

//#define _UCDSTA_UTXSEL_POSITION                  0x0000000E
//#define _UCDSTA_UTXSEL_MASK                      0x0000C000
//#define _UCDSTA_UTXSEL_LENGTH                    0x00000002

//#define _UCDSTA_w_POSITION                       0x00000000
//#define _UCDSTA_w_MASK                           0xFFFFFFFF
//#define _UCDSTA_w_LENGTH                         0x00000020

