HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ULMSTA_UTXEN_POSITION                   0x0000000A
//#define _ULMSTA_UTXEN_MASK                       0x00000400
//#define _ULMSTA_UTXEN_LENGTH                     0x00000001

//#define _ULMSTA_UTXBRK_POSITION                  0x0000000B
//#define _ULMSTA_UTXBRK_MASK                      0x00000800
//#define _ULMSTA_UTXBRK_LENGTH                    0x00000001

//#define _ULMSTA_URXEN_POSITION                   0x0000000C
//#define _ULMSTA_URXEN_MASK                       0x00001000
//#define _ULMSTA_URXEN_LENGTH                     0x00000001

//#define _ULMSTA_UTXINV_POSITION                  0x0000000D
//#define _ULMSTA_UTXINV_MASK                      0x00002000
//#define _ULMSTA_UTXINV_LENGTH                    0x00000001

//#define _ULMSTA_UTXISEL_POSITION                 0x0000000E
//#define _ULMSTA_UTXISEL_MASK                     0x0000C000
//#define _ULMSTA_UTXISEL_LENGTH                   0x00000002

//#define _ULMSTA_ADDR_POSITION                    0x00000010
//#define _ULMSTA_ADDR_MASK                        0x00FF0000
//#define _ULMSTA_ADDR_LENGTH                      0x00000008

//#define _ULMSTA_ADM_EN_POSITION                  0x00000018
//#define _ULMSTA_ADM_EN_MASK                      0x01000000
//#define _ULMSTA_ADM_EN_LENGTH                    0x00000001

//#define _ULMSTA_URXISEL0_POSITION                0x00000006
//#define _ULMSTA_URXISEL0_MASK                    0x00000040
//#define _ULMSTA_URXISEL0_LENGTH                  0x00000001

//#define _ULMSTA_URXISEL1_POSITION                0x00000007
//#define _ULMSTA_URXISEL1_MASK                    0x00000080
//#define _ULMSTA_URXISEL1_LENGTH                  0x00000001

//#define _ULMSTA_UTXISEL0_POSITION                0x0000000E
//#define _ULMSTA_UTXISEL0_MASK                    0x00004000
//#define _ULMSTA_UTXISEL0_LENGTH                  0x00000001

//#define _ULMSTA_UTXISEL1_POSITION                0x0000000F
//#define _ULMSTA_UTXISEL1_MASK                    0x00008000
//#define _ULMSTA_UTXISEL1_LENGTH                  0x00000001

//#define _ULMSTA_UTXSEL_POSITION                  0x0000000E
//#define _ULMSTA_UTXSEL_MASK                      0x0000C000
//#define _ULMSTA_UTXSEL_LENGTH                    0x00000002

//#define _ULMSTA_w_POSITION                       0x00000000
//#define _ULMSTA_w_MASK                           0xFFFFFFFF
//#define _ULMSTA_w_LENGTH                         0x00000020

//#define _PMCON_RDSP_POSITION                     0x00000000
//#define _PMCON_RDSP_MASK                         0x00000001
//#define _PMCON_RDSP_LENGTH                       0x00000001

//#define _PMCON_WRSP_POSITION                     0x00000001
//#define _PMCON_WRSP_MASK                         0x00000002
//#define _PMCON_WRSP_LENGTH                       0x00000001

//#define _PMCON_CS1P_POSITION                     0x00000003
//#define _PMCON_CS1P_MASK                         0x00000008
//#define _PMCON_CS1P_LENGTH                       0x00000001

//#define _PMCON_CS2P_POSITION                     0x00000004
//#define _PMCON_CS2P_MASK                         0x00000010
//#define _PMCON_CS2P_LENGTH                       0x00000001

//#define _PMCON_ALP_POSITION                      0x00000005
//#define _PMCON_ALP_MASK                          0x00000020
//#define _PMCON_ALP_LENGTH                        0x00000001

//#define _PMCON_CSF_POSITION                      0x00000006
//#define _PMCON_CSF_MASK                          0x000000C0
//#define _PMCON_CSF_LENGTH                        0x00000002

//#define _PMCON_PTRDEN_POSITION                   0x00000008
//#define _PMCON_PTRDEN_MASK                       0x00000100
//#define _PMCON_PTRDEN_LENGTH                     0x00000001

//#define _PMCON_PTWREN_POSITION                   0x00000009
//#define _PMCON_PTWREN_MASK                       0x00000200
//#define _PMCON_PTWREN_LENGTH                     0x00000001

//#define _PMCON_PMPTTL_POSITION                   0x0000000A
//#define _PMCON_PMPTTL_MASK                       0x00000400
//#define _PMCON_PMPTTL_LENGTH                     0x00000001

//#define _PMCON_ADRMUX_POSITION                   0x0000000B
//#define _PMCON_ADRMUX_MASK                       0x00001800
//#define _PMCON_ADRMUX_LENGTH                     0x00000002

//#define _PMCON_SIDL_POSITION                     0x0000000D
//#define _PMCON_SIDL_MASK                         0x00002000
//#define _PMCON_SIDL_LENGTH                       0x00000001

//#define _PMCON_ON_POSITION                       0x0000000F
//#define _PMCON_ON_MASK                           0x00008000
//#define _PMCON_ON_LENGTH                         0x00000001

//#define _PMCON_CSF0_POSITION                     0x00000006
//#define _PMCON_CSF0_MASK                         0x00000040
//#define _PMCON_CSF0_LENGTH                       0x00000001

//#define _PMCON_CSF1_POSITION                     0x00000007
//#define _PMCON_CSF1_MASK                         0x00000080
//#define _PMCON_CSF1_LENGTH                       0x00000001

//#define _PMCON_ADRMUX0_POSITION                  0x0000000B
//#define _PMCON_ADRMUX0_MASK                      0x00000800
//#define _PMCON_ADRMUX0_LENGTH                    0x00000001

//#define _PMCON_ADRMUX1_POSITION                  0x0000000C
//#define _PMCON_ADRMUX1_MASK                      0x00001000
//#define _PMCON_ADRMUX1_LENGTH                    0x00000001

//#define _PMCON_PSIDL_POSITION                    0x0000000D
//#define _PMCON_PSIDL_MASK                        0x00002000
//#define _PMCON_PSIDL_LENGTH                      0x00000001

//#define _PMCON_PMPEN_POSITION                    0x0000000F
//#define _PMCON_PMPEN_MASK                        0x00008000
//#define _PMCON_PMPEN_LENGTH                      0x00000001

//#define _PMCON_w_POSITION                        0x00000000
//#define _PMCON_w_MASK                            0xFFFFFFFF
//#define _PMCON_w_LENGTH                          0x00000020

//#define _PMMODE_WAITE_POSITION                   0x00000000
//#define _PMMODE_WAITE_MASK                       0x00000003
//#define _PMMODE_WAITE_LENGTH                     0x00000002

