HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _PMAEN_PTEN3_POSITION                    0x00000003
//#define _PMAEN_PTEN3_MASK                        0x00000008
//#define _PMAEN_PTEN3_LENGTH                      0x00000001

//#define _PMAEN_PTEN4_POSITION                    0x00000004
//#define _PMAEN_PTEN4_MASK                        0x00000010
//#define _PMAEN_PTEN4_LENGTH                      0x00000001

//#define _PMAEN_PTEN5_POSITION                    0x00000005
//#define _PMAEN_PTEN5_MASK                        0x00000020
//#define _PMAEN_PTEN5_LENGTH                      0x00000001

//#define _PMAEN_PTEN6_POSITION                    0x00000006
//#define _PMAEN_PTEN6_MASK                        0x00000040
//#define _PMAEN_PTEN6_LENGTH                      0x00000001

//#define _PMAEN_PTEN7_POSITION                    0x00000007
//#define _PMAEN_PTEN7_MASK                        0x00000080
//#define _PMAEN_PTEN7_LENGTH                      0x00000001

//#define _PMAEN_PTEN8_POSITION                    0x00000008
//#define _PMAEN_PTEN8_MASK                        0x00000100
//#define _PMAEN_PTEN8_LENGTH                      0x00000001

//#define _PMAEN_PTEN9_POSITION                    0x00000009
//#define _PMAEN_PTEN9_MASK                        0x00000200
//#define _PMAEN_PTEN9_LENGTH                      0x00000001

//#define _PMAEN_PTEN10_POSITION                   0x0000000A
//#define _PMAEN_PTEN10_MASK                       0x00000400
//#define _PMAEN_PTEN10_LENGTH                     0x00000001

//#define _PMAEN_PTEN11_POSITION                   0x0000000B
//#define _PMAEN_PTEN11_MASK                       0x00000800
//#define _PMAEN_PTEN11_LENGTH                     0x00000001

//#define _PMAEN_PTEN12_POSITION                   0x0000000C
//#define _PMAEN_PTEN12_MASK                       0x00001000
//#define _PMAEN_PTEN12_LENGTH                     0x00000001

//#define _PMAEN_PTEN13_POSITION                   0x0000000D
//#define _PMAEN_PTEN13_MASK                       0x00002000
//#define _PMAEN_PTEN13_LENGTH                     0x00000001

//#define _PMAEN_PTEN14_POSITION                   0x0000000E
//#define _PMAEN_PTEN14_MASK                       0x00004000
//#define _PMAEN_PTEN14_LENGTH                     0x00000001

//#define _PMAEN_PTEN15_POSITION                   0x0000000F
//#define _PMAEN_PTEN15_MASK                       0x00008000
//#define _PMAEN_PTEN15_LENGTH                     0x00000001

//#define _PMAEN_w_POSITION                        0x00000000
//#define _PMAEN_w_MASK                            0xFFFFFFFF
//#define _PMAEN_w_LENGTH                          0x00000020

//#define _PMSTAT_OB0E_POSITION                    0x00000000
//#define _PMSTAT_OB0E_MASK                        0x00000001
//#define _PMSTAT_OB0E_LENGTH                      0x00000001

//#define _PMSTAT_OB1E_POSITION                    0x00000001
//#define _PMSTAT_OB1E_MASK                        0x00000002
//#define _PMSTAT_OB1E_LENGTH                      0x00000001

//#define _PMSTAT_OB2E_POSITION                    0x00000002
//#define _PMSTAT_OB2E_MASK                        0x00000004
//#define _PMSTAT_OB2E_LENGTH                      0x00000001

//#define _PMSTAT_OB3E_POSITION                    0x00000003
//#define _PMSTAT_OB3E_MASK                        0x00000008
//#define _PMSTAT_OB3E_LENGTH                      0x00000001

//#define _PMSTAT_OBUF_POSITION                    0x00000006
//#define _PMSTAT_OBUF_MASK                        0x00000040
//#define _PMSTAT_OBUF_LENGTH                      0x00000001

//#define _PMSTAT_OBE_POSITION                     0x00000007
//#define _PMSTAT_OBE_MASK                         0x00000080
//#define _PMSTAT_OBE_LENGTH                       0x00000001

//#define _PMSTAT_IB0F_POSITION                    0x00000008
//#define _PMSTAT_IB0F_MASK                        0x00000100
//#define _PMSTAT_IB0F_LENGTH                      0x00000001

//#define _PMSTAT_IB1F_POSITION                    0x00000009
//#define _PMSTAT_IB1F_MASK                        0x00000200
//#define _PMSTAT_IB1F_LENGTH                      0x00000001

//#define _PMSTAT_IB2F_POSITION                    0x0000000A
//#define _PMSTAT_IB2F_MASK                        0x00000400
//#define _PMSTAT_IB2F_LENGTH                      0x00000001

//#define _PMSTAT_IB3F_POSITION                    0x0000000B
//#define _PMSTAT_IB3F_MASK                        0x00000800
//#define _PMSTAT_IB3F_LENGTH                      0x00000001

//#define _PMSTAT_IBOV_POSITION                    0x0000000E
//#define _PMSTAT_IBOV_MASK                        0x00004000
//#define _PMSTAT_IBOV_LENGTH                      0x00000001

//#define _PMSTAT_IBF_POSITION                     0x0000000F
//#define _PMSTAT_IBF_MASK                         0x00008000
//#define _PMSTAT_IBF_LENGTH                       0x00000001

//#define _PMSTAT_w_POSITION                       0x00000000
//#define _PMSTAT_w_MASK                           0xFFFFFFFF
//#define _PMSTAT_w_LENGTH                         0x00000020

//#define _T1CON_TCS_POSITION                      0x00000001
//#define _T1CON_TCS_MASK                          0x00000002
//#define _T1CON_TCS_LENGTH                        0x00000001

//#define _T1CON_TSYNC_POSITION                    0x00000002
//#define _T1CON_TSYNC_MASK                        0x00000004
//#define _T1CON_TSYNC_LENGTH                      0x00000001

//#define _T1CON_TCKPS_POSITION                    0x00000004
//#define _T1CON_TCKPS_MASK                        0x00000030
//#define _T1CON_TCKPS_LENGTH                      0x00000002

//#define _T1CON_TGATE_POSITION                    0x00000007
//#define _T1CON_TGATE_MASK                        0x00000080
//#define _T1CON_TGATE_LENGTH                      0x00000001

//#define _T1CON_TWIP_POSITION                     0x0000000B
//#define _T1CON_TWIP_MASK                         0x00000800
//#define _T1CON_TWIP_LENGTH                       0x00000001

//#define _T1CON_TWDIS_POSITION                    0x0000000C
//#define _T1CON_TWDIS_MASK                        0x00001000
//#define _T1CON_TWDIS_LENGTH                      0x00000001

//#define _T1CON_SIDL_POSITION                     0x0000000D
//#define _T1CON_SIDL_MASK                         0x00002000
//#define _T1CON_SIDL_LENGTH                       0x00000001

