HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _T7CON_ON_POSITION                       0x0000000F
//#define _T7CON_ON_MASK                           0x00008000
//#define _T7CON_ON_LENGTH                         0x00000001

//#define _T7CON_TCKPS0_POSITION                   0x00000004
//#define _T7CON_TCKPS0_MASK                       0x00000010
//#define _T7CON_TCKPS0_LENGTH                     0x00000001

//#define _T7CON_TCKPS1_POSITION                   0x00000005
//#define _T7CON_TCKPS1_MASK                       0x00000020
//#define _T7CON_TCKPS1_LENGTH                     0x00000001

//#define _T7CON_TCKPS2_POSITION                   0x00000006
//#define _T7CON_TCKPS2_MASK                       0x00000040
//#define _T7CON_TCKPS2_LENGTH                     0x00000001

//#define _T7CON_TSIDL_POSITION                    0x0000000D
//#define _T7CON_TSIDL_MASK                        0x00002000
//#define _T7CON_TSIDL_LENGTH                      0x00000001

//#define _T7CON_TON_POSITION                      0x0000000F
//#define _T7CON_TON_MASK                          0x00008000
//#define _T7CON_TON_LENGTH                        0x00000001

//#define _T7CON_w_POSITION                        0x00000000
//#define _T7CON_w_MASK                            0xFFFFFFFF
//#define _T7CON_w_LENGTH                          0x00000020

//#define _T8CON_TCS_POSITION                      0x00000001
//#define _T8CON_TCS_MASK                          0x00000002
//#define _T8CON_TCS_LENGTH                        0x00000001

//#define _T8CON_T32_POSITION                      0x00000003
//#define _T8CON_T32_MASK                          0x00000008
//#define _T8CON_T32_LENGTH                        0x00000001

//#define _T8CON_TCKPS_POSITION                    0x00000004
//#define _T8CON_TCKPS_MASK                        0x00000070
//#define _T8CON_TCKPS_LENGTH                      0x00000003

//#define _T8CON_TGATE_POSITION                    0x00000007
//#define _T8CON_TGATE_MASK                        0x00000080
//#define _T8CON_TGATE_LENGTH                      0x00000001

//#define _T8CON_SIDL_POSITION                     0x0000000D
//#define _T8CON_SIDL_MASK                         0x00002000
//#define _T8CON_SIDL_LENGTH                       0x00000001

//#define _T8CON_ON_POSITION                       0x0000000F
//#define _T8CON_ON_MASK                           0x00008000
//#define _T8CON_ON_LENGTH                         0x00000001

//#define _T8CON_TCKPS0_POSITION                   0x00000004
//#define _T8CON_TCKPS0_MASK                       0x00000010
//#define _T8CON_TCKPS0_LENGTH                     0x00000001

//#define _T8CON_TCKPS1_POSITION                   0x00000005
//#define _T8CON_TCKPS1_MASK                       0x00000020
//#define _T8CON_TCKPS1_LENGTH                     0x00000001

//#define _T8CON_TCKPS2_POSITION                   0x00000006
//#define _T8CON_TCKPS2_MASK                       0x00000040
//#define _T8CON_TCKPS2_LENGTH                     0x00000001

//#define _T8CON_TSIDL_POSITION                    0x0000000D
//#define _T8CON_TSIDL_MASK                        0x00002000
//#define _T8CON_TSIDL_LENGTH                      0x00000001

//#define _T8CON_TON_POSITION                      0x0000000F
//#define _T8CON_TON_MASK                          0x00008000
//#define _T8CON_TON_LENGTH                        0x00000001

//#define _T8CON_w_POSITION                        0x00000000
//#define _T8CON_w_MASK                            0xFFFFFFFF
//#define _T8CON_w_LENGTH                          0x00000020

//#define _T9CON_TCS_POSITION                      0x00000001
//#define _T9CON_TCS_MASK                          0x00000002
//#define _T9CON_TCS_LENGTH                        0x00000001

//#define _T9CON_TCKPS_POSITION                    0x00000004
//#define _T9CON_TCKPS_MASK                        0x00000070
//#define _T9CON_TCKPS_LENGTH                      0x00000003

//#define _T9CON_TGATE_POSITION                    0x00000007
//#define _T9CON_TGATE_MASK                        0x00000080
//#define _T9CON_TGATE_LENGTH                      0x00000001

//#define _T9CON_SIDL_POSITION                     0x0000000D
//#define _T9CON_SIDL_MASK                         0x00002000
//#define _T9CON_SIDL_LENGTH                       0x00000001

//#define _T9CON_ON_POSITION                       0x0000000F
//#define _T9CON_ON_MASK                           0x00008000
//#define _T9CON_ON_LENGTH                         0x00000001

//#define _T9CON_TCKPS0_POSITION                   0x00000004
//#define _T9CON_TCKPS0_MASK                       0x00000010
//#define _T9CON_TCKPS0_LENGTH                     0x00000001

//#define _T9CON_TCKPS1_POSITION                   0x00000005
//#define _T9CON_TCKPS1_MASK                       0x00000020
//#define _T9CON_TCKPS1_LENGTH                     0x00000001

//#define _T9CON_TCKPS2_POSITION                   0x00000006
//#define _T9CON_TCKPS2_MASK                       0x00000040
//#define _T9CON_TCKPS2_LENGTH                     0x00000001

//#define _T9CON_TSIDL_POSITION                    0x0000000D
//#define _T9CON_TSIDL_MASK                        0x00002000
//#define _T9CON_TSIDL_LENGTH                      0x00000001

//#define _T9CON_TON_POSITION                      0x0000000F
//#define _T9CON_TON_MASK                          0x00008000
//#define _T9CON_TON_LENGTH                        0x00000001

//#define _T9CON_w_POSITION                        0x00000000
//#define _T9CON_w_MASK                            0xFFFFFFFF
//#define _T9CON_w_LENGTH                          0x00000020

//#define _IC1CON_ICM_POSITION                     0x00000000
//#define _IC1CON_ICM_MASK                         0x00000007
//#define _IC1CON_ICM_LENGTH                       0x00000003

//#define _IC1CON_ICBNE_POSITION                   0x00000003
//#define _IC1CON_ICBNE_MASK                       0x00000008
//#define _IC1CON_ICBNE_LENGTH                     0x00000001

//#define _IC1CON_ICOV_POSITION                    0x00000004
//#define _IC1CON_ICOV_MASK                        0x00000010
//#define _IC1CON_ICOV_LENGTH                      0x00000001

//#define _IC1CON_ICI_POSITION                     0x00000005
//#define _IC1CON_ICI_MASK                         0x00000060
//#define _IC1CON_ICI_LENGTH                       0x00000002

//#define _IC1CON_ICTMR_POSITION                   0x00000007
//#define _IC1CON_ICTMR_MASK                       0x00000080
//#define _IC1CON_ICTMR_LENGTH                     0x00000001

//#define _IC1CON_C32_POSITION                     0x00000008
//#define _IC1CON_C32_MASK                         0x00000100
//#define _IC1CON_C32_LENGTH                       0x00000001

