HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _AD1CSS1_CSS14_POSITION                  0x0000000E
//#define _AD1CSS1_CSS14_MASK                      0x00004000
//#define _AD1CSS1_CSS14_LENGTH                    0x00000001

//#define _AD1CSS1_CSS15_POSITION                  0x0000000F
//#define _AD1CSS1_CSS15_MASK                      0x00008000
//#define _AD1CSS1_CSS15_LENGTH                    0x00000001

//#define _AD1CSS1_CSS16_POSITION                  0x00000010
//#define _AD1CSS1_CSS16_MASK                      0x00010000
//#define _AD1CSS1_CSS16_LENGTH                    0x00000001

//#define _AD1CSS1_CSS17_POSITION                  0x00000011
//#define _AD1CSS1_CSS17_MASK                      0x00020000
//#define _AD1CSS1_CSS17_LENGTH                    0x00000001

//#define _AD1CSS1_CSS18_POSITION                  0x00000012
//#define _AD1CSS1_CSS18_MASK                      0x00040000
//#define _AD1CSS1_CSS18_LENGTH                    0x00000001

//#define _AD1CSS1_CSS19_POSITION                  0x00000013
//#define _AD1CSS1_CSS19_MASK                      0x00080000
//#define _AD1CSS1_CSS19_LENGTH                    0x00000001

//#define _AD1CSS1_CSS20_POSITION                  0x00000014
//#define _AD1CSS1_CSS20_MASK                      0x00100000
//#define _AD1CSS1_CSS20_LENGTH                    0x00000001

//#define _AD1CSS1_CSS21_POSITION                  0x00000015
//#define _AD1CSS1_CSS21_MASK                      0x00200000
//#define _AD1CSS1_CSS21_LENGTH                    0x00000001

//#define _AD1CSS1_CSS22_POSITION                  0x00000016
//#define _AD1CSS1_CSS22_MASK                      0x00400000
//#define _AD1CSS1_CSS22_LENGTH                    0x00000001

//#define _AD1CSS1_CSS23_POSITION                  0x00000017
//#define _AD1CSS1_CSS23_MASK                      0x00800000
//#define _AD1CSS1_CSS23_LENGTH                    0x00000001

//#define _AD1CSS1_CSS24_POSITION                  0x00000018
//#define _AD1CSS1_CSS24_MASK                      0x01000000
//#define _AD1CSS1_CSS24_LENGTH                    0x00000001

//#define _AD1CSS1_CSS25_POSITION                  0x00000019
//#define _AD1CSS1_CSS25_MASK                      0x02000000
//#define _AD1CSS1_CSS25_LENGTH                    0x00000001

//#define _AD1CSS1_CSS26_POSITION                  0x0000001A
//#define _AD1CSS1_CSS26_MASK                      0x04000000
//#define _AD1CSS1_CSS26_LENGTH                    0x00000001

//#define _AD1CSS1_CSS27_POSITION                  0x0000001B
//#define _AD1CSS1_CSS27_MASK                      0x08000000
//#define _AD1CSS1_CSS27_LENGTH                    0x00000001

//#define _AD1CSS1_CSS28_POSITION                  0x0000001C
//#define _AD1CSS1_CSS28_MASK                      0x10000000
//#define _AD1CSS1_CSS28_LENGTH                    0x00000001

//#define _AD1CSS1_CSS29_POSITION                  0x0000001D
//#define _AD1CSS1_CSS29_MASK                      0x20000000
//#define _AD1CSS1_CSS29_LENGTH                    0x00000001

//#define _AD1CSS1_CSS30_POSITION                  0x0000001E
//#define _AD1CSS1_CSS30_MASK                      0x40000000
//#define _AD1CSS1_CSS30_LENGTH                    0x00000001

//#define _AD1CSS1_CSS31_POSITION                  0x0000001F
//#define _AD1CSS1_CSS31_MASK                      0x80000000
//#define _AD1CSS1_CSS31_LENGTH                    0x00000001

//#define _AD1CSS2_CSS32_POSITION                  0x00000000
//#define _AD1CSS2_CSS32_MASK                      0x00000001
//#define _AD1CSS2_CSS32_LENGTH                    0x00000001

//#define _AD1CSS2_CSS33_POSITION                  0x00000001
//#define _AD1CSS2_CSS33_MASK                      0x00000002
//#define _AD1CSS2_CSS33_LENGTH                    0x00000001

//#define _AD1CSS2_CSS34_POSITION                  0x00000002
//#define _AD1CSS2_CSS34_MASK                      0x00000004
//#define _AD1CSS2_CSS34_LENGTH                    0x00000001

//#define _AD1CSS2_CSS43_POSITION                  0x0000000B
//#define _AD1CSS2_CSS43_MASK                      0x00000800
//#define _AD1CSS2_CSS43_LENGTH                    0x00000001

//#define _AD1CSS2_CSS44_POSITION                  0x0000000C
//#define _AD1CSS2_CSS44_MASK                      0x00001000
//#define _AD1CSS2_CSS44_LENGTH                    0x00000001

//#define _AD1DSTAT1_ARDY0_POSITION                0x00000000
//#define _AD1DSTAT1_ARDY0_MASK                    0x00000001
//#define _AD1DSTAT1_ARDY0_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY1_POSITION                0x00000001
//#define _AD1DSTAT1_ARDY1_MASK                    0x00000002
//#define _AD1DSTAT1_ARDY1_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY2_POSITION                0x00000002
//#define _AD1DSTAT1_ARDY2_MASK                    0x00000004
//#define _AD1DSTAT1_ARDY2_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY3_POSITION                0x00000003
//#define _AD1DSTAT1_ARDY3_MASK                    0x00000008
//#define _AD1DSTAT1_ARDY3_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY4_POSITION                0x00000004
//#define _AD1DSTAT1_ARDY4_MASK                    0x00000010
//#define _AD1DSTAT1_ARDY4_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY5_POSITION                0x00000005
//#define _AD1DSTAT1_ARDY5_MASK                    0x00000020
//#define _AD1DSTAT1_ARDY5_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY6_POSITION                0x00000006
//#define _AD1DSTAT1_ARDY6_MASK                    0x00000040
//#define _AD1DSTAT1_ARDY6_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY7_POSITION                0x00000007
//#define _AD1DSTAT1_ARDY7_MASK                    0x00000080
//#define _AD1DSTAT1_ARDY7_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY8_POSITION                0x00000008
//#define _AD1DSTAT1_ARDY8_MASK                    0x00000100
//#define _AD1DSTAT1_ARDY8_LENGTH                  0x00000001

//#define _AD1DSTAT1_ARDY9_POSITION                0x00000009
//#define _AD1DSTAT1_ARDY9_MASK                    0x00000200
//#define _AD1DSTAT1_ARDY9_LENGTH                  0x00000001

