HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _AD1DSTAT1_ARDY10_POSITION               0x0000000A
//#define _AD1DSTAT1_ARDY10_MASK                   0x00000400
//#define _AD1DSTAT1_ARDY10_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY11_POSITION               0x0000000B
//#define _AD1DSTAT1_ARDY11_MASK                   0x00000800
//#define _AD1DSTAT1_ARDY11_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY12_POSITION               0x0000000C
//#define _AD1DSTAT1_ARDY12_MASK                   0x00001000
//#define _AD1DSTAT1_ARDY12_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY13_POSITION               0x0000000D
//#define _AD1DSTAT1_ARDY13_MASK                   0x00002000
//#define _AD1DSTAT1_ARDY13_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY14_POSITION               0x0000000E
//#define _AD1DSTAT1_ARDY14_MASK                   0x00004000
//#define _AD1DSTAT1_ARDY14_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY15_POSITION               0x0000000F
//#define _AD1DSTAT1_ARDY15_MASK                   0x00008000
//#define _AD1DSTAT1_ARDY15_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY16_POSITION               0x00000010
//#define _AD1DSTAT1_ARDY16_MASK                   0x00010000
//#define _AD1DSTAT1_ARDY16_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY17_POSITION               0x00000011
//#define _AD1DSTAT1_ARDY17_MASK                   0x00020000
//#define _AD1DSTAT1_ARDY17_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY18_POSITION               0x00000012
//#define _AD1DSTAT1_ARDY18_MASK                   0x00040000
//#define _AD1DSTAT1_ARDY18_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY19_POSITION               0x00000013
//#define _AD1DSTAT1_ARDY19_MASK                   0x00080000
//#define _AD1DSTAT1_ARDY19_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY20_POSITION               0x00000014
//#define _AD1DSTAT1_ARDY20_MASK                   0x00100000
//#define _AD1DSTAT1_ARDY20_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY21_POSITION               0x00000015
//#define _AD1DSTAT1_ARDY21_MASK                   0x00200000
//#define _AD1DSTAT1_ARDY21_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY22_POSITION               0x00000016
//#define _AD1DSTAT1_ARDY22_MASK                   0x00400000
//#define _AD1DSTAT1_ARDY22_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY23_POSITION               0x00000017
//#define _AD1DSTAT1_ARDY23_MASK                   0x00800000
//#define _AD1DSTAT1_ARDY23_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY24_POSITION               0x00000018
//#define _AD1DSTAT1_ARDY24_MASK                   0x01000000
//#define _AD1DSTAT1_ARDY24_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY25_POSITION               0x00000019
//#define _AD1DSTAT1_ARDY25_MASK                   0x02000000
//#define _AD1DSTAT1_ARDY25_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY26_POSITION               0x0000001A
//#define _AD1DSTAT1_ARDY26_MASK                   0x04000000
//#define _AD1DSTAT1_ARDY26_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY27_POSITION               0x0000001B
//#define _AD1DSTAT1_ARDY27_MASK                   0x08000000
//#define _AD1DSTAT1_ARDY27_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY28_POSITION               0x0000001C
//#define _AD1DSTAT1_ARDY28_MASK                   0x10000000
//#define _AD1DSTAT1_ARDY28_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY29_POSITION               0x0000001D
//#define _AD1DSTAT1_ARDY29_MASK                   0x20000000
//#define _AD1DSTAT1_ARDY29_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY30_POSITION               0x0000001E
//#define _AD1DSTAT1_ARDY30_MASK                   0x40000000
//#define _AD1DSTAT1_ARDY30_LENGTH                 0x00000001

//#define _AD1DSTAT1_ARDY31_POSITION               0x0000001F
//#define _AD1DSTAT1_ARDY31_MASK                   0x80000000
//#define _AD1DSTAT1_ARDY31_LENGTH                 0x00000001

//#define _AD1DSTAT2_ARDY32_POSITION               0x00000000
//#define _AD1DSTAT2_ARDY32_MASK                   0x00000001
//#define _AD1DSTAT2_ARDY32_LENGTH                 0x00000001

//#define _AD1DSTAT2_ARDY33_POSITION               0x00000001
//#define _AD1DSTAT2_ARDY33_MASK                   0x00000002
//#define _AD1DSTAT2_ARDY33_LENGTH                 0x00000001

//#define _AD1DSTAT2_ARDY34_POSITION               0x00000002
//#define _AD1DSTAT2_ARDY34_MASK                   0x00000004
//#define _AD1DSTAT2_ARDY34_LENGTH                 0x00000001

//#define _AD1DSTAT2_ARDY43_POSITION               0x0000000B
//#define _AD1DSTAT2_ARDY43_MASK                   0x00000800
//#define _AD1DSTAT2_ARDY43_LENGTH                 0x00000001

//#define _AD1DSTAT2_ARDY44_POSITION               0x0000000C
//#define _AD1DSTAT2_ARDY44_MASK                   0x00001000
//#define _AD1DSTAT2_ARDY44_LENGTH                 0x00000001

//#define _AD1CMPEN1_CMPE0_POSITION                0x00000000
//#define _AD1CMPEN1_CMPE0_MASK                    0x00000001
//#define _AD1CMPEN1_CMPE0_LENGTH                  0x00000001

//#define _AD1CMPEN1_CMPE1_POSITION                0x00000001
//#define _AD1CMPEN1_CMPE1_MASK                    0x00000002
//#define _AD1CMPEN1_CMPE1_LENGTH                  0x00000001

//#define _AD1CMPEN1_CMPE2_POSITION                0x00000002
//#define _AD1CMPEN1_CMPE2_MASK                    0x00000004
//#define _AD1CMPEN1_CMPE2_LENGTH                  0x00000001

//#define _AD1CMPEN1_CMPE3_POSITION                0x00000003
//#define _AD1CMPEN1_CMPE3_MASK                    0x00000008
//#define _AD1CMPEN1_CMPE3_LENGTH                  0x00000001

//#define _AD1CMPEN1_CMPE4_POSITION                0x00000004
//#define _AD1CMPEN1_CMPE4_MASK                    0x00000010
//#define _AD1CMPEN1_CMPE4_LENGTH                  0x00000001

//#define _AD1CMPEN1_CMPE5_POSITION                0x00000005
//#define _AD1CMPEN1_CMPE5_MASK                    0x00000020
//#define _AD1CMPEN1_CMPE5_LENGTH                  0x00000001

//#define _AD1CMPEN1_CMPE6_POSITION                0x00000006
//#define _AD1CMPEN1_CMPE6_MASK                    0x00000040
//#define _AD1CMPEN1_CMPE6_LENGTH                  0x00000001

