HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _AD1CMPEN6_CMPE12_POSITION               0x0000000C
//#define _AD1CMPEN6_CMPE12_MASK                   0x00001000
//#define _AD1CMPEN6_CMPE12_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE13_POSITION               0x0000000D
//#define _AD1CMPEN6_CMPE13_MASK                   0x00002000
//#define _AD1CMPEN6_CMPE13_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE14_POSITION               0x0000000E
//#define _AD1CMPEN6_CMPE14_MASK                   0x00004000
//#define _AD1CMPEN6_CMPE14_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE15_POSITION               0x0000000F
//#define _AD1CMPEN6_CMPE15_MASK                   0x00008000
//#define _AD1CMPEN6_CMPE15_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE16_POSITION               0x00000010
//#define _AD1CMPEN6_CMPE16_MASK                   0x00010000
//#define _AD1CMPEN6_CMPE16_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE17_POSITION               0x00000011
//#define _AD1CMPEN6_CMPE17_MASK                   0x00020000
//#define _AD1CMPEN6_CMPE17_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE18_POSITION               0x00000012
//#define _AD1CMPEN6_CMPE18_MASK                   0x00040000
//#define _AD1CMPEN6_CMPE18_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE19_POSITION               0x00000013
//#define _AD1CMPEN6_CMPE19_MASK                   0x00080000
//#define _AD1CMPEN6_CMPE19_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE20_POSITION               0x00000014
//#define _AD1CMPEN6_CMPE20_MASK                   0x00100000
//#define _AD1CMPEN6_CMPE20_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE21_POSITION               0x00000015
//#define _AD1CMPEN6_CMPE21_MASK                   0x00200000
//#define _AD1CMPEN6_CMPE21_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE22_POSITION               0x00000016
//#define _AD1CMPEN6_CMPE22_MASK                   0x00400000
//#define _AD1CMPEN6_CMPE22_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE23_POSITION               0x00000017
//#define _AD1CMPEN6_CMPE23_MASK                   0x00800000
//#define _AD1CMPEN6_CMPE23_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE24_POSITION               0x00000018
//#define _AD1CMPEN6_CMPE24_MASK                   0x01000000
//#define _AD1CMPEN6_CMPE24_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE25_POSITION               0x00000019
//#define _AD1CMPEN6_CMPE25_MASK                   0x02000000
//#define _AD1CMPEN6_CMPE25_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE26_POSITION               0x0000001A
//#define _AD1CMPEN6_CMPE26_MASK                   0x04000000
//#define _AD1CMPEN6_CMPE26_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE27_POSITION               0x0000001B
//#define _AD1CMPEN6_CMPE27_MASK                   0x08000000
//#define _AD1CMPEN6_CMPE27_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE28_POSITION               0x0000001C
//#define _AD1CMPEN6_CMPE28_MASK                   0x10000000
//#define _AD1CMPEN6_CMPE28_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE29_POSITION               0x0000001D
//#define _AD1CMPEN6_CMPE29_MASK                   0x20000000
//#define _AD1CMPEN6_CMPE29_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE30_POSITION               0x0000001E
//#define _AD1CMPEN6_CMPE30_MASK                   0x40000000
//#define _AD1CMPEN6_CMPE30_LENGTH                 0x00000001

//#define _AD1CMPEN6_CMPE31_POSITION               0x0000001F
//#define _AD1CMPEN6_CMPE31_MASK                   0x80000000
//#define _AD1CMPEN6_CMPE31_LENGTH                 0x00000001

//#define _AD1CMP6_ADCMPLO_POSITION                0x00000000
//#define _AD1CMP6_ADCMPLO_MASK                    0x0000FFFF
//#define _AD1CMP6_ADCMPLO_LENGTH                  0x00000010

//#define _AD1CMP6_ADCMPHI_POSITION                0x00000010
//#define _AD1CMP6_ADCMPHI_MASK                    0xFFFF0000
//#define _AD1CMP6_ADCMPHI_LENGTH                  0x00000010

//#define _AD1FLTR1_FLTRDATA_POSITION              0x00000000
//#define _AD1FLTR1_FLTRDATA_MASK                  0x0000FFFF
//#define _AD1FLTR1_FLTRDATA_LENGTH                0x00000010

//#define _AD1FLTR1_CHNLID_POSITION                0x00000010
//#define _AD1FLTR1_CHNLID_MASK                    0x003F0000
//#define _AD1FLTR1_CHNLID_LENGTH                  0x00000006

//#define _AD1FLTR1_AFRDY_POSITION                 0x00000018
//#define _AD1FLTR1_AFRDY_MASK                     0x01000000
//#define _AD1FLTR1_AFRDY_LENGTH                   0x00000001

//#define _AD1FLTR1_AFGIEN_POSITION                0x00000019
//#define _AD1FLTR1_AFGIEN_MASK                    0x02000000
//#define _AD1FLTR1_AFGIEN_LENGTH                  0x00000001

//#define _AD1FLTR1_OVRSAM_POSITION                0x0000001A
//#define _AD1FLTR1_OVRSAM_MASK                    0x1C000000
//#define _AD1FLTR1_OVRSAM_LENGTH                  0x00000003

//#define _AD1FLTR1_AFEN_POSITION                  0x0000001F
//#define _AD1FLTR1_AFEN_MASK                      0x80000000
//#define _AD1FLTR1_AFEN_LENGTH                    0x00000001

//#define _AD1FLTR2_FLTRDATA_POSITION              0x00000000
//#define _AD1FLTR2_FLTRDATA_MASK                  0x0000FFFF
//#define _AD1FLTR2_FLTRDATA_LENGTH                0x00000010

//#define _AD1FLTR2_CHNLID_POSITION                0x00000010
//#define _AD1FLTR2_CHNLID_MASK                    0x003F0000
//#define _AD1FLTR2_CHNLID_LENGTH                  0x00000006

//#define _AD1FLTR2_AFRDY_POSITION                 0x00000018
//#define _AD1FLTR2_AFRDY_MASK                     0x01000000
//#define _AD1FLTR2_AFRDY_LENGTH                   0x00000001

//#define _AD1FLTR2_AFGIEN_POSITION                0x00000019
//#define _AD1FLTR2_AFGIEN_MASK                    0x02000000
//#define _AD1FLTR2_AFGIEN_LENGTH                  0x00000001

//#define _AD1FLTR2_OVRSAM_POSITION                0x0000001A
//#define _AD1FLTR2_OVRSAM_MASK                    0x1C000000
//#define _AD1FLTR2_OVRSAM_LENGTH                  0x00000003

//#define _AD1FLTR2_AFEN_POSITION                  0x0000001F
//#define _AD1FLTR2_AFEN_MASK                      0x80000000
//#define _AD1FLTR2_AFEN_LENGTH                    0x00000001

//#define _AD1FLTR3_FLTRDATA_POSITION              0x00000000
//#define _AD1FLTR3_FLTRDATA_MASK                  0x0000FFFF
//#define _AD1FLTR3_FLTRDATA_LENGTH                0x00000010

//#define _AD1FLTR3_CHNLID_POSITION                0x00000010
//#define _AD1FLTR3_CHNLID_MASK                    0x003F0000
//#define _AD1FLTR3_CHNLID_LENGTH                  0x00000006

//#define _AD1FLTR3_AFRDY_POSITION                 0x00000018
//#define _AD1FLTR3_AFRDY_MASK                     0x01000000
//#define _AD1FLTR3_AFRDY_LENGTH                   0x00000001

//#define _AD1FLTR3_AFGIEN_POSITION                0x00000019
//#define _AD1FLTR3_AFGIEN_MASK                    0x02000000
//#define _AD1FLTR3_AFGIEN_LENGTH                  0x00000001

//#define _AD1FLTR3_OVRSAM_POSITION                0x0000001A
//#define _AD1FLTR3_OVRSAM_MASK                    0x1C000000
//#define _AD1FLTR3_OVRSAM_LENGTH                  0x00000003

//#define _AD1FLTR3_AFEN_POSITION                  0x0000001F
//#define _AD1FLTR3_AFEN_MASK                      0x80000000
//#define _AD1FLTR3_AFEN_LENGTH                    0x00000001

//#define _AD1FLTR4_FLTRDATA_POSITION              0x00000000
//#define _AD1FLTR4_FLTRDATA_MASK                  0x0000FFFF
//#define _AD1FLTR4_FLTRDATA_LENGTH                0x00000010

//#define _AD1FLTR4_CHNLID_POSITION                0x00000010
//#define _AD1FLTR4_CHNLID_MASK                    0x003F0000
//#define _AD1FLTR4_CHNLID_LENGTH                  0x00000006

//#define _AD1FLTR4_AFRDY_POSITION                 0x00000018
//#define _AD1FLTR4_AFRDY_MASK                     0x01000000
//#define _AD1FLTR4_AFRDY_LENGTH                   0x00000001

//#define _AD1FLTR4_AFGIEN_POSITION                0x00000019
//#define _AD1FLTR4_AFGIEN_MASK                    0x02000000
//#define _AD1FLTR4_AFGIEN_LENGTH                  0x00000001

//#define _AD1FLTR4_OVRSAM_POSITION                0x0000001A
//#define _AD1FLTR4_OVRSAM_MASK                    0x1C000000
//#define _AD1FLTR4_OVRSAM_LENGTH                  0x00000003

//#define _AD1FLTR4_AFEN_POSITION                  0x0000001F
//#define _AD1FLTR4_AFEN_MASK                      0x80000000
//#define _AD1FLTR4_AFEN_LENGTH                    0x00000001

//#define _AD1FLTR5_FLTRDATA_POSITION              0x00000000
//#define _AD1FLTR5_FLTRDATA_MASK                  0x0000FFFF
//#define _AD1FLTR5_FLTRDATA_LENGTH                0x00000010

//#define _AD1FLTR5_CHNLID_POSITION                0x00000010
//#define _AD1FLTR5_CHNLID_MASK                    0x003F0000
//#define _AD1FLTR5_CHNLID_LENGTH                  0x00000006

//#define _AD1FLTR5_AFRDY_POSITION                 0x00000018
//#define _AD1FLTR5_AFRDY_MASK                     0x01000000
//#define _AD1FLTR5_AFRDY_LENGTH                   0x00000001

//#define _AD1FLTR5_AFGIEN_POSITION                0x00000019
//#define _AD1FLTR5_AFGIEN_MASK                    0x02000000
//#define _AD1FLTR5_AFGIEN_LENGTH                  0x00000001

//#define _AD1FLTR5_OVRSAM_POSITION                0x0000001A
//#define _AD1FLTR5_OVRSAM_MASK                    0x1C000000
//#define _AD1FLTR5_OVRSAM_LENGTH                  0x00000003

//#define _AD1FLTR5_AFEN_POSITION                  0x0000001F
//#define _AD1FLTR5_AFEN_MASK                      0x80000000
//#define _AD1FLTR5_AFEN_LENGTH                    0x00000001

//#define _AD1FLTR6_FLTRDATA_POSITION              0x00000000
//#define _AD1FLTR6_FLTRDATA_MASK                  0x0000FFFF
//#define _AD1FLTR6_FLTRDATA_LENGTH                0x00000010

//#define _AD1FLTR6_CHNLID_POSITION                0x00000010
//#define _AD1FLTR6_CHNLID_MASK                    0x003F0000
//#define _AD1FLTR6_CHNLID_LENGTH                  0x00000006

//#define _AD1FLTR6_AFRDY_POSITION                 0x00000018
//#define _AD1FLTR6_AFRDY_MASK                     0x01000000
//#define _AD1FLTR6_AFRDY_LENGTH                   0x00000001

