HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _AD1FLTR6_AFGIEN_POSITION                0x00000019
//#define _AD1FLTR6_AFGIEN_MASK                    0x02000000
//#define _AD1FLTR6_AFGIEN_LENGTH                  0x00000001

//#define _AD1FLTR6_OVRSAM_POSITION                0x0000001A
//#define _AD1FLTR6_OVRSAM_MASK                    0x1C000000
//#define _AD1FLTR6_OVRSAM_LENGTH                  0x00000003

//#define _AD1FLTR6_AFEN_POSITION                  0x0000001F
//#define _AD1FLTR6_AFEN_MASK                      0x80000000
//#define _AD1FLTR6_AFEN_LENGTH                    0x00000001

//#define _AD1TRG1_TRGSRC0_POSITION                0x00000000
//#define _AD1TRG1_TRGSRC0_MASK                    0x0000001F
//#define _AD1TRG1_TRGSRC0_LENGTH                  0x00000005

//#define _AD1TRG1_TRGSRC1_POSITION                0x00000008
//#define _AD1TRG1_TRGSRC1_MASK                    0x00001F00
//#define _AD1TRG1_TRGSRC1_LENGTH                  0x00000005

//#define _AD1TRG1_TRGSRC2_POSITION                0x00000010
//#define _AD1TRG1_TRGSRC2_MASK                    0x001F0000
//#define _AD1TRG1_TRGSRC2_LENGTH                  0x00000005

//#define _AD1TRG1_TRGSRC3_POSITION                0x00000018
//#define _AD1TRG1_TRGSRC3_MASK                    0x1F000000
//#define _AD1TRG1_TRGSRC3_LENGTH                  0x00000005

//#define _AD1TRG2_TRGSRC4_POSITION                0x00000000
//#define _AD1TRG2_TRGSRC4_MASK                    0x0000001F
//#define _AD1TRG2_TRGSRC4_LENGTH                  0x00000005

//#define _AD1TRG2_TRGSRC5_POSITION                0x00000008
//#define _AD1TRG2_TRGSRC5_MASK                    0x00001F00
//#define _AD1TRG2_TRGSRC5_LENGTH                  0x00000005

//#define _AD1TRG2_TRGSRC6_POSITION                0x00000010
//#define _AD1TRG2_TRGSRC6_MASK                    0x001F0000
//#define _AD1TRG2_TRGSRC6_LENGTH                  0x00000005

//#define _AD1TRG2_TRGSRC7_POSITION                0x00000018
//#define _AD1TRG2_TRGSRC7_MASK                    0x1F000000
//#define _AD1TRG2_TRGSRC7_LENGTH                  0x00000005

//#define _AD1TRG3_TRGSRC8_POSITION                0x00000000
//#define _AD1TRG3_TRGSRC8_MASK                    0x0000001F
//#define _AD1TRG3_TRGSRC8_LENGTH                  0x00000005

//#define _AD1TRG3_TRGSRC9_POSITION                0x00000008
//#define _AD1TRG3_TRGSRC9_MASK                    0x00001F00
//#define _AD1TRG3_TRGSRC9_LENGTH                  0x00000005

//#define _AD1TRG3_TRGSRC10_POSITION               0x00000010
//#define _AD1TRG3_TRGSRC10_MASK                   0x001F0000
//#define _AD1TRG3_TRGSRC10_LENGTH                 0x00000005

//#define _AD1TRG3_TRGSRC11_POSITION               0x00000018
//#define _AD1TRG3_TRGSRC11_MASK                   0x1F000000
//#define _AD1TRG3_TRGSRC11_LENGTH                 0x00000005

//#define _AD1CMPCON1_IELOLO_POSITION              0x00000000
//#define _AD1CMPCON1_IELOLO_MASK                  0x00000001
//#define _AD1CMPCON1_IELOLO_LENGTH                0x00000001

//#define _AD1CMPCON1_IELOHI_POSITION              0x00000001
//#define _AD1CMPCON1_IELOHI_MASK                  0x00000002
//#define _AD1CMPCON1_IELOHI_LENGTH                0x00000001

//#define _AD1CMPCON1_IEHILO_POSITION              0x00000002
//#define _AD1CMPCON1_IEHILO_MASK                  0x00000004
//#define _AD1CMPCON1_IEHILO_LENGTH                0x00000001

//#define _AD1CMPCON1_IEHIHI_POSITION              0x00000003
//#define _AD1CMPCON1_IEHIHI_MASK                  0x00000008
//#define _AD1CMPCON1_IEHIHI_LENGTH                0x00000001

//#define _AD1CMPCON1_IEBTWN_POSITION              0x00000004
//#define _AD1CMPCON1_IEBTWN_MASK                  0x00000010
//#define _AD1CMPCON1_IEBTWN_LENGTH                0x00000001

//#define _AD1CMPCON1_DCMPED_POSITION              0x00000005
//#define _AD1CMPCON1_DCMPED_MASK                  0x00000020
//#define _AD1CMPCON1_DCMPED_LENGTH                0x00000001

//#define _AD1CMPCON1_DCMPGIEN_POSITION            0x00000006
//#define _AD1CMPCON1_DCMPGIEN_MASK                0x00000040
//#define _AD1CMPCON1_DCMPGIEN_LENGTH              0x00000001

//#define _AD1CMPCON1_ENDCMP_POSITION              0x00000007
//#define _AD1CMPCON1_ENDCMP_MASK                  0x00000080
//#define _AD1CMPCON1_ENDCMP_LENGTH                0x00000001

//#define _AD1CMPCON1_AINID_POSITION               0x00000008
//#define _AD1CMPCON1_AINID_MASK                   0x00001F00
//#define _AD1CMPCON1_AINID_LENGTH                 0x00000005

//#define _AD1CMPCON2_IELOLO_POSITION              0x00000000
//#define _AD1CMPCON2_IELOLO_MASK                  0x00000001
//#define _AD1CMPCON2_IELOLO_LENGTH                0x00000001

//#define _AD1CMPCON2_IELOHI_POSITION              0x00000001
//#define _AD1CMPCON2_IELOHI_MASK                  0x00000002
//#define _AD1CMPCON2_IELOHI_LENGTH                0x00000001

//#define _AD1CMPCON2_IEHILO_POSITION              0x00000002
//#define _AD1CMPCON2_IEHILO_MASK                  0x00000004
//#define _AD1CMPCON2_IEHILO_LENGTH                0x00000001

//#define _AD1CMPCON2_IEHIHI_POSITION              0x00000003
//#define _AD1CMPCON2_IEHIHI_MASK                  0x00000008
//#define _AD1CMPCON2_IEHIHI_LENGTH                0x00000001

//#define _AD1CMPCON2_IEBTWN_POSITION              0x00000004
//#define _AD1CMPCON2_IEBTWN_MASK                  0x00000010
//#define _AD1CMPCON2_IEBTWN_LENGTH                0x00000001

//#define _AD1CMPCON2_DCMPED_POSITION              0x00000005
//#define _AD1CMPCON2_DCMPED_MASK                  0x00000020
//#define _AD1CMPCON2_DCMPED_LENGTH                0x00000001

//#define _AD1CMPCON2_DCMPGIEN_POSITION            0x00000006
//#define _AD1CMPCON2_DCMPGIEN_MASK                0x00000040
//#define _AD1CMPCON2_DCMPGIEN_LENGTH              0x00000001

//#define _AD1CMPCON2_ENDCMP_POSITION              0x00000007
//#define _AD1CMPCON2_ENDCMP_MASK                  0x00000080
//#define _AD1CMPCON2_ENDCMP_LENGTH                0x00000001

//#define _AD1CMPCON2_AINID_POSITION               0x00000008
//#define _AD1CMPCON2_AINID_MASK                   0x00001F00
//#define _AD1CMPCON2_AINID_LENGTH                 0x00000005

//#define _AD1CMPCON3_IELOLO_POSITION              0x00000000
//#define _AD1CMPCON3_IELOLO_MASK                  0x00000001
//#define _AD1CMPCON3_IELOLO_LENGTH                0x00000001

//#define _AD1CMPCON3_IELOHI_POSITION              0x00000001
//#define _AD1CMPCON3_IELOHI_MASK                  0x00000002
//#define _AD1CMPCON3_IELOHI_LENGTH                0x00000001

//#define _AD1CMPCON3_IEHILO_POSITION              0x00000002
//#define _AD1CMPCON3_IEHILO_MASK                  0x00000004
//#define _AD1CMPCON3_IEHILO_LENGTH                0x00000001

//#define _AD1CMPCON3_IEHIHI_POSITION              0x00000003
//#define _AD1CMPCON3_IEHIHI_MASK                  0x00000008
//#define _AD1CMPCON3_IEHIHI_LENGTH                0x00000001

//#define _AD1CMPCON3_IEBTWN_POSITION              0x00000004
//#define _AD1CMPCON3_IEBTWN_MASK                  0x00000010
//#define _AD1CMPCON3_IEBTWN_LENGTH                0x00000001

//#define _AD1CMPCON3_DCMPED_POSITION              0x00000005
//#define _AD1CMPCON3_DCMPED_MASK                  0x00000020
//#define _AD1CMPCON3_DCMPED_LENGTH                0x00000001

//#define _AD1CMPCON3_DCMPGIEN_POSITION            0x00000006
//#define _AD1CMPCON3_DCMPGIEN_MASK                0x00000040
//#define _AD1CMPCON3_DCMPGIEN_LENGTH              0x00000001

//#define _AD1CMPCON3_ENDCMP_POSITION              0x00000007
//#define _AD1CMPCON3_ENDCMP_MASK                  0x00000080
//#define _AD1CMPCON3_ENDCMP_LENGTH                0x00000001

