HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _AD1DATA12_DATA_POSITION                 0x00000000
//#define _AD1DATA12_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA12_DATA_LENGTH                   0x00000020

//#define _AD1DATA13_DATA_POSITION                 0x00000000
//#define _AD1DATA13_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA13_DATA_LENGTH                   0x00000020

//#define _AD1DATA14_DATA_POSITION                 0x00000000
//#define _AD1DATA14_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA14_DATA_LENGTH                   0x00000020

//#define _AD1DATA15_DATA_POSITION                 0x00000000
//#define _AD1DATA15_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA15_DATA_LENGTH                   0x00000020

//#define _AD1DATA16_DATA_POSITION                 0x00000000
//#define _AD1DATA16_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA16_DATA_LENGTH                   0x00000020

//#define _AD1DATA17_DATA_POSITION                 0x00000000
//#define _AD1DATA17_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA17_DATA_LENGTH                   0x00000020

//#define _AD1DATA18_DATA_POSITION                 0x00000000
//#define _AD1DATA18_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA18_DATA_LENGTH                   0x00000020

//#define _AD1DATA19_DATA_POSITION                 0x00000000
//#define _AD1DATA19_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA19_DATA_LENGTH                   0x00000020

//#define _AD1DATA20_DATA_POSITION                 0x00000000
//#define _AD1DATA20_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA20_DATA_LENGTH                   0x00000020

//#define _AD1DATA21_DATA_POSITION                 0x00000000
//#define _AD1DATA21_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA21_DATA_LENGTH                   0x00000020

//#define _AD1DATA22_DATA_POSITION                 0x00000000
//#define _AD1DATA22_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA22_DATA_LENGTH                   0x00000020

//#define _AD1DATA23_DATA_POSITION                 0x00000000
//#define _AD1DATA23_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA23_DATA_LENGTH                   0x00000020

//#define _AD1DATA24_DATA_POSITION                 0x00000000
//#define _AD1DATA24_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA24_DATA_LENGTH                   0x00000020

//#define _AD1DATA25_DATA_POSITION                 0x00000000
//#define _AD1DATA25_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA25_DATA_LENGTH                   0x00000020

//#define _AD1DATA26_DATA_POSITION                 0x00000000
//#define _AD1DATA26_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA26_DATA_LENGTH                   0x00000020

//#define _AD1DATA27_DATA_POSITION                 0x00000000
//#define _AD1DATA27_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA27_DATA_LENGTH                   0x00000020

//#define _AD1DATA28_DATA_POSITION                 0x00000000
//#define _AD1DATA28_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA28_DATA_LENGTH                   0x00000020

//#define _AD1DATA29_DATA_POSITION                 0x00000000
//#define _AD1DATA29_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA29_DATA_LENGTH                   0x00000020

//#define _AD1DATA30_DATA_POSITION                 0x00000000
//#define _AD1DATA30_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA30_DATA_LENGTH                   0x00000020

//#define _AD1DATA31_DATA_POSITION                 0x00000000
//#define _AD1DATA31_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA31_DATA_LENGTH                   0x00000020

//#define _AD1DATA32_DATA_POSITION                 0x00000000
//#define _AD1DATA32_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA32_DATA_LENGTH                   0x00000020

//#define _AD1DATA33_DATA_POSITION                 0x00000000
//#define _AD1DATA33_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA33_DATA_LENGTH                   0x00000020

//#define _AD1DATA34_DATA_POSITION                 0x00000000
//#define _AD1DATA34_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA34_DATA_LENGTH                   0x00000020

//#define _AD1DATA43_DATA_POSITION                 0x00000000
//#define _AD1DATA43_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA43_DATA_LENGTH                   0x00000020

//#define _AD1DATA44_DATA_POSITION                 0x00000000
//#define _AD1DATA44_DATA_MASK                     0xFFFFFFFF
//#define _AD1DATA44_DATA_LENGTH                   0x00000020

//#define _AD1CAL1_ADCAL_POSITION                  0x00000000
//#define _AD1CAL1_ADCAL_MASK                      0xFFFFFFFF
//#define _AD1CAL1_ADCAL_LENGTH                    0x00000020

//#define _AD1CAL2_ADCAL_POSITION                  0x00000000
//#define _AD1CAL2_ADCAL_MASK                      0xFFFFFFFF
//#define _AD1CAL2_ADCAL_LENGTH                    0x00000020

//#define _AD1CAL3_ADCAL_POSITION                  0x00000000
//#define _AD1CAL3_ADCAL_MASK                      0xFFFFFFFF
//#define _AD1CAL3_ADCAL_LENGTH                    0x00000020

//#define _AD1CAL4_ADCAL_POSITION                  0x00000000
//#define _AD1CAL4_ADCAL_MASK                      0xFFFFFFFF
//#define _AD1CAL4_ADCAL_LENGTH                    0x00000020

//#define _AD1CAL5_ADCAL_POSITION                  0x00000000
//#define _AD1CAL5_ADCAL_MASK                      0xFFFFFFFF
//#define _AD1CAL5_ADCAL_LENGTH                    0x00000020

//#define _CM1CON_CCH_POSITION                     0x00000000
//#define _CM1CON_CCH_MASK                         0x00000003
//#define _CM1CON_CCH_LENGTH                       0x00000002

//#define _CM1CON_CREF_POSITION                    0x00000004
//#define _CM1CON_CREF_MASK                        0x00000010
//#define _CM1CON_CREF_LENGTH                      0x00000001

//#define _CM1CON_EVPOL_POSITION                   0x00000006
//#define _CM1CON_EVPOL_MASK                       0x000000C0
//#define _CM1CON_EVPOL_LENGTH                     0x00000002

//#define _CM1CON_COUT_POSITION                    0x00000008
//#define _CM1CON_COUT_MASK                        0x00000100
//#define _CM1CON_COUT_LENGTH                      0x00000001

//#define _CM1CON_CPOL_POSITION                    0x0000000D
//#define _CM1CON_CPOL_MASK                        0x00002000
//#define _CM1CON_CPOL_LENGTH                      0x00000001

//#define _CM1CON_COE_POSITION                     0x0000000E
//#define _CM1CON_COE_MASK                         0x00004000
//#define _CM1CON_COE_LENGTH                       0x00000001

//#define _CM1CON_ON_POSITION                      0x0000000F
//#define _CM1CON_ON_MASK                          0x00008000
//#define _CM1CON_ON_LENGTH                        0x00000001

//#define _CM1CON_CCH0_POSITION                    0x00000000
//#define _CM1CON_CCH0_MASK                        0x00000001
//#define _CM1CON_CCH0_LENGTH                      0x00000001

//#define _CM1CON_CCH1_POSITION                    0x00000001
//#define _CM1CON_CCH1_MASK                        0x00000002
//#define _CM1CON_CCH1_LENGTH                      0x00000001

//#define _CM1CON_EVPOL0_POSITION                  0x00000006
//#define _CM1CON_EVPOL0_MASK                      0x00000040
//#define _CM1CON_EVPOL0_LENGTH                    0x00000001

//#define _CM1CON_EVPOL1_POSITION                  0x00000007
//#define _CM1CON_EVPOL1_MASK                      0x00000080
//#define _CM1CON_EVPOL1_LENGTH                    0x00000001

