HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _PORTB_RB7_POSITION                      0x00000007
//#define _PORTB_RB7_MASK                          0x00000080
//#define _PORTB_RB7_LENGTH                        0x00000001

//#define _PORTB_RB8_POSITION                      0x00000008
//#define _PORTB_RB8_MASK                          0x00000100
//#define _PORTB_RB8_LENGTH                        0x00000001

//#define _PORTB_RB9_POSITION                      0x00000009
//#define _PORTB_RB9_MASK                          0x00000200
//#define _PORTB_RB9_LENGTH                        0x00000001

//#define _PORTB_RB10_POSITION                     0x0000000A
//#define _PORTB_RB10_MASK                         0x00000400
//#define _PORTB_RB10_LENGTH                       0x00000001

//#define _PORTB_RB11_POSITION                     0x0000000B
//#define _PORTB_RB11_MASK                         0x00000800
//#define _PORTB_RB11_LENGTH                       0x00000001

//#define _PORTB_RB12_POSITION                     0x0000000C
//#define _PORTB_RB12_MASK                         0x00001000
//#define _PORTB_RB12_LENGTH                       0x00000001

//#define _PORTB_RB13_POSITION                     0x0000000D
//#define _PORTB_RB13_MASK                         0x00002000
//#define _PORTB_RB13_LENGTH                       0x00000001

//#define _PORTB_RB14_POSITION                     0x0000000E
//#define _PORTB_RB14_MASK                         0x00004000
//#define _PORTB_RB14_LENGTH                       0x00000001

//#define _PORTB_RB15_POSITION                     0x0000000F
//#define _PORTB_RB15_MASK                         0x00008000
//#define _PORTB_RB15_LENGTH                       0x00000001

//#define _PORTB_w_POSITION                        0x00000000
//#define _PORTB_w_MASK                            0xFFFFFFFF
//#define _PORTB_w_LENGTH                          0x00000020

//#define _LATB_LATB0_POSITION                     0x00000000
//#define _LATB_LATB0_MASK                         0x00000001
//#define _LATB_LATB0_LENGTH                       0x00000001

//#define _LATB_LATB1_POSITION                     0x00000001
//#define _LATB_LATB1_MASK                         0x00000002
//#define _LATB_LATB1_LENGTH                       0x00000001

//#define _LATB_LATB2_POSITION                     0x00000002
//#define _LATB_LATB2_MASK                         0x00000004
//#define _LATB_LATB2_LENGTH                       0x00000001

//#define _LATB_LATB3_POSITION                     0x00000003
//#define _LATB_LATB3_MASK                         0x00000008
//#define _LATB_LATB3_LENGTH                       0x00000001

//#define _LATB_LATB4_POSITION                     0x00000004
//#define _LATB_LATB4_MASK                         0x00000010
//#define _LATB_LATB4_LENGTH                       0x00000001

//#define _LATB_LATB5_POSITION                     0x00000005
//#define _LATB_LATB5_MASK                         0x00000020
//#define _LATB_LATB5_LENGTH                       0x00000001

//#define _LATB_LATB6_POSITION                     0x00000006
//#define _LATB_LATB6_MASK                         0x00000040
//#define _LATB_LATB6_LENGTH                       0x00000001

//#define _LATB_LATB7_POSITION                     0x00000007
//#define _LATB_LATB7_MASK                         0x00000080
//#define _LATB_LATB7_LENGTH                       0x00000001

//#define _LATB_LATB8_POSITION                     0x00000008
//#define _LATB_LATB8_MASK                         0x00000100
//#define _LATB_LATB8_LENGTH                       0x00000001

//#define _LATB_LATB9_POSITION                     0x00000009
//#define _LATB_LATB9_MASK                         0x00000200
//#define _LATB_LATB9_LENGTH                       0x00000001

//#define _LATB_LATB10_POSITION                    0x0000000A
//#define _LATB_LATB10_MASK                        0x00000400
//#define _LATB_LATB10_LENGTH                      0x00000001

//#define _LATB_LATB11_POSITION                    0x0000000B
//#define _LATB_LATB11_MASK                        0x00000800
//#define _LATB_LATB11_LENGTH                      0x00000001

//#define _LATB_LATB12_POSITION                    0x0000000C
//#define _LATB_LATB12_MASK                        0x00001000
//#define _LATB_LATB12_LENGTH                      0x00000001

//#define _LATB_LATB13_POSITION                    0x0000000D
//#define _LATB_LATB13_MASK                        0x00002000
//#define _LATB_LATB13_LENGTH                      0x00000001

//#define _LATB_LATB14_POSITION                    0x0000000E
//#define _LATB_LATB14_MASK                        0x00004000
//#define _LATB_LATB14_LENGTH                      0x00000001

//#define _LATB_LATB15_POSITION                    0x0000000F
//#define _LATB_LATB15_MASK                        0x00008000
//#define _LATB_LATB15_LENGTH                      0x00000001

//#define _LATB_w_POSITION                         0x00000000
//#define _LATB_w_MASK                             0xFFFFFFFF
//#define _LATB_w_LENGTH                           0x00000020

//#define _ODCB_ODCB0_POSITION                     0x00000000
//#define _ODCB_ODCB0_MASK                         0x00000001
//#define _ODCB_ODCB0_LENGTH                       0x00000001

//#define _ODCB_ODCB1_POSITION                     0x00000001
//#define _ODCB_ODCB1_MASK                         0x00000002
//#define _ODCB_ODCB1_LENGTH                       0x00000001

//#define _ODCB_ODCB2_POSITION                     0x00000002
//#define _ODCB_ODCB2_MASK                         0x00000004
//#define _ODCB_ODCB2_LENGTH                       0x00000001

//#define _ODCB_ODCB3_POSITION                     0x00000003
//#define _ODCB_ODCB3_MASK                         0x00000008
//#define _ODCB_ODCB3_LENGTH                       0x00000001

//#define _ODCB_ODCB4_POSITION                     0x00000004
//#define _ODCB_ODCB4_MASK                         0x00000010
//#define _ODCB_ODCB4_LENGTH                       0x00000001

//#define _ODCB_ODCB5_POSITION                     0x00000005
//#define _ODCB_ODCB5_MASK                         0x00000020
//#define _ODCB_ODCB5_LENGTH                       0x00000001

//#define _ODCB_ODCB6_POSITION                     0x00000006
//#define _ODCB_ODCB6_MASK                         0x00000040
//#define _ODCB_ODCB6_LENGTH                       0x00000001

//#define _ODCB_ODCB7_POSITION                     0x00000007
//#define _ODCB_ODCB7_MASK                         0x00000080
//#define _ODCB_ODCB7_LENGTH                       0x00000001

