HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CNSTATB_CNSTATB7_POSITION               0x00000007
//#define _CNSTATB_CNSTATB7_MASK                   0x00000080
//#define _CNSTATB_CNSTATB7_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB8_POSITION               0x00000008
//#define _CNSTATB_CNSTATB8_MASK                   0x00000100
//#define _CNSTATB_CNSTATB8_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB9_POSITION               0x00000009
//#define _CNSTATB_CNSTATB9_MASK                   0x00000200
//#define _CNSTATB_CNSTATB9_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB10_POSITION              0x0000000A
//#define _CNSTATB_CNSTATB10_MASK                  0x00000400
//#define _CNSTATB_CNSTATB10_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB11_POSITION              0x0000000B
//#define _CNSTATB_CNSTATB11_MASK                  0x00000800
//#define _CNSTATB_CNSTATB11_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB12_POSITION              0x0000000C
//#define _CNSTATB_CNSTATB12_MASK                  0x00001000
//#define _CNSTATB_CNSTATB12_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB13_POSITION              0x0000000D
//#define _CNSTATB_CNSTATB13_MASK                  0x00002000
//#define _CNSTATB_CNSTATB13_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB14_POSITION              0x0000000E
//#define _CNSTATB_CNSTATB14_MASK                  0x00004000
//#define _CNSTATB_CNSTATB14_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB15_POSITION              0x0000000F
//#define _CNSTATB_CNSTATB15_MASK                  0x00008000
//#define _CNSTATB_CNSTATB15_LENGTH                0x00000001

//#define _CNSTATB_w_POSITION                      0x00000000
//#define _CNSTATB_w_MASK                          0xFFFFFFFF
//#define _CNSTATB_w_LENGTH                        0x00000020

//#define _ANSELC_ANSC1_POSITION                   0x00000001
//#define _ANSELC_ANSC1_MASK                       0x00000002
//#define _ANSELC_ANSC1_LENGTH                     0x00000001

//#define _ANSELC_ANSC2_POSITION                   0x00000002
//#define _ANSELC_ANSC2_MASK                       0x00000004
//#define _ANSELC_ANSC2_LENGTH                     0x00000001

//#define _ANSELC_ANSC3_POSITION                   0x00000003
//#define _ANSELC_ANSC3_MASK                       0x00000008
//#define _ANSELC_ANSC3_LENGTH                     0x00000001

//#define _ANSELC_ANSC4_POSITION                   0x00000004
//#define _ANSELC_ANSC4_MASK                       0x00000010
//#define _ANSELC_ANSC4_LENGTH                     0x00000001

//#define _ANSELC_w_POSITION                       0x00000000
//#define _ANSELC_w_MASK                           0xFFFFFFFF
//#define _ANSELC_w_LENGTH                         0x00000020

//#define _TRISC_TRISC1_POSITION                   0x00000001
//#define _TRISC_TRISC1_MASK                       0x00000002
//#define _TRISC_TRISC1_LENGTH                     0x00000001

//#define _TRISC_TRISC2_POSITION                   0x00000002
//#define _TRISC_TRISC2_MASK                       0x00000004
//#define _TRISC_TRISC2_LENGTH                     0x00000001

//#define _TRISC_TRISC3_POSITION                   0x00000003
//#define _TRISC_TRISC3_MASK                       0x00000008
//#define _TRISC_TRISC3_LENGTH                     0x00000001

//#define _TRISC_TRISC4_POSITION                   0x00000004
//#define _TRISC_TRISC4_MASK                       0x00000010
//#define _TRISC_TRISC4_LENGTH                     0x00000001

//#define _TRISC_TRISC12_POSITION                  0x0000000C
//#define _TRISC_TRISC12_MASK                      0x00001000
//#define _TRISC_TRISC12_LENGTH                    0x00000001

//#define _TRISC_TRISC13_POSITION                  0x0000000D
//#define _TRISC_TRISC13_MASK                      0x00002000
//#define _TRISC_TRISC13_LENGTH                    0x00000001

//#define _TRISC_TRISC14_POSITION                  0x0000000E
//#define _TRISC_TRISC14_MASK                      0x00004000
//#define _TRISC_TRISC14_LENGTH                    0x00000001

//#define _TRISC_TRISC15_POSITION                  0x0000000F
//#define _TRISC_TRISC15_MASK                      0x00008000
//#define _TRISC_TRISC15_LENGTH                    0x00000001

//#define _TRISC_w_POSITION                        0x00000000
//#define _TRISC_w_MASK                            0xFFFFFFFF
//#define _TRISC_w_LENGTH                          0x00000020

//#define _PORTC_RC1_POSITION                      0x00000001
//#define _PORTC_RC1_MASK                          0x00000002
//#define _PORTC_RC1_LENGTH                        0x00000001

//#define _PORTC_RC2_POSITION                      0x00000002
//#define _PORTC_RC2_MASK                          0x00000004
//#define _PORTC_RC2_LENGTH                        0x00000001

//#define _PORTC_RC3_POSITION                      0x00000003
//#define _PORTC_RC3_MASK                          0x00000008
//#define _PORTC_RC3_LENGTH                        0x00000001

//#define _PORTC_RC4_POSITION                      0x00000004
//#define _PORTC_RC4_MASK                          0x00000010
//#define _PORTC_RC4_LENGTH                        0x00000001

//#define _PORTC_RC12_POSITION                     0x0000000C
//#define _PORTC_RC12_MASK                         0x00001000
//#define _PORTC_RC12_LENGTH                       0x00000001

//#define _PORTC_RC13_POSITION                     0x0000000D
//#define _PORTC_RC13_MASK                         0x00002000
//#define _PORTC_RC13_LENGTH                       0x00000001

//#define _PORTC_RC14_POSITION                     0x0000000E
//#define _PORTC_RC14_MASK                         0x00004000
//#define _PORTC_RC14_LENGTH                       0x00000001

//#define _PORTC_RC15_POSITION                     0x0000000F
//#define _PORTC_RC15_MASK                         0x00008000
//#define _PORTC_RC15_LENGTH                       0x00000001

//#define _PORTC_w_POSITION                        0x00000000
//#define _PORTC_w_MASK                            0xFFFFFFFF
//#define _PORTC_w_LENGTH                          0x00000020

//#define _LATC_LATC1_POSITION                     0x00000001
//#define _LATC_LATC1_MASK                         0x00000002
//#define _LATC_LATC1_LENGTH                       0x00000001

//#define _LATC_LATC2_POSITION                     0x00000002
//#define _LATC_LATC2_MASK                         0x00000004
//#define _LATC_LATC2_LENGTH                       0x00000001

