HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CNCONC_ON_POSITION                      0x0000000F
//#define _CNCONC_ON_MASK                          0x00008000
//#define _CNCONC_ON_LENGTH                        0x00000001

//#define _CNCONC_w_POSITION                       0x00000000
//#define _CNCONC_w_MASK                           0xFFFFFFFF
//#define _CNCONC_w_LENGTH                         0x00000020

//#define _CNENC_CNIEC1_POSITION                   0x00000001
//#define _CNENC_CNIEC1_MASK                       0x00000002
//#define _CNENC_CNIEC1_LENGTH                     0x00000001

//#define _CNENC_CNIEC2_POSITION                   0x00000002
//#define _CNENC_CNIEC2_MASK                       0x00000004
//#define _CNENC_CNIEC2_LENGTH                     0x00000001

//#define _CNENC_CNIEC3_POSITION                   0x00000003
//#define _CNENC_CNIEC3_MASK                       0x00000008
//#define _CNENC_CNIEC3_LENGTH                     0x00000001

//#define _CNENC_CNIEC4_POSITION                   0x00000004
//#define _CNENC_CNIEC4_MASK                       0x00000010
//#define _CNENC_CNIEC4_LENGTH                     0x00000001

//#define _CNENC_CNIEC12_POSITION                  0x0000000C
//#define _CNENC_CNIEC12_MASK                      0x00001000
//#define _CNENC_CNIEC12_LENGTH                    0x00000001

//#define _CNENC_CNIEC13_POSITION                  0x0000000D
//#define _CNENC_CNIEC13_MASK                      0x00002000
//#define _CNENC_CNIEC13_LENGTH                    0x00000001

//#define _CNENC_CNIEC14_POSITION                  0x0000000E
//#define _CNENC_CNIEC14_MASK                      0x00004000
//#define _CNENC_CNIEC14_LENGTH                    0x00000001

//#define _CNENC_CNIEC15_POSITION                  0x0000000F
//#define _CNENC_CNIEC15_MASK                      0x00008000
//#define _CNENC_CNIEC15_LENGTH                    0x00000001

//#define _CNENC_w_POSITION                        0x00000000
//#define _CNENC_w_MASK                            0xFFFFFFFF
//#define _CNENC_w_LENGTH                          0x00000020

//#define _CNSTATC_CNSTATC1_POSITION               0x00000001
//#define _CNSTATC_CNSTATC1_MASK                   0x00000002
//#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC2_POSITION               0x00000002
//#define _CNSTATC_CNSTATC2_MASK                   0x00000004
//#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC3_POSITION               0x00000003
//#define _CNSTATC_CNSTATC3_MASK                   0x00000008
//#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC4_POSITION               0x00000004
//#define _CNSTATC_CNSTATC4_MASK                   0x00000010
//#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
//#define _CNSTATC_CNSTATC12_MASK                  0x00001000
//#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

//#define _CNSTATC_CNSTATC13_POSITION              0x0000000D
//#define _CNSTATC_CNSTATC13_MASK                  0x00002000
//#define _CNSTATC_CNSTATC13_LENGTH                0x00000001

//#define _CNSTATC_CNSTATC14_POSITION              0x0000000E
//#define _CNSTATC_CNSTATC14_MASK                  0x00004000
//#define _CNSTATC_CNSTATC14_LENGTH                0x00000001

//#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
//#define _CNSTATC_CNSTATC15_MASK                  0x00008000
//#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

//#define _CNSTATC_w_POSITION                      0x00000000
//#define _CNSTATC_w_MASK                          0xFFFFFFFF
//#define _CNSTATC_w_LENGTH                        0x00000020

//#define _ANSELD_ANSD14_POSITION                  0x0000000E
//#define _ANSELD_ANSD14_MASK                      0x00004000
//#define _ANSELD_ANSD14_LENGTH                    0x00000001

//#define _ANSELD_ANSD15_POSITION                  0x0000000F
//#define _ANSELD_ANSD15_MASK                      0x00008000
//#define _ANSELD_ANSD15_LENGTH                    0x00000001

//#define _ANSELD_w_POSITION                       0x00000000
//#define _ANSELD_w_MASK                           0xFFFFFFFF
//#define _ANSELD_w_LENGTH                         0x00000020

//#define _TRISD_TRISD0_POSITION                   0x00000000
//#define _TRISD_TRISD0_MASK                       0x00000001
//#define _TRISD_TRISD0_LENGTH                     0x00000001

//#define _TRISD_TRISD1_POSITION                   0x00000001
//#define _TRISD_TRISD1_MASK                       0x00000002
//#define _TRISD_TRISD1_LENGTH                     0x00000001

//#define _TRISD_TRISD2_POSITION                   0x00000002
//#define _TRISD_TRISD2_MASK                       0x00000004
//#define _TRISD_TRISD2_LENGTH                     0x00000001

//#define _TRISD_TRISD3_POSITION                   0x00000003
//#define _TRISD_TRISD3_MASK                       0x00000008
//#define _TRISD_TRISD3_LENGTH                     0x00000001

//#define _TRISD_TRISD4_POSITION                   0x00000004
//#define _TRISD_TRISD4_MASK                       0x00000010
//#define _TRISD_TRISD4_LENGTH                     0x00000001

//#define _TRISD_TRISD5_POSITION                   0x00000005
//#define _TRISD_TRISD5_MASK                       0x00000020
//#define _TRISD_TRISD5_LENGTH                     0x00000001

//#define _TRISD_TRISD9_POSITION                   0x00000009
//#define _TRISD_TRISD9_MASK                       0x00000200
//#define _TRISD_TRISD9_LENGTH                     0x00000001

//#define _TRISD_TRISD10_POSITION                  0x0000000A
//#define _TRISD_TRISD10_MASK                      0x00000400
//#define _TRISD_TRISD10_LENGTH                    0x00000001

//#define _TRISD_TRISD11_POSITION                  0x0000000B
//#define _TRISD_TRISD11_MASK                      0x00000800
//#define _TRISD_TRISD11_LENGTH                    0x00000001

//#define _TRISD_TRISD12_POSITION                  0x0000000C
//#define _TRISD_TRISD12_MASK                      0x00001000
//#define _TRISD_TRISD12_LENGTH                    0x00000001

//#define _TRISD_TRISD13_POSITION                  0x0000000D
//#define _TRISD_TRISD13_MASK                      0x00002000
//#define _TRISD_TRISD13_LENGTH                    0x00000001

