HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _TRISD_TRISD14_POSITION                  0x0000000E
//#define _TRISD_TRISD14_MASK                      0x00004000
//#define _TRISD_TRISD14_LENGTH                    0x00000001

//#define _TRISD_TRISD15_POSITION                  0x0000000F
//#define _TRISD_TRISD15_MASK                      0x00008000
//#define _TRISD_TRISD15_LENGTH                    0x00000001

//#define _TRISD_w_POSITION                        0x00000000
//#define _TRISD_w_MASK                            0xFFFFFFFF
//#define _TRISD_w_LENGTH                          0x00000020

//#define _PORTD_RD0_POSITION                      0x00000000
//#define _PORTD_RD0_MASK                          0x00000001
//#define _PORTD_RD0_LENGTH                        0x00000001

//#define _PORTD_RD1_POSITION                      0x00000001
//#define _PORTD_RD1_MASK                          0x00000002
//#define _PORTD_RD1_LENGTH                        0x00000001

//#define _PORTD_RD2_POSITION                      0x00000002
//#define _PORTD_RD2_MASK                          0x00000004
//#define _PORTD_RD2_LENGTH                        0x00000001

//#define _PORTD_RD3_POSITION                      0x00000003
//#define _PORTD_RD3_MASK                          0x00000008
//#define _PORTD_RD3_LENGTH                        0x00000001

//#define _PORTD_RD4_POSITION                      0x00000004
//#define _PORTD_RD4_MASK                          0x00000010
//#define _PORTD_RD4_LENGTH                        0x00000001

//#define _PORTD_RD5_POSITION                      0x00000005
//#define _PORTD_RD5_MASK                          0x00000020
//#define _PORTD_RD5_LENGTH                        0x00000001

//#define _PORTD_RD9_POSITION                      0x00000009
//#define _PORTD_RD9_MASK                          0x00000200
//#define _PORTD_RD9_LENGTH                        0x00000001

//#define _PORTD_RD10_POSITION                     0x0000000A
//#define _PORTD_RD10_MASK                         0x00000400
//#define _PORTD_RD10_LENGTH                       0x00000001

//#define _PORTD_RD11_POSITION                     0x0000000B
//#define _PORTD_RD11_MASK                         0x00000800
//#define _PORTD_RD11_LENGTH                       0x00000001

//#define _PORTD_RD12_POSITION                     0x0000000C
//#define _PORTD_RD12_MASK                         0x00001000
//#define _PORTD_RD12_LENGTH                       0x00000001

//#define _PORTD_RD13_POSITION                     0x0000000D
//#define _PORTD_RD13_MASK                         0x00002000
//#define _PORTD_RD13_LENGTH                       0x00000001

//#define _PORTD_RD14_POSITION                     0x0000000E
//#define _PORTD_RD14_MASK                         0x00004000
//#define _PORTD_RD14_LENGTH                       0x00000001

//#define _PORTD_RD15_POSITION                     0x0000000F
//#define _PORTD_RD15_MASK                         0x00008000
//#define _PORTD_RD15_LENGTH                       0x00000001

//#define _PORTD_w_POSITION                        0x00000000
//#define _PORTD_w_MASK                            0xFFFFFFFF
//#define _PORTD_w_LENGTH                          0x00000020

//#define _LATD_LATD0_POSITION                     0x00000000
//#define _LATD_LATD0_MASK                         0x00000001
//#define _LATD_LATD0_LENGTH                       0x00000001

//#define _LATD_LATD1_POSITION                     0x00000001
//#define _LATD_LATD1_MASK                         0x00000002
//#define _LATD_LATD1_LENGTH                       0x00000001

//#define _LATD_LATD2_POSITION                     0x00000002
//#define _LATD_LATD2_MASK                         0x00000004
//#define _LATD_LATD2_LENGTH                       0x00000001

//#define _LATD_LATD3_POSITION                     0x00000003
//#define _LATD_LATD3_MASK                         0x00000008
//#define _LATD_LATD3_LENGTH                       0x00000001

//#define _LATD_LATD4_POSITION                     0x00000004
//#define _LATD_LATD4_MASK                         0x00000010
//#define _LATD_LATD4_LENGTH                       0x00000001

//#define _LATD_LATD5_POSITION                     0x00000005
//#define _LATD_LATD5_MASK                         0x00000020
//#define _LATD_LATD5_LENGTH                       0x00000001

//#define _LATD_LATD9_POSITION                     0x00000009
//#define _LATD_LATD9_MASK                         0x00000200
//#define _LATD_LATD9_LENGTH                       0x00000001

//#define _LATD_LATD10_POSITION                    0x0000000A
//#define _LATD_LATD10_MASK                        0x00000400
//#define _LATD_LATD10_LENGTH                      0x00000001

//#define _LATD_LATD11_POSITION                    0x0000000B
//#define _LATD_LATD11_MASK                        0x00000800
//#define _LATD_LATD11_LENGTH                      0x00000001

//#define _LATD_LATD12_POSITION                    0x0000000C
//#define _LATD_LATD12_MASK                        0x00001000
//#define _LATD_LATD12_LENGTH                      0x00000001

//#define _LATD_LATD13_POSITION                    0x0000000D
//#define _LATD_LATD13_MASK                        0x00002000
//#define _LATD_LATD13_LENGTH                      0x00000001

//#define _LATD_LATD14_POSITION                    0x0000000E
//#define _LATD_LATD14_MASK                        0x00004000
//#define _LATD_LATD14_LENGTH                      0x00000001

//#define _LATD_LATD15_POSITION                    0x0000000F
//#define _LATD_LATD15_MASK                        0x00008000
//#define _LATD_LATD15_LENGTH                      0x00000001

//#define _LATD_w_POSITION                         0x00000000
//#define _LATD_w_MASK                             0xFFFFFFFF
//#define _LATD_w_LENGTH                           0x00000020

//#define _ODCD_ODCD0_POSITION                     0x00000000
//#define _ODCD_ODCD0_MASK                         0x00000001
//#define _ODCD_ODCD0_LENGTH                       0x00000001

//#define _ODCD_ODCD1_POSITION                     0x00000001
//#define _ODCD_ODCD1_MASK                         0x00000002
//#define _ODCD_ODCD1_LENGTH                       0x00000001

