HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ODCD_ODCD2_POSITION                     0x00000002
//#define _ODCD_ODCD2_MASK                         0x00000004
//#define _ODCD_ODCD2_LENGTH                       0x00000001

//#define _ODCD_ODCD3_POSITION                     0x00000003
//#define _ODCD_ODCD3_MASK                         0x00000008
//#define _ODCD_ODCD3_LENGTH                       0x00000001

//#define _ODCD_ODCD4_POSITION                     0x00000004
//#define _ODCD_ODCD4_MASK                         0x00000010
//#define _ODCD_ODCD4_LENGTH                       0x00000001

//#define _ODCD_ODCD5_POSITION                     0x00000005
//#define _ODCD_ODCD5_MASK                         0x00000020
//#define _ODCD_ODCD5_LENGTH                       0x00000001

//#define _ODCD_ODCD9_POSITION                     0x00000009
//#define _ODCD_ODCD9_MASK                         0x00000200
//#define _ODCD_ODCD9_LENGTH                       0x00000001

//#define _ODCD_ODCD10_POSITION                    0x0000000A
//#define _ODCD_ODCD10_MASK                        0x00000400
//#define _ODCD_ODCD10_LENGTH                      0x00000001

//#define _ODCD_ODCD11_POSITION                    0x0000000B
//#define _ODCD_ODCD11_MASK                        0x00000800
//#define _ODCD_ODCD11_LENGTH                      0x00000001

//#define _ODCD_ODCD12_POSITION                    0x0000000C
//#define _ODCD_ODCD12_MASK                        0x00001000
//#define _ODCD_ODCD12_LENGTH                      0x00000001

//#define _ODCD_ODCD13_POSITION                    0x0000000D
//#define _ODCD_ODCD13_MASK                        0x00002000
//#define _ODCD_ODCD13_LENGTH                      0x00000001

//#define _ODCD_ODCD14_POSITION                    0x0000000E
//#define _ODCD_ODCD14_MASK                        0x00004000
//#define _ODCD_ODCD14_LENGTH                      0x00000001

//#define _ODCD_ODCD15_POSITION                    0x0000000F
//#define _ODCD_ODCD15_MASK                        0x00008000
//#define _ODCD_ODCD15_LENGTH                      0x00000001

//#define _ODCD_w_POSITION                         0x00000000
//#define _ODCD_w_MASK                             0xFFFFFFFF
//#define _ODCD_w_LENGTH                           0x00000020

//#define _CNPUD_CNPUD0_POSITION                   0x00000000
//#define _CNPUD_CNPUD0_MASK                       0x00000001
//#define _CNPUD_CNPUD0_LENGTH                     0x00000001

//#define _CNPUD_CNPUD1_POSITION                   0x00000001
//#define _CNPUD_CNPUD1_MASK                       0x00000002
//#define _CNPUD_CNPUD1_LENGTH                     0x00000001

//#define _CNPUD_CNPUD2_POSITION                   0x00000002
//#define _CNPUD_CNPUD2_MASK                       0x00000004
//#define _CNPUD_CNPUD2_LENGTH                     0x00000001

//#define _CNPUD_CNPUD3_POSITION                   0x00000003
//#define _CNPUD_CNPUD3_MASK                       0x00000008
//#define _CNPUD_CNPUD3_LENGTH                     0x00000001

//#define _CNPUD_CNPUD4_POSITION                   0x00000004
//#define _CNPUD_CNPUD4_MASK                       0x00000010
//#define _CNPUD_CNPUD4_LENGTH                     0x00000001

//#define _CNPUD_CNPUD5_POSITION                   0x00000005
//#define _CNPUD_CNPUD5_MASK                       0x00000020
//#define _CNPUD_CNPUD5_LENGTH                     0x00000001

//#define _CNPUD_CNPUD9_POSITION                   0x00000009
//#define _CNPUD_CNPUD9_MASK                       0x00000200
//#define _CNPUD_CNPUD9_LENGTH                     0x00000001

//#define _CNPUD_CNPUD10_POSITION                  0x0000000A
//#define _CNPUD_CNPUD10_MASK                      0x00000400
//#define _CNPUD_CNPUD10_LENGTH                    0x00000001

//#define _CNPUD_CNPUD11_POSITION                  0x0000000B
//#define _CNPUD_CNPUD11_MASK                      0x00000800
//#define _CNPUD_CNPUD11_LENGTH                    0x00000001

//#define _CNPUD_CNPUD12_POSITION                  0x0000000C
//#define _CNPUD_CNPUD12_MASK                      0x00001000
//#define _CNPUD_CNPUD12_LENGTH                    0x00000001

//#define _CNPUD_CNPUD13_POSITION                  0x0000000D
//#define _CNPUD_CNPUD13_MASK                      0x00002000
//#define _CNPUD_CNPUD13_LENGTH                    0x00000001

//#define _CNPUD_CNPUD14_POSITION                  0x0000000E
//#define _CNPUD_CNPUD14_MASK                      0x00004000
//#define _CNPUD_CNPUD14_LENGTH                    0x00000001

//#define _CNPUD_CNPUD15_POSITION                  0x0000000F
//#define _CNPUD_CNPUD15_MASK                      0x00008000
//#define _CNPUD_CNPUD15_LENGTH                    0x00000001

//#define _CNPUD_w_POSITION                        0x00000000
//#define _CNPUD_w_MASK                            0xFFFFFFFF
//#define _CNPUD_w_LENGTH                          0x00000020

//#define _CNPDD_CNPDD0_POSITION                   0x00000000
//#define _CNPDD_CNPDD0_MASK                       0x00000001
//#define _CNPDD_CNPDD0_LENGTH                     0x00000001

//#define _CNPDD_CNPDD1_POSITION                   0x00000001
//#define _CNPDD_CNPDD1_MASK                       0x00000002
//#define _CNPDD_CNPDD1_LENGTH                     0x00000001

//#define _CNPDD_CNPDD2_POSITION                   0x00000002
//#define _CNPDD_CNPDD2_MASK                       0x00000004
//#define _CNPDD_CNPDD2_LENGTH                     0x00000001

//#define _CNPDD_CNPDD3_POSITION                   0x00000003
//#define _CNPDD_CNPDD3_MASK                       0x00000008
//#define _CNPDD_CNPDD3_LENGTH                     0x00000001

//#define _CNPDD_CNPDD4_POSITION                   0x00000004
//#define _CNPDD_CNPDD4_MASK                       0x00000010
//#define _CNPDD_CNPDD4_LENGTH                     0x00000001

//#define _CNPDD_CNPDD5_POSITION                   0x00000005
//#define _CNPDD_CNPDD5_MASK                       0x00000020
//#define _CNPDD_CNPDD5_LENGTH                     0x00000001

//#define _CNPDD_CNPDD9_POSITION                   0x00000009
//#define _CNPDD_CNPDD9_MASK                       0x00000200
//#define _CNPDD_CNPDD9_LENGTH                     0x00000001

