HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CNPDD_CNPDD10_POSITION                  0x0000000A
//#define _CNPDD_CNPDD10_MASK                      0x00000400
//#define _CNPDD_CNPDD10_LENGTH                    0x00000001

//#define _CNPDD_CNPDD11_POSITION                  0x0000000B
//#define _CNPDD_CNPDD11_MASK                      0x00000800
//#define _CNPDD_CNPDD11_LENGTH                    0x00000001

//#define _CNPDD_CNPDD12_POSITION                  0x0000000C
//#define _CNPDD_CNPDD12_MASK                      0x00001000
//#define _CNPDD_CNPDD12_LENGTH                    0x00000001

//#define _CNPDD_CNPDD13_POSITION                  0x0000000D
//#define _CNPDD_CNPDD13_MASK                      0x00002000
//#define _CNPDD_CNPDD13_LENGTH                    0x00000001

//#define _CNPDD_CNPDD14_POSITION                  0x0000000E
//#define _CNPDD_CNPDD14_MASK                      0x00004000
//#define _CNPDD_CNPDD14_LENGTH                    0x00000001

//#define _CNPDD_CNPDD15_POSITION                  0x0000000F
//#define _CNPDD_CNPDD15_MASK                      0x00008000
//#define _CNPDD_CNPDD15_LENGTH                    0x00000001

//#define _CNPDD_w_POSITION                        0x00000000
//#define _CNPDD_w_MASK                            0xFFFFFFFF
//#define _CNPDD_w_LENGTH                          0x00000020

//#define _CNCOND_SIDL_POSITION                    0x0000000D
//#define _CNCOND_SIDL_MASK                        0x00002000
//#define _CNCOND_SIDL_LENGTH                      0x00000001

//#define _CNCOND_ON_POSITION                      0x0000000F
//#define _CNCOND_ON_MASK                          0x00008000
//#define _CNCOND_ON_LENGTH                        0x00000001

//#define _CNCOND_w_POSITION                       0x00000000
//#define _CNCOND_w_MASK                           0xFFFFFFFF
//#define _CNCOND_w_LENGTH                         0x00000020

//#define _CNEND_CNIED0_POSITION                   0x00000000
//#define _CNEND_CNIED0_MASK                       0x00000001
//#define _CNEND_CNIED0_LENGTH                     0x00000001

//#define _CNEND_CNIED1_POSITION                   0x00000001
//#define _CNEND_CNIED1_MASK                       0x00000002
//#define _CNEND_CNIED1_LENGTH                     0x00000001

//#define _CNEND_CNIED2_POSITION                   0x00000002
//#define _CNEND_CNIED2_MASK                       0x00000004
//#define _CNEND_CNIED2_LENGTH                     0x00000001

//#define _CNEND_CNIED3_POSITION                   0x00000003
//#define _CNEND_CNIED3_MASK                       0x00000008
//#define _CNEND_CNIED3_LENGTH                     0x00000001

//#define _CNEND_CNIED4_POSITION                   0x00000004
//#define _CNEND_CNIED4_MASK                       0x00000010
//#define _CNEND_CNIED4_LENGTH                     0x00000001

//#define _CNEND_CNIED5_POSITION                   0x00000005
//#define _CNEND_CNIED5_MASK                       0x00000020
//#define _CNEND_CNIED5_LENGTH                     0x00000001

//#define _CNEND_CNIED9_POSITION                   0x00000009
//#define _CNEND_CNIED9_MASK                       0x00000200
//#define _CNEND_CNIED9_LENGTH                     0x00000001

//#define _CNEND_CNIED10_POSITION                  0x0000000A
//#define _CNEND_CNIED10_MASK                      0x00000400
//#define _CNEND_CNIED10_LENGTH                    0x00000001

//#define _CNEND_CNIED11_POSITION                  0x0000000B
//#define _CNEND_CNIED11_MASK                      0x00000800
//#define _CNEND_CNIED11_LENGTH                    0x00000001

//#define _CNEND_CNIED12_POSITION                  0x0000000C
//#define _CNEND_CNIED12_MASK                      0x00001000
//#define _CNEND_CNIED12_LENGTH                    0x00000001

//#define _CNEND_CNIED13_POSITION                  0x0000000D
//#define _CNEND_CNIED13_MASK                      0x00002000
//#define _CNEND_CNIED13_LENGTH                    0x00000001

//#define _CNEND_CNIED14_POSITION                  0x0000000E
//#define _CNEND_CNIED14_MASK                      0x00004000
//#define _CNEND_CNIED14_LENGTH                    0x00000001

//#define _CNEND_CNIED15_POSITION                  0x0000000F
//#define _CNEND_CNIED15_MASK                      0x00008000
//#define _CNEND_CNIED15_LENGTH                    0x00000001

//#define _CNEND_w_POSITION                        0x00000000
//#define _CNEND_w_MASK                            0xFFFFFFFF
//#define _CNEND_w_LENGTH                          0x00000020

//#define _CNSTATD_CNSTATD0_POSITION               0x00000000
//#define _CNSTATD_CNSTATD0_MASK                   0x00000001
//#define _CNSTATD_CNSTATD0_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD1_POSITION               0x00000001
//#define _CNSTATD_CNSTATD1_MASK                   0x00000002
//#define _CNSTATD_CNSTATD1_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD2_POSITION               0x00000002
//#define _CNSTATD_CNSTATD2_MASK                   0x00000004
//#define _CNSTATD_CNSTATD2_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD3_POSITION               0x00000003
//#define _CNSTATD_CNSTATD3_MASK                   0x00000008
//#define _CNSTATD_CNSTATD3_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD4_POSITION               0x00000004
//#define _CNSTATD_CNSTATD4_MASK                   0x00000010
//#define _CNSTATD_CNSTATD4_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD5_POSITION               0x00000005
//#define _CNSTATD_CNSTATD5_MASK                   0x00000020
//#define _CNSTATD_CNSTATD5_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD9_POSITION               0x00000009
//#define _CNSTATD_CNSTATD9_MASK                   0x00000200
//#define _CNSTATD_CNSTATD9_LENGTH                 0x00000001

//#define _CNSTATD_CNSTATD10_POSITION              0x0000000A
//#define _CNSTATD_CNSTATD10_MASK                  0x00000400
//#define _CNSTATD_CNSTATD10_LENGTH                0x00000001

//#define _CNSTATD_CNSTATD11_POSITION              0x0000000B
//#define _CNSTATD_CNSTATD11_MASK                  0x00000800
//#define _CNSTATD_CNSTATD11_LENGTH                0x00000001

//#define _CNSTATD_CNSTATD12_POSITION              0x0000000C
//#define _CNSTATD_CNSTATD12_MASK                  0x00001000
//#define _CNSTATD_CNSTATD12_LENGTH                0x00000001

//#define _CNSTATD_CNSTATD13_POSITION              0x0000000D
//#define _CNSTATD_CNSTATD13_MASK                  0x00002000
//#define _CNSTATD_CNSTATD13_LENGTH                0x00000001

//#define _CNSTATD_CNSTATD14_POSITION              0x0000000E
//#define _CNSTATD_CNSTATD14_MASK                  0x00004000
//#define _CNSTATD_CNSTATD14_LENGTH                0x00000001

//#define _CNSTATD_CNSTATD15_POSITION              0x0000000F
//#define _CNSTATD_CNSTATD15_MASK                  0x00008000
//#define _CNSTATD_CNSTATD15_LENGTH                0x00000001

