HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _LATE_LATE9_POSITION                     0x00000009
//#define _LATE_LATE9_MASK                         0x00000200
//#define _LATE_LATE9_LENGTH                       0x00000001

//#define _LATE_w_POSITION                         0x00000000
//#define _LATE_w_MASK                             0xFFFFFFFF
//#define _LATE_w_LENGTH                           0x00000020

//#define _ODCE_ODCE0_POSITION                     0x00000000
//#define _ODCE_ODCE0_MASK                         0x00000001
//#define _ODCE_ODCE0_LENGTH                       0x00000001

//#define _ODCE_ODCE1_POSITION                     0x00000001
//#define _ODCE_ODCE1_MASK                         0x00000002
//#define _ODCE_ODCE1_LENGTH                       0x00000001

//#define _ODCE_ODCE2_POSITION                     0x00000002
//#define _ODCE_ODCE2_MASK                         0x00000004
//#define _ODCE_ODCE2_LENGTH                       0x00000001

//#define _ODCE_ODCE3_POSITION                     0x00000003
//#define _ODCE_ODCE3_MASK                         0x00000008
//#define _ODCE_ODCE3_LENGTH                       0x00000001

//#define _ODCE_ODCE4_POSITION                     0x00000004
//#define _ODCE_ODCE4_MASK                         0x00000010
//#define _ODCE_ODCE4_LENGTH                       0x00000001

//#define _ODCE_ODCE5_POSITION                     0x00000005
//#define _ODCE_ODCE5_MASK                         0x00000020
//#define _ODCE_ODCE5_LENGTH                       0x00000001

//#define _ODCE_ODCE6_POSITION                     0x00000006
//#define _ODCE_ODCE6_MASK                         0x00000040
//#define _ODCE_ODCE6_LENGTH                       0x00000001

//#define _ODCE_ODCE7_POSITION                     0x00000007
//#define _ODCE_ODCE7_MASK                         0x00000080
//#define _ODCE_ODCE7_LENGTH                       0x00000001

//#define _ODCE_ODCE8_POSITION                     0x00000008
//#define _ODCE_ODCE8_MASK                         0x00000100
//#define _ODCE_ODCE8_LENGTH                       0x00000001

//#define _ODCE_ODCE9_POSITION                     0x00000009
//#define _ODCE_ODCE9_MASK                         0x00000200
//#define _ODCE_ODCE9_LENGTH                       0x00000001

//#define _ODCE_w_POSITION                         0x00000000
//#define _ODCE_w_MASK                             0xFFFFFFFF
//#define _ODCE_w_LENGTH                           0x00000020

//#define _CNPUE_CNPUE0_POSITION                   0x00000000
//#define _CNPUE_CNPUE0_MASK                       0x00000001
//#define _CNPUE_CNPUE0_LENGTH                     0x00000001

//#define _CNPUE_CNPUE1_POSITION                   0x00000001
//#define _CNPUE_CNPUE1_MASK                       0x00000002
//#define _CNPUE_CNPUE1_LENGTH                     0x00000001

//#define _CNPUE_CNPUE2_POSITION                   0x00000002
//#define _CNPUE_CNPUE2_MASK                       0x00000004
//#define _CNPUE_CNPUE2_LENGTH                     0x00000001

//#define _CNPUE_CNPUE3_POSITION                   0x00000003
//#define _CNPUE_CNPUE3_MASK                       0x00000008
//#define _CNPUE_CNPUE3_LENGTH                     0x00000001

//#define _CNPUE_CNPUE4_POSITION                   0x00000004
//#define _CNPUE_CNPUE4_MASK                       0x00000010
//#define _CNPUE_CNPUE4_LENGTH                     0x00000001

//#define _CNPUE_CNPUE5_POSITION                   0x00000005
//#define _CNPUE_CNPUE5_MASK                       0x00000020
//#define _CNPUE_CNPUE5_LENGTH                     0x00000001

//#define _CNPUE_CNPUE6_POSITION                   0x00000006
//#define _CNPUE_CNPUE6_MASK                       0x00000040
//#define _CNPUE_CNPUE6_LENGTH                     0x00000001

//#define _CNPUE_CNPUE7_POSITION                   0x00000007
//#define _CNPUE_CNPUE7_MASK                       0x00000080
//#define _CNPUE_CNPUE7_LENGTH                     0x00000001

//#define _CNPUE_CNPUE8_POSITION                   0x00000008
//#define _CNPUE_CNPUE8_MASK                       0x00000100
//#define _CNPUE_CNPUE8_LENGTH                     0x00000001

//#define _CNPUE_CNPUE9_POSITION                   0x00000009
//#define _CNPUE_CNPUE9_MASK                       0x00000200
//#define _CNPUE_CNPUE9_LENGTH                     0x00000001

//#define _CNPUE_w_POSITION                        0x00000000
//#define _CNPUE_w_MASK                            0xFFFFFFFF
//#define _CNPUE_w_LENGTH                          0x00000020

//#define _CNPDE_CNPDE0_POSITION                   0x00000000
//#define _CNPDE_CNPDE0_MASK                       0x00000001
//#define _CNPDE_CNPDE0_LENGTH                     0x00000001

//#define _CNPDE_CNPDE1_POSITION                   0x00000001
//#define _CNPDE_CNPDE1_MASK                       0x00000002
//#define _CNPDE_CNPDE1_LENGTH                     0x00000001

//#define _CNPDE_CNPDE2_POSITION                   0x00000002
//#define _CNPDE_CNPDE2_MASK                       0x00000004
//#define _CNPDE_CNPDE2_LENGTH                     0x00000001

//#define _CNPDE_CNPDE3_POSITION                   0x00000003
//#define _CNPDE_CNPDE3_MASK                       0x00000008
//#define _CNPDE_CNPDE3_LENGTH                     0x00000001

//#define _CNPDE_CNPDE4_POSITION                   0x00000004
//#define _CNPDE_CNPDE4_MASK                       0x00000010
//#define _CNPDE_CNPDE4_LENGTH                     0x00000001

//#define _CNPDE_CNPDE5_POSITION                   0x00000005
//#define _CNPDE_CNPDE5_MASK                       0x00000020
//#define _CNPDE_CNPDE5_LENGTH                     0x00000001

//#define _CNPDE_CNPDE6_POSITION                   0x00000006
//#define _CNPDE_CNPDE6_MASK                       0x00000040
//#define _CNPDE_CNPDE6_LENGTH                     0x00000001

//#define _CNPDE_CNPDE7_POSITION                   0x00000007
//#define _CNPDE_CNPDE7_MASK                       0x00000080
//#define _CNPDE_CNPDE7_LENGTH                     0x00000001

//#define _CNPDE_CNPDE8_POSITION                   0x00000008
//#define _CNPDE_CNPDE8_MASK                       0x00000100
//#define _CNPDE_CNPDE8_LENGTH                     0x00000001

//#define _CNPDE_CNPDE9_POSITION                   0x00000009
//#define _CNPDE_CNPDE9_MASK                       0x00000200
//#define _CNPDE_CNPDE9_LENGTH                     0x00000001

//#define _CNPDE_w_POSITION                        0x00000000
//#define _CNPDE_w_MASK                            0xFFFFFFFF
//#define _CNPDE_w_LENGTH                          0x00000020

//#define _CNCONE_SIDL_POSITION                    0x0000000D
//#define _CNCONE_SIDL_MASK                        0x00002000
//#define _CNCONE_SIDL_LENGTH                      0x00000001

//#define _CNCONE_ON_POSITION                      0x0000000F
//#define _CNCONE_ON_MASK                          0x00008000
//#define _CNCONE_ON_LENGTH                        0x00000001

//#define _CNCONE_w_POSITION                       0x00000000
//#define _CNCONE_w_MASK                           0xFFFFFFFF
//#define _CNCONE_w_LENGTH                         0x00000020

//#define _CNENE_CNIEE0_POSITION                   0x00000000
//#define _CNENE_CNIEE0_MASK                       0x00000001
//#define _CNENE_CNIEE0_LENGTH                     0x00000001

//#define _CNENE_CNIEE1_POSITION                   0x00000001
//#define _CNENE_CNIEE1_MASK                       0x00000002
//#define _CNENE_CNIEE1_LENGTH                     0x00000001

//#define _CNENE_CNIEE2_POSITION                   0x00000002
//#define _CNENE_CNIEE2_MASK                       0x00000004
//#define _CNENE_CNIEE2_LENGTH                     0x00000001

