HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CNENE_CNIEE3_POSITION                   0x00000003
//#define _CNENE_CNIEE3_MASK                       0x00000008
//#define _CNENE_CNIEE3_LENGTH                     0x00000001

//#define _CNENE_CNIEE4_POSITION                   0x00000004
//#define _CNENE_CNIEE4_MASK                       0x00000010
//#define _CNENE_CNIEE4_LENGTH                     0x00000001

//#define _CNENE_CNIEE5_POSITION                   0x00000005
//#define _CNENE_CNIEE5_MASK                       0x00000020
//#define _CNENE_CNIEE5_LENGTH                     0x00000001

//#define _CNENE_CNIEE6_POSITION                   0x00000006
//#define _CNENE_CNIEE6_MASK                       0x00000040
//#define _CNENE_CNIEE6_LENGTH                     0x00000001

//#define _CNENE_CNIEE7_POSITION                   0x00000007
//#define _CNENE_CNIEE7_MASK                       0x00000080
//#define _CNENE_CNIEE7_LENGTH                     0x00000001

//#define _CNENE_CNIEE8_POSITION                   0x00000008
//#define _CNENE_CNIEE8_MASK                       0x00000100
//#define _CNENE_CNIEE8_LENGTH                     0x00000001

//#define _CNENE_CNIEE9_POSITION                   0x00000009
//#define _CNENE_CNIEE9_MASK                       0x00000200
//#define _CNENE_CNIEE9_LENGTH                     0x00000001

//#define _CNENE_w_POSITION                        0x00000000
//#define _CNENE_w_MASK                            0xFFFFFFFF
//#define _CNENE_w_LENGTH                          0x00000020

//#define _CNSTATE_CNSTATE0_POSITION               0x00000000
//#define _CNSTATE_CNSTATE0_MASK                   0x00000001
//#define _CNSTATE_CNSTATE0_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE1_POSITION               0x00000001
//#define _CNSTATE_CNSTATE1_MASK                   0x00000002
//#define _CNSTATE_CNSTATE1_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE2_POSITION               0x00000002
//#define _CNSTATE_CNSTATE2_MASK                   0x00000004
//#define _CNSTATE_CNSTATE2_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE3_POSITION               0x00000003
//#define _CNSTATE_CNSTATE3_MASK                   0x00000008
//#define _CNSTATE_CNSTATE3_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE4_POSITION               0x00000004
//#define _CNSTATE_CNSTATE4_MASK                   0x00000010
//#define _CNSTATE_CNSTATE4_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE5_POSITION               0x00000005
//#define _CNSTATE_CNSTATE5_MASK                   0x00000020
//#define _CNSTATE_CNSTATE5_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE6_POSITION               0x00000006
//#define _CNSTATE_CNSTATE6_MASK                   0x00000040
//#define _CNSTATE_CNSTATE6_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE7_POSITION               0x00000007
//#define _CNSTATE_CNSTATE7_MASK                   0x00000080
//#define _CNSTATE_CNSTATE7_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE8_POSITION               0x00000008
//#define _CNSTATE_CNSTATE8_MASK                   0x00000100
//#define _CNSTATE_CNSTATE8_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE9_POSITION               0x00000009
//#define _CNSTATE_CNSTATE9_MASK                   0x00000200
//#define _CNSTATE_CNSTATE9_LENGTH                 0x00000001

//#define _CNSTATE_w_POSITION                      0x00000000
//#define _CNSTATE_w_MASK                          0xFFFFFFFF
//#define _CNSTATE_w_LENGTH                        0x00000020

//#define _ANSELF_ANSF12_POSITION                  0x0000000C
//#define _ANSELF_ANSF12_MASK                      0x00001000
//#define _ANSELF_ANSF12_LENGTH                    0x00000001

//#define _ANSELF_ANSF13_POSITION                  0x0000000D
//#define _ANSELF_ANSF13_MASK                      0x00002000
//#define _ANSELF_ANSF13_LENGTH                    0x00000001

//#define _ANSELF_w_POSITION                       0x00000000
//#define _ANSELF_w_MASK                           0xFFFFFFFF
//#define _ANSELF_w_LENGTH                         0x00000020

//#define _TRISF_TRISF0_POSITION                   0x00000000
//#define _TRISF_TRISF0_MASK                       0x00000001
//#define _TRISF_TRISF0_LENGTH                     0x00000001

//#define _TRISF_TRISF1_POSITION                   0x00000001
//#define _TRISF_TRISF1_MASK                       0x00000002
//#define _TRISF_TRISF1_LENGTH                     0x00000001

//#define _TRISF_TRISF2_POSITION                   0x00000002
//#define _TRISF_TRISF2_MASK                       0x00000004
//#define _TRISF_TRISF2_LENGTH                     0x00000001

//#define _TRISF_TRISF3_POSITION                   0x00000003
//#define _TRISF_TRISF3_MASK                       0x00000008
//#define _TRISF_TRISF3_LENGTH                     0x00000001

//#define _TRISF_TRISF4_POSITION                   0x00000004
//#define _TRISF_TRISF4_MASK                       0x00000010
//#define _TRISF_TRISF4_LENGTH                     0x00000001

//#define _TRISF_TRISF5_POSITION                   0x00000005
//#define _TRISF_TRISF5_MASK                       0x00000020
//#define _TRISF_TRISF5_LENGTH                     0x00000001

//#define _TRISF_TRISF8_POSITION                   0x00000008
//#define _TRISF_TRISF8_MASK                       0x00000100
//#define _TRISF_TRISF8_LENGTH                     0x00000001

//#define _TRISF_TRISF12_POSITION                  0x0000000C
//#define _TRISF_TRISF12_MASK                      0x00001000
//#define _TRISF_TRISF12_LENGTH                    0x00000001

//#define _TRISF_TRISF13_POSITION                  0x0000000D
//#define _TRISF_TRISF13_MASK                      0x00002000
//#define _TRISF_TRISF13_LENGTH                    0x00000001

//#define _TRISF_w_POSITION                        0x00000000
//#define _TRISF_w_MASK                            0xFFFFFFFF
//#define _TRISF_w_LENGTH                          0x00000020

//#define _PORTF_RF0_POSITION                      0x00000000
//#define _PORTF_RF0_MASK                          0x00000001
//#define _PORTF_RF0_LENGTH                        0x00000001

//#define _PORTF_RF1_POSITION                      0x00000001
//#define _PORTF_RF1_MASK                          0x00000002
//#define _PORTF_RF1_LENGTH                        0x00000001

//#define _PORTF_RF2_POSITION                      0x00000002
//#define _PORTF_RF2_MASK                          0x00000004
//#define _PORTF_RF2_LENGTH                        0x00000001

//#define _PORTF_RF3_POSITION                      0x00000003
//#define _PORTF_RF3_MASK                          0x00000008
//#define _PORTF_RF3_LENGTH                        0x00000001

//#define _PORTF_RF4_POSITION                      0x00000004
//#define _PORTF_RF4_MASK                          0x00000010
//#define _PORTF_RF4_LENGTH                        0x00000001

//#define _PORTF_RF5_POSITION                      0x00000005
//#define _PORTF_RF5_MASK                          0x00000020
//#define _PORTF_RF5_LENGTH                        0x00000001

//#define _PORTF_RF8_POSITION                      0x00000008
//#define _PORTF_RF8_MASK                          0x00000100
//#define _PORTF_RF8_LENGTH                        0x00000001

