HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _PORTF_RF12_POSITION                     0x0000000C
//#define _PORTF_RF12_MASK                         0x00001000
//#define _PORTF_RF12_LENGTH                       0x00000001

//#define _PORTF_RF13_POSITION                     0x0000000D
//#define _PORTF_RF13_MASK                         0x00002000
//#define _PORTF_RF13_LENGTH                       0x00000001

//#define _PORTF_w_POSITION                        0x00000000
//#define _PORTF_w_MASK                            0xFFFFFFFF
//#define _PORTF_w_LENGTH                          0x00000020

//#define _LATF_LATF0_POSITION                     0x00000000
//#define _LATF_LATF0_MASK                         0x00000001
//#define _LATF_LATF0_LENGTH                       0x00000001

//#define _LATF_LATF1_POSITION                     0x00000001
//#define _LATF_LATF1_MASK                         0x00000002
//#define _LATF_LATF1_LENGTH                       0x00000001

//#define _LATF_LATF2_POSITION                     0x00000002
//#define _LATF_LATF2_MASK                         0x00000004
//#define _LATF_LATF2_LENGTH                       0x00000001

//#define _LATF_LATF3_POSITION                     0x00000003
//#define _LATF_LATF3_MASK                         0x00000008
//#define _LATF_LATF3_LENGTH                       0x00000001

//#define _LATF_LATF4_POSITION                     0x00000004
//#define _LATF_LATF4_MASK                         0x00000010
//#define _LATF_LATF4_LENGTH                       0x00000001

//#define _LATF_LATF5_POSITION                     0x00000005
//#define _LATF_LATF5_MASK                         0x00000020
//#define _LATF_LATF5_LENGTH                       0x00000001

//#define _LATF_LATF8_POSITION                     0x00000008
//#define _LATF_LATF8_MASK                         0x00000100
//#define _LATF_LATF8_LENGTH                       0x00000001

//#define _LATF_LATF12_POSITION                    0x0000000C
//#define _LATF_LATF12_MASK                        0x00001000
//#define _LATF_LATF12_LENGTH                      0x00000001

//#define _LATF_LATF13_POSITION                    0x0000000D
//#define _LATF_LATF13_MASK                        0x00002000
//#define _LATF_LATF13_LENGTH                      0x00000001

//#define _LATF_w_POSITION                         0x00000000
//#define _LATF_w_MASK                             0xFFFFFFFF
//#define _LATF_w_LENGTH                           0x00000020

//#define _ODCF_ODCF0_POSITION                     0x00000000
//#define _ODCF_ODCF0_MASK                         0x00000001
//#define _ODCF_ODCF0_LENGTH                       0x00000001

//#define _ODCF_ODCF1_POSITION                     0x00000001
//#define _ODCF_ODCF1_MASK                         0x00000002
//#define _ODCF_ODCF1_LENGTH                       0x00000001

//#define _ODCF_ODCF2_POSITION                     0x00000002
//#define _ODCF_ODCF2_MASK                         0x00000004
//#define _ODCF_ODCF2_LENGTH                       0x00000001

//#define _ODCF_ODCF3_POSITION                     0x00000003
//#define _ODCF_ODCF3_MASK                         0x00000008
//#define _ODCF_ODCF3_LENGTH                       0x00000001

//#define _ODCF_ODCF4_POSITION                     0x00000004
//#define _ODCF_ODCF4_MASK                         0x00000010
//#define _ODCF_ODCF4_LENGTH                       0x00000001

//#define _ODCF_ODCF5_POSITION                     0x00000005
//#define _ODCF_ODCF5_MASK                         0x00000020
//#define _ODCF_ODCF5_LENGTH                       0x00000001

//#define _ODCF_ODCF8_POSITION                     0x00000008
//#define _ODCF_ODCF8_MASK                         0x00000100
//#define _ODCF_ODCF8_LENGTH                       0x00000001

//#define _ODCF_ODCF12_POSITION                    0x0000000C
//#define _ODCF_ODCF12_MASK                        0x00001000
//#define _ODCF_ODCF12_LENGTH                      0x00000001

//#define _ODCF_ODCF13_POSITION                    0x0000000D
//#define _ODCF_ODCF13_MASK                        0x00002000
//#define _ODCF_ODCF13_LENGTH                      0x00000001

//#define _ODCF_w_POSITION                         0x00000000
//#define _ODCF_w_MASK                             0xFFFFFFFF
//#define _ODCF_w_LENGTH                           0x00000020

//#define _CNPUF_CNPUF0_POSITION                   0x00000000
//#define _CNPUF_CNPUF0_MASK                       0x00000001
//#define _CNPUF_CNPUF0_LENGTH                     0x00000001

//#define _CNPUF_CNPUF1_POSITION                   0x00000001
//#define _CNPUF_CNPUF1_MASK                       0x00000002
//#define _CNPUF_CNPUF1_LENGTH                     0x00000001

//#define _CNPUF_CNPUF2_POSITION                   0x00000002
//#define _CNPUF_CNPUF2_MASK                       0x00000004
//#define _CNPUF_CNPUF2_LENGTH                     0x00000001

//#define _CNPUF_CNPUF3_POSITION                   0x00000003
//#define _CNPUF_CNPUF3_MASK                       0x00000008
//#define _CNPUF_CNPUF3_LENGTH                     0x00000001

//#define _CNPUF_CNPUF4_POSITION                   0x00000004
//#define _CNPUF_CNPUF4_MASK                       0x00000010
//#define _CNPUF_CNPUF4_LENGTH                     0x00000001

//#define _CNPUF_CNPUF5_POSITION                   0x00000005
//#define _CNPUF_CNPUF5_MASK                       0x00000020
//#define _CNPUF_CNPUF5_LENGTH                     0x00000001

//#define _CNPUF_CNPUF8_POSITION                   0x00000008
//#define _CNPUF_CNPUF8_MASK                       0x00000100
//#define _CNPUF_CNPUF8_LENGTH                     0x00000001

//#define _CNPUF_CNPUF12_POSITION                  0x0000000C
//#define _CNPUF_CNPUF12_MASK                      0x00001000
//#define _CNPUF_CNPUF12_LENGTH                    0x00000001

//#define _CNPUF_CNPUF13_POSITION                  0x0000000D
//#define _CNPUF_CNPUF13_MASK                      0x00002000
//#define _CNPUF_CNPUF13_LENGTH                    0x00000001

//#define _CNPUF_w_POSITION                        0x00000000
//#define _CNPUF_w_MASK                            0xFFFFFFFF
//#define _CNPUF_w_LENGTH                          0x00000020

