HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ANSELG_ANSG6_POSITION                   0x00000006
//#define _ANSELG_ANSG6_MASK                       0x00000040
//#define _ANSELG_ANSG6_LENGTH                     0x00000001

//#define _ANSELG_ANSG7_POSITION                   0x00000007
//#define _ANSELG_ANSG7_MASK                       0x00000080
//#define _ANSELG_ANSG7_LENGTH                     0x00000001

//#define _ANSELG_ANSG8_POSITION                   0x00000008
//#define _ANSELG_ANSG8_MASK                       0x00000100
//#define _ANSELG_ANSG8_LENGTH                     0x00000001

//#define _ANSELG_ANSG9_POSITION                   0x00000009
//#define _ANSELG_ANSG9_MASK                       0x00000200
//#define _ANSELG_ANSG9_LENGTH                     0x00000001

//#define _ANSELG_ANSG15_POSITION                  0x0000000F
//#define _ANSELG_ANSG15_MASK                      0x00008000
//#define _ANSELG_ANSG15_LENGTH                    0x00000001

//#define _ANSELG_w_POSITION                       0x00000000
//#define _ANSELG_w_MASK                           0xFFFFFFFF
//#define _ANSELG_w_LENGTH                         0x00000020

//#define _TRISG_TRISG0_POSITION                   0x00000000
//#define _TRISG_TRISG0_MASK                       0x00000001
//#define _TRISG_TRISG0_LENGTH                     0x00000001

//#define _TRISG_TRISG1_POSITION                   0x00000001
//#define _TRISG_TRISG1_MASK                       0x00000002
//#define _TRISG_TRISG1_LENGTH                     0x00000001

//#define _TRISG_TRISG6_POSITION                   0x00000006
//#define _TRISG_TRISG6_MASK                       0x00000040
//#define _TRISG_TRISG6_LENGTH                     0x00000001

//#define _TRISG_TRISG7_POSITION                   0x00000007
//#define _TRISG_TRISG7_MASK                       0x00000080
//#define _TRISG_TRISG7_LENGTH                     0x00000001

//#define _TRISG_TRISG8_POSITION                   0x00000008
//#define _TRISG_TRISG8_MASK                       0x00000100
//#define _TRISG_TRISG8_LENGTH                     0x00000001

//#define _TRISG_TRISG9_POSITION                   0x00000009
//#define _TRISG_TRISG9_MASK                       0x00000200
//#define _TRISG_TRISG9_LENGTH                     0x00000001

//#define _TRISG_TRISG12_POSITION                  0x0000000C
//#define _TRISG_TRISG12_MASK                      0x00001000
//#define _TRISG_TRISG12_LENGTH                    0x00000001

//#define _TRISG_TRISG13_POSITION                  0x0000000D
//#define _TRISG_TRISG13_MASK                      0x00002000
//#define _TRISG_TRISG13_LENGTH                    0x00000001

//#define _TRISG_TRISG14_POSITION                  0x0000000E
//#define _TRISG_TRISG14_MASK                      0x00004000
//#define _TRISG_TRISG14_LENGTH                    0x00000001

//#define _TRISG_TRISG15_POSITION                  0x0000000F
//#define _TRISG_TRISG15_MASK                      0x00008000
//#define _TRISG_TRISG15_LENGTH                    0x00000001

//#define _TRISG_w_POSITION                        0x00000000
//#define _TRISG_w_MASK                            0xFFFFFFFF
//#define _TRISG_w_LENGTH                          0x00000020

//#define _PORTG_RG0_POSITION                      0x00000000
//#define _PORTG_RG0_MASK                          0x00000001
//#define _PORTG_RG0_LENGTH                        0x00000001

//#define _PORTG_RG1_POSITION                      0x00000001
//#define _PORTG_RG1_MASK                          0x00000002
//#define _PORTG_RG1_LENGTH                        0x00000001

//#define _PORTG_RG6_POSITION                      0x00000006
//#define _PORTG_RG6_MASK                          0x00000040
//#define _PORTG_RG6_LENGTH                        0x00000001

//#define _PORTG_RG7_POSITION                      0x00000007
//#define _PORTG_RG7_MASK                          0x00000080
//#define _PORTG_RG7_LENGTH                        0x00000001

//#define _PORTG_RG8_POSITION                      0x00000008
//#define _PORTG_RG8_MASK                          0x00000100
//#define _PORTG_RG8_LENGTH                        0x00000001

//#define _PORTG_RG9_POSITION                      0x00000009
//#define _PORTG_RG9_MASK                          0x00000200
//#define _PORTG_RG9_LENGTH                        0x00000001

//#define _PORTG_RG12_POSITION                     0x0000000C
//#define _PORTG_RG12_MASK                         0x00001000
//#define _PORTG_RG12_LENGTH                       0x00000001

//#define _PORTG_RG13_POSITION                     0x0000000D
//#define _PORTG_RG13_MASK                         0x00002000
//#define _PORTG_RG13_LENGTH                       0x00000001

//#define _PORTG_RG14_POSITION                     0x0000000E
//#define _PORTG_RG14_MASK                         0x00004000
//#define _PORTG_RG14_LENGTH                       0x00000001

//#define _PORTG_RG15_POSITION                     0x0000000F
//#define _PORTG_RG15_MASK                         0x00008000
//#define _PORTG_RG15_LENGTH                       0x00000001

//#define _PORTG_w_POSITION                        0x00000000
//#define _PORTG_w_MASK                            0xFFFFFFFF
//#define _PORTG_w_LENGTH                          0x00000020

//#define _LATG_LATG0_POSITION                     0x00000000
//#define _LATG_LATG0_MASK                         0x00000001
//#define _LATG_LATG0_LENGTH                       0x00000001

//#define _LATG_LATG1_POSITION                     0x00000001
//#define _LATG_LATG1_MASK                         0x00000002
//#define _LATG_LATG1_LENGTH                       0x00000001

//#define _LATG_LATG6_POSITION                     0x00000006
//#define _LATG_LATG6_MASK                         0x00000040
//#define _LATG_LATG6_LENGTH                       0x00000001

//#define _LATG_LATG7_POSITION                     0x00000007
//#define _LATG_LATG7_MASK                         0x00000080
//#define _LATG_LATG7_LENGTH                       0x00000001

//#define _LATG_LATG8_POSITION                     0x00000008
//#define _LATG_LATG8_MASK                         0x00000100
//#define _LATG_LATG8_LENGTH                       0x00000001

//#define _LATG_LATG9_POSITION                     0x00000009
//#define _LATG_LATG9_MASK                         0x00000200
//#define _LATG_LATG9_LENGTH                       0x00000001

//#define _LATG_LATG12_POSITION                    0x0000000C
//#define _LATG_LATG12_MASK                        0x00001000
//#define _LATG_LATG12_LENGTH                      0x00000001

//#define _LATG_LATG13_POSITION                    0x0000000D
//#define _LATG_LATG13_MASK                        0x00002000
//#define _LATG_LATG13_LENGTH                      0x00000001

//#define _LATG_LATG14_POSITION                    0x0000000E
//#define _LATG_LATG14_MASK                        0x00004000
//#define _LATG_LATG14_LENGTH                      0x00000001

//#define _LATG_LATG15_POSITION                    0x0000000F
//#define _LATG_LATG15_MASK                        0x00008000
//#define _LATG_LATG15_LENGTH                      0x00000001

