HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _LATG_w_POSITION                         0x00000000
//#define _LATG_w_MASK                             0xFFFFFFFF
//#define _LATG_w_LENGTH                           0x00000020

//#define _ODCG_ODCG0_POSITION                     0x00000000
//#define _ODCG_ODCG0_MASK                         0x00000001
//#define _ODCG_ODCG0_LENGTH                       0x00000001

//#define _ODCG_ODCG1_POSITION                     0x00000001
//#define _ODCG_ODCG1_MASK                         0x00000002
//#define _ODCG_ODCG1_LENGTH                       0x00000001

//#define _ODCG_ODCG6_POSITION                     0x00000006
//#define _ODCG_ODCG6_MASK                         0x00000040
//#define _ODCG_ODCG6_LENGTH                       0x00000001

//#define _ODCG_ODCG7_POSITION                     0x00000007
//#define _ODCG_ODCG7_MASK                         0x00000080
//#define _ODCG_ODCG7_LENGTH                       0x00000001

//#define _ODCG_ODCG8_POSITION                     0x00000008
//#define _ODCG_ODCG8_MASK                         0x00000100
//#define _ODCG_ODCG8_LENGTH                       0x00000001

//#define _ODCG_ODCG9_POSITION                     0x00000009
//#define _ODCG_ODCG9_MASK                         0x00000200
//#define _ODCG_ODCG9_LENGTH                       0x00000001

//#define _ODCG_ODCG12_POSITION                    0x0000000C
//#define _ODCG_ODCG12_MASK                        0x00001000
//#define _ODCG_ODCG12_LENGTH                      0x00000001

//#define _ODCG_ODCG13_POSITION                    0x0000000D
//#define _ODCG_ODCG13_MASK                        0x00002000
//#define _ODCG_ODCG13_LENGTH                      0x00000001

//#define _ODCG_ODCG14_POSITION                    0x0000000E
//#define _ODCG_ODCG14_MASK                        0x00004000
//#define _ODCG_ODCG14_LENGTH                      0x00000001

//#define _ODCG_ODCG15_POSITION                    0x0000000F
//#define _ODCG_ODCG15_MASK                        0x00008000
//#define _ODCG_ODCG15_LENGTH                      0x00000001

//#define _ODCG_w_POSITION                         0x00000000
//#define _ODCG_w_MASK                             0xFFFFFFFF
//#define _ODCG_w_LENGTH                           0x00000020

//#define _CNPUG_CNPUG0_POSITION                   0x00000000
//#define _CNPUG_CNPUG0_MASK                       0x00000001
//#define _CNPUG_CNPUG0_LENGTH                     0x00000001

//#define _CNPUG_CNPUG1_POSITION                   0x00000001
//#define _CNPUG_CNPUG1_MASK                       0x00000002
//#define _CNPUG_CNPUG1_LENGTH                     0x00000001

//#define _CNPUG_CNPUG6_POSITION                   0x00000006
//#define _CNPUG_CNPUG6_MASK                       0x00000040
//#define _CNPUG_CNPUG6_LENGTH                     0x00000001

//#define _CNPUG_CNPUG7_POSITION                   0x00000007
//#define _CNPUG_CNPUG7_MASK                       0x00000080
//#define _CNPUG_CNPUG7_LENGTH                     0x00000001

//#define _CNPUG_CNPUG8_POSITION                   0x00000008
//#define _CNPUG_CNPUG8_MASK                       0x00000100
//#define _CNPUG_CNPUG8_LENGTH                     0x00000001

//#define _CNPUG_CNPUG9_POSITION                   0x00000009
//#define _CNPUG_CNPUG9_MASK                       0x00000200
//#define _CNPUG_CNPUG9_LENGTH                     0x00000001

//#define _CNPUG_CNPUG12_POSITION                  0x0000000C
//#define _CNPUG_CNPUG12_MASK                      0x00001000
//#define _CNPUG_CNPUG12_LENGTH                    0x00000001

//#define _CNPUG_CNPUG13_POSITION                  0x0000000D
//#define _CNPUG_CNPUG13_MASK                      0x00002000
//#define _CNPUG_CNPUG13_LENGTH                    0x00000001

//#define _CNPUG_CNPUG14_POSITION                  0x0000000E
//#define _CNPUG_CNPUG14_MASK                      0x00004000
//#define _CNPUG_CNPUG14_LENGTH                    0x00000001

//#define _CNPUG_CNPUG15_POSITION                  0x0000000F
//#define _CNPUG_CNPUG15_MASK                      0x00008000
//#define _CNPUG_CNPUG15_LENGTH                    0x00000001

//#define _CNPUG_w_POSITION                        0x00000000
//#define _CNPUG_w_MASK                            0xFFFFFFFF
//#define _CNPUG_w_LENGTH                          0x00000020

//#define _CNPDG_CNPDG0_POSITION                   0x00000000
//#define _CNPDG_CNPDG0_MASK                       0x00000001
//#define _CNPDG_CNPDG0_LENGTH                     0x00000001

//#define _CNPDG_CNPDG1_POSITION                   0x00000001
//#define _CNPDG_CNPDG1_MASK                       0x00000002
//#define _CNPDG_CNPDG1_LENGTH                     0x00000001

//#define _CNPDG_CNPDG6_POSITION                   0x00000006
//#define _CNPDG_CNPDG6_MASK                       0x00000040
//#define _CNPDG_CNPDG6_LENGTH                     0x00000001

//#define _CNPDG_CNPDG7_POSITION                   0x00000007
//#define _CNPDG_CNPDG7_MASK                       0x00000080
//#define _CNPDG_CNPDG7_LENGTH                     0x00000001

//#define _CNPDG_CNPDG8_POSITION                   0x00000008
//#define _CNPDG_CNPDG8_MASK                       0x00000100
//#define _CNPDG_CNPDG8_LENGTH                     0x00000001

//#define _CNPDG_CNPDG9_POSITION                   0x00000009
//#define _CNPDG_CNPDG9_MASK                       0x00000200
//#define _CNPDG_CNPDG9_LENGTH                     0x00000001

//#define _CNPDG_CNPDG12_POSITION                  0x0000000C
//#define _CNPDG_CNPDG12_MASK                      0x00001000
//#define _CNPDG_CNPDG12_LENGTH                    0x00000001

//#define _CNPDG_CNPDG13_POSITION                  0x0000000D
//#define _CNPDG_CNPDG13_MASK                      0x00002000
//#define _CNPDG_CNPDG13_LENGTH                    0x00000001

//#define _CNPDG_CNPDG14_POSITION                  0x0000000E
//#define _CNPDG_CNPDG14_MASK                      0x00004000
//#define _CNPDG_CNPDG14_LENGTH                    0x00000001

//#define _CNPDG_CNPDG15_POSITION                  0x0000000F
//#define _CNPDG_CNPDG15_MASK                      0x00008000
//#define _CNPDG_CNPDG15_LENGTH                    0x00000001

//#define _CNPDG_w_POSITION                        0x00000000
//#define _CNPDG_w_MASK                            0xFFFFFFFF
//#define _CNPDG_w_LENGTH                          0x00000020

