HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _CNCONG_SIDL_POSITION                    0x0000000D
//#define _CNCONG_SIDL_MASK                        0x00002000
//#define _CNCONG_SIDL_LENGTH                      0x00000001

//#define _CNCONG_ON_POSITION                      0x0000000F
//#define _CNCONG_ON_MASK                          0x00008000
//#define _CNCONG_ON_LENGTH                        0x00000001

//#define _CNCONG_w_POSITION                       0x00000000
//#define _CNCONG_w_MASK                           0xFFFFFFFF
//#define _CNCONG_w_LENGTH                         0x00000020

//#define _CNENG_CNIEG0_POSITION                   0x00000000
//#define _CNENG_CNIEG0_MASK                       0x00000001
//#define _CNENG_CNIEG0_LENGTH                     0x00000001

//#define _CNENG_CNIEG1_POSITION                   0x00000001
//#define _CNENG_CNIEG1_MASK                       0x00000002
//#define _CNENG_CNIEG1_LENGTH                     0x00000001

//#define _CNENG_CNIEG6_POSITION                   0x00000006
//#define _CNENG_CNIEG6_MASK                       0x00000040
//#define _CNENG_CNIEG6_LENGTH                     0x00000001

//#define _CNENG_CNIEG7_POSITION                   0x00000007
//#define _CNENG_CNIEG7_MASK                       0x00000080
//#define _CNENG_CNIEG7_LENGTH                     0x00000001

//#define _CNENG_CNIEG8_POSITION                   0x00000008
//#define _CNENG_CNIEG8_MASK                       0x00000100
//#define _CNENG_CNIEG8_LENGTH                     0x00000001

//#define _CNENG_CNIEG9_POSITION                   0x00000009
//#define _CNENG_CNIEG9_MASK                       0x00000200
//#define _CNENG_CNIEG9_LENGTH                     0x00000001

//#define _CNENG_CNIEG12_POSITION                  0x0000000C
//#define _CNENG_CNIEG12_MASK                      0x00001000
//#define _CNENG_CNIEG12_LENGTH                    0x00000001

//#define _CNENG_CNIEG13_POSITION                  0x0000000D
//#define _CNENG_CNIEG13_MASK                      0x00002000
//#define _CNENG_CNIEG13_LENGTH                    0x00000001

//#define _CNENG_CNIEG14_POSITION                  0x0000000E
//#define _CNENG_CNIEG14_MASK                      0x00004000
//#define _CNENG_CNIEG14_LENGTH                    0x00000001

//#define _CNENG_CNIEG15_POSITION                  0x0000000F
//#define _CNENG_CNIEG15_MASK                      0x00008000
//#define _CNENG_CNIEG15_LENGTH                    0x00000001

//#define _CNENG_w_POSITION                        0x00000000
//#define _CNENG_w_MASK                            0xFFFFFFFF
//#define _CNENG_w_LENGTH                          0x00000020

//#define _CNSTATG_CNSTATG0_POSITION               0x00000000
//#define _CNSTATG_CNSTATG0_MASK                   0x00000001
//#define _CNSTATG_CNSTATG0_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG1_POSITION               0x00000001
//#define _CNSTATG_CNSTATG1_MASK                   0x00000002
//#define _CNSTATG_CNSTATG1_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG6_POSITION               0x00000006
//#define _CNSTATG_CNSTATG6_MASK                   0x00000040
//#define _CNSTATG_CNSTATG6_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG7_POSITION               0x00000007
//#define _CNSTATG_CNSTATG7_MASK                   0x00000080
//#define _CNSTATG_CNSTATG7_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG8_POSITION               0x00000008
//#define _CNSTATG_CNSTATG8_MASK                   0x00000100
//#define _CNSTATG_CNSTATG8_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG9_POSITION               0x00000009
//#define _CNSTATG_CNSTATG9_MASK                   0x00000200
//#define _CNSTATG_CNSTATG9_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG12_POSITION              0x0000000C
//#define _CNSTATG_CNSTATG12_MASK                  0x00001000
//#define _CNSTATG_CNSTATG12_LENGTH                0x00000001

//#define _CNSTATG_CNSTATG13_POSITION              0x0000000D
//#define _CNSTATG_CNSTATG13_MASK                  0x00002000
//#define _CNSTATG_CNSTATG13_LENGTH                0x00000001

//#define _CNSTATG_CNSTATG14_POSITION              0x0000000E
//#define _CNSTATG_CNSTATG14_MASK                  0x00004000
//#define _CNSTATG_CNSTATG14_LENGTH                0x00000001

//#define _CNSTATG_CNSTATG15_POSITION              0x0000000F
//#define _CNSTATG_CNSTATG15_MASK                  0x00008000
//#define _CNSTATG_CNSTATG15_LENGTH                0x00000001

//#define _CNSTATG_w_POSITION                      0x00000000
//#define _CNSTATG_w_MASK                          0xFFFFFFFF
//#define _CNSTATG_w_LENGTH                        0x00000020

//#define _C1CON_DNCNT_POSITION                    0x00000000
//#define _C1CON_DNCNT_MASK                        0x0000001F
//#define _C1CON_DNCNT_LENGTH                      0x00000005

//#define _C1CON_CANBUSY_POSITION                  0x0000000B
//#define _C1CON_CANBUSY_MASK                      0x00000800
//#define _C1CON_CANBUSY_LENGTH                    0x00000001

//#define _C1CON_SIDL_POSITION                     0x0000000D
//#define _C1CON_SIDL_MASK                         0x00002000
//#define _C1CON_SIDL_LENGTH                       0x00000001

//#define _C1CON_ON_POSITION                       0x0000000F
//#define _C1CON_ON_MASK                           0x00008000
//#define _C1CON_ON_LENGTH                         0x00000001

//#define _C1CON_CANCAP_POSITION                   0x00000014
//#define _C1CON_CANCAP_MASK                       0x00100000
//#define _C1CON_CANCAP_LENGTH                     0x00000001

//#define _C1CON_OPMOD_POSITION                    0x00000015
//#define _C1CON_OPMOD_MASK                        0x00E00000
//#define _C1CON_OPMOD_LENGTH                      0x00000003

//#define _C1CON_REQOP_POSITION                    0x00000018
//#define _C1CON_REQOP_MASK                        0x07000000
//#define _C1CON_REQOP_LENGTH                      0x00000003

//#define _C1CON_ABAT_POSITION                     0x0000001B
//#define _C1CON_ABAT_MASK                         0x08000000
//#define _C1CON_ABAT_LENGTH                       0x00000001

//#define _C1CON_w_POSITION                        0x00000000
//#define _C1CON_w_MASK                            0xFFFFFFFF
//#define _C1CON_w_LENGTH                          0x00000020

//#define _C1CFG_BRP_POSITION                      0x00000000
//#define _C1CFG_BRP_MASK                          0x0000003F
//#define _C1CFG_BRP_LENGTH                        0x00000006

