HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C1RXF12_SID_POSITION                    0x00000015
//#define _C1RXF12_SID_MASK                        0xFFE00000
//#define _C1RXF12_SID_LENGTH                      0x0000000B

//#define _C1RXF12_w_POSITION                      0x00000000
//#define _C1RXF12_w_MASK                          0xFFFFFFFF
//#define _C1RXF12_w_LENGTH                        0x00000020

//#define _C1RXF13_EID_POSITION                    0x00000000
//#define _C1RXF13_EID_MASK                        0x0003FFFF
//#define _C1RXF13_EID_LENGTH                      0x00000012

//#define _C1RXF13_EXID_POSITION                   0x00000013
//#define _C1RXF13_EXID_MASK                       0x00080000
//#define _C1RXF13_EXID_LENGTH                     0x00000001

//#define _C1RXF13_SID_POSITION                    0x00000015
//#define _C1RXF13_SID_MASK                        0xFFE00000
//#define _C1RXF13_SID_LENGTH                      0x0000000B

//#define _C1RXF13_w_POSITION                      0x00000000
//#define _C1RXF13_w_MASK                          0xFFFFFFFF
//#define _C1RXF13_w_LENGTH                        0x00000020

//#define _C1RXF14_EID_POSITION                    0x00000000
//#define _C1RXF14_EID_MASK                        0x0003FFFF
//#define _C1RXF14_EID_LENGTH                      0x00000012

//#define _C1RXF14_EXID_POSITION                   0x00000013
//#define _C1RXF14_EXID_MASK                       0x00080000
//#define _C1RXF14_EXID_LENGTH                     0x00000001

//#define _C1RXF14_SID_POSITION                    0x00000015
//#define _C1RXF14_SID_MASK                        0xFFE00000
//#define _C1RXF14_SID_LENGTH                      0x0000000B

//#define _C1RXF14_w_POSITION                      0x00000000
//#define _C1RXF14_w_MASK                          0xFFFFFFFF
//#define _C1RXF14_w_LENGTH                        0x00000020

//#define _C1RXF15_EID_POSITION                    0x00000000
//#define _C1RXF15_EID_MASK                        0x0003FFFF
//#define _C1RXF15_EID_LENGTH                      0x00000012

//#define _C1RXF15_EXID_POSITION                   0x00000013
//#define _C1RXF15_EXID_MASK                       0x00080000
//#define _C1RXF15_EXID_LENGTH                     0x00000001

//#define _C1RXF15_SID_POSITION                    0x00000015
//#define _C1RXF15_SID_MASK                        0xFFE00000
//#define _C1RXF15_SID_LENGTH                      0x0000000B

//#define _C1RXF15_w_POSITION                      0x00000000
//#define _C1RXF15_w_MASK                          0xFFFFFFFF
//#define _C1RXF15_w_LENGTH                        0x00000020

//#define _C1RXF16_EID_POSITION                    0x00000000
//#define _C1RXF16_EID_MASK                        0x0003FFFF
//#define _C1RXF16_EID_LENGTH                      0x00000012

//#define _C1RXF16_EXID_POSITION                   0x00000013
//#define _C1RXF16_EXID_MASK                       0x00080000
//#define _C1RXF16_EXID_LENGTH                     0x00000001

//#define _C1RXF16_SID_POSITION                    0x00000015
//#define _C1RXF16_SID_MASK                        0xFFE00000
//#define _C1RXF16_SID_LENGTH                      0x0000000B

//#define _C1RXF16_w_POSITION                      0x00000000
//#define _C1RXF16_w_MASK                          0xFFFFFFFF
//#define _C1RXF16_w_LENGTH                        0x00000020

//#define _C1RXF17_EID_POSITION                    0x00000000
//#define _C1RXF17_EID_MASK                        0x0003FFFF
//#define _C1RXF17_EID_LENGTH                      0x00000012

//#define _C1RXF17_EXID_POSITION                   0x00000013
//#define _C1RXF17_EXID_MASK                       0x00080000
//#define _C1RXF17_EXID_LENGTH                     0x00000001

//#define _C1RXF17_SID_POSITION                    0x00000015
//#define _C1RXF17_SID_MASK                        0xFFE00000
//#define _C1RXF17_SID_LENGTH                      0x0000000B

//#define _C1RXF17_w_POSITION                      0x00000000
//#define _C1RXF17_w_MASK                          0xFFFFFFFF
//#define _C1RXF17_w_LENGTH                        0x00000020

//#define _C1RXF18_EID_POSITION                    0x00000000
//#define _C1RXF18_EID_MASK                        0x0003FFFF
//#define _C1RXF18_EID_LENGTH                      0x00000012

//#define _C1RXF18_EXID_POSITION                   0x00000013
//#define _C1RXF18_EXID_MASK                       0x00080000
//#define _C1RXF18_EXID_LENGTH                     0x00000001

//#define _C1RXF18_SID_POSITION                    0x00000015
//#define _C1RXF18_SID_MASK                        0xFFE00000
//#define _C1RXF18_SID_LENGTH                      0x0000000B

//#define _C1RXF18_w_POSITION                      0x00000000
//#define _C1RXF18_w_MASK                          0xFFFFFFFF
//#define _C1RXF18_w_LENGTH                        0x00000020

//#define _C1RXF19_EID_POSITION                    0x00000000
//#define _C1RXF19_EID_MASK                        0x0003FFFF
//#define _C1RXF19_EID_LENGTH                      0x00000012

//#define _C1RXF19_EXID_POSITION                   0x00000013
//#define _C1RXF19_EXID_MASK                       0x00080000
//#define _C1RXF19_EXID_LENGTH                     0x00000001

//#define _C1RXF19_SID_POSITION                    0x00000015
//#define _C1RXF19_SID_MASK                        0xFFE00000
//#define _C1RXF19_SID_LENGTH                      0x0000000B

//#define _C1RXF19_w_POSITION                      0x00000000
//#define _C1RXF19_w_MASK                          0xFFFFFFFF
//#define _C1RXF19_w_LENGTH                        0x00000020

//#define _C1RXF20_EID_POSITION                    0x00000000
//#define _C1RXF20_EID_MASK                        0x0003FFFF
//#define _C1RXF20_EID_LENGTH                      0x00000012

//#define _C1RXF20_EXID_POSITION                   0x00000013
//#define _C1RXF20_EXID_MASK                       0x00080000
//#define _C1RXF20_EXID_LENGTH                     0x00000001

//#define _C1RXF20_SID_POSITION                    0x00000015
//#define _C1RXF20_SID_MASK                        0xFFE00000
//#define _C1RXF20_SID_LENGTH                      0x0000000B

//#define _C1RXF20_w_POSITION                      0x00000000
//#define _C1RXF20_w_MASK                          0xFFFFFFFF
//#define _C1RXF20_w_LENGTH                        0x00000020

//#define _C1RXF21_EID_POSITION                    0x00000000
//#define _C1RXF21_EID_MASK                        0x0003FFFF
//#define _C1RXF21_EID_LENGTH                      0x00000012

