HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C1FIFOCON11_DONLY_POSITION              0x0000000C
//#define _C1FIFOCON11_DONLY_MASK                  0x00001000
//#define _C1FIFOCON11_DONLY_LENGTH                0x00000001

//#define _C1FIFOCON11_UINC_POSITION               0x0000000D
//#define _C1FIFOCON11_UINC_MASK                   0x00002000
//#define _C1FIFOCON11_UINC_LENGTH                 0x00000001

//#define _C1FIFOCON11_FRESET_POSITION             0x0000000E
//#define _C1FIFOCON11_FRESET_MASK                 0x00004000
//#define _C1FIFOCON11_FRESET_LENGTH               0x00000001

//#define _C1FIFOCON11_FSIZE_POSITION              0x00000010
//#define _C1FIFOCON11_FSIZE_MASK                  0x001F0000
//#define _C1FIFOCON11_FSIZE_LENGTH                0x00000005

//#define _C1FIFOCON11_w_POSITION                  0x00000000
//#define _C1FIFOCON11_w_MASK                      0xFFFFFFFF
//#define _C1FIFOCON11_w_LENGTH                    0x00000020

//#define _C1FIFOINT11_RXNEMPTYIF_POSITION         0x00000000
//#define _C1FIFOINT11_RXNEMPTYIF_MASK             0x00000001
//#define _C1FIFOINT11_RXNEMPTYIF_LENGTH           0x00000001

//#define _C1FIFOINT11_RXHALFIF_POSITION           0x00000001
//#define _C1FIFOINT11_RXHALFIF_MASK               0x00000002
//#define _C1FIFOINT11_RXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT11_RXFULLIF_POSITION           0x00000002
//#define _C1FIFOINT11_RXFULLIF_MASK               0x00000004
//#define _C1FIFOINT11_RXFULLIF_LENGTH             0x00000001

//#define _C1FIFOINT11_RXOVFLIF_POSITION           0x00000003
//#define _C1FIFOINT11_RXOVFLIF_MASK               0x00000008
//#define _C1FIFOINT11_RXOVFLIF_LENGTH             0x00000001

//#define _C1FIFOINT11_TXEMPTYIF_POSITION          0x00000008
//#define _C1FIFOINT11_TXEMPTYIF_MASK              0x00000100
//#define _C1FIFOINT11_TXEMPTYIF_LENGTH            0x00000001

//#define _C1FIFOINT11_TXHALFIF_POSITION           0x00000009
//#define _C1FIFOINT11_TXHALFIF_MASK               0x00000200
//#define _C1FIFOINT11_TXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT11_TXNFULLIF_POSITION          0x0000000A
//#define _C1FIFOINT11_TXNFULLIF_MASK              0x00000400
//#define _C1FIFOINT11_TXNFULLIF_LENGTH            0x00000001

//#define _C1FIFOINT11_RXNEMPTYIE_POSITION         0x00000010
//#define _C1FIFOINT11_RXNEMPTYIE_MASK             0x00010000
//#define _C1FIFOINT11_RXNEMPTYIE_LENGTH           0x00000001

//#define _C1FIFOINT11_RXHALFIE_POSITION           0x00000011
//#define _C1FIFOINT11_RXHALFIE_MASK               0x00020000
//#define _C1FIFOINT11_RXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT11_RXFULLIE_POSITION           0x00000012
//#define _C1FIFOINT11_RXFULLIE_MASK               0x00040000
//#define _C1FIFOINT11_RXFULLIE_LENGTH             0x00000001

//#define _C1FIFOINT11_RXOVFLIE_POSITION           0x00000013
//#define _C1FIFOINT11_RXOVFLIE_MASK               0x00080000
//#define _C1FIFOINT11_RXOVFLIE_LENGTH             0x00000001

//#define _C1FIFOINT11_TXEMPTYIE_POSITION          0x00000018
//#define _C1FIFOINT11_TXEMPTYIE_MASK              0x01000000
//#define _C1FIFOINT11_TXEMPTYIE_LENGTH            0x00000001

//#define _C1FIFOINT11_TXHALFIE_POSITION           0x00000019
//#define _C1FIFOINT11_TXHALFIE_MASK               0x02000000
//#define _C1FIFOINT11_TXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT11_TXNFULLIE_POSITION          0x0000001A
//#define _C1FIFOINT11_TXNFULLIE_MASK              0x04000000
//#define _C1FIFOINT11_TXNFULLIE_LENGTH            0x00000001

//#define _C1FIFOINT11_w_POSITION                  0x00000000
//#define _C1FIFOINT11_w_MASK                      0xFFFFFFFF
//#define _C1FIFOINT11_w_LENGTH                    0x00000020

//#define _C1FIFOCI11_CFIFOCI_POSITION             0x00000000
//#define _C1FIFOCI11_CFIFOCI_MASK                 0x0000001F
//#define _C1FIFOCI11_CFIFOCI_LENGTH               0x00000005

//#define _C1FIFOCI11_w_POSITION                   0x00000000
//#define _C1FIFOCI11_w_MASK                       0xFFFFFFFF
//#define _C1FIFOCI11_w_LENGTH                     0x00000020

//#define _C1FIFOCON12_TXPRI_POSITION              0x00000000
//#define _C1FIFOCON12_TXPRI_MASK                  0x00000003
//#define _C1FIFOCON12_TXPRI_LENGTH                0x00000002

//#define _C1FIFOCON12_RTREN_POSITION              0x00000002
//#define _C1FIFOCON12_RTREN_MASK                  0x00000004
//#define _C1FIFOCON12_RTREN_LENGTH                0x00000001

//#define _C1FIFOCON12_TXREQ_POSITION              0x00000003
//#define _C1FIFOCON12_TXREQ_MASK                  0x00000008
//#define _C1FIFOCON12_TXREQ_LENGTH                0x00000001

//#define _C1FIFOCON12_TXERR_POSITION              0x00000004
//#define _C1FIFOCON12_TXERR_MASK                  0x00000010
//#define _C1FIFOCON12_TXERR_LENGTH                0x00000001

//#define _C1FIFOCON12_TXLARB_POSITION             0x00000005
//#define _C1FIFOCON12_TXLARB_MASK                 0x00000020
//#define _C1FIFOCON12_TXLARB_LENGTH               0x00000001

//#define _C1FIFOCON12_TXABAT_POSITION             0x00000006
//#define _C1FIFOCON12_TXABAT_MASK                 0x00000040
//#define _C1FIFOCON12_TXABAT_LENGTH               0x00000001

//#define _C1FIFOCON12_TXEN_POSITION               0x00000007
//#define _C1FIFOCON12_TXEN_MASK                   0x00000080
//#define _C1FIFOCON12_TXEN_LENGTH                 0x00000001

//#define _C1FIFOCON12_DONLY_POSITION              0x0000000C
//#define _C1FIFOCON12_DONLY_MASK                  0x00001000
//#define _C1FIFOCON12_DONLY_LENGTH                0x00000001

//#define _C1FIFOCON12_UINC_POSITION               0x0000000D
//#define _C1FIFOCON12_UINC_MASK                   0x00002000
//#define _C1FIFOCON12_UINC_LENGTH                 0x00000001

//#define _C1FIFOCON12_FRESET_POSITION             0x0000000E
//#define _C1FIFOCON12_FRESET_MASK                 0x00004000
//#define _C1FIFOCON12_FRESET_LENGTH               0x00000001

//#define _C1FIFOCON12_FSIZE_POSITION              0x00000010
//#define _C1FIFOCON12_FSIZE_MASK                  0x001F0000
//#define _C1FIFOCON12_FSIZE_LENGTH                0x00000005

//#define _C1FIFOCON12_w_POSITION                  0x00000000
//#define _C1FIFOCON12_w_MASK                      0xFFFFFFFF
//#define _C1FIFOCON12_w_LENGTH                    0x00000020

//#define _C1FIFOINT12_RXNEMPTYIF_POSITION         0x00000000
//#define _C1FIFOINT12_RXNEMPTYIF_MASK             0x00000001
//#define _C1FIFOINT12_RXNEMPTYIF_LENGTH           0x00000001

