HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C1FIFOINT19_TXNFULLIF_POSITION          0x0000000A
//#define _C1FIFOINT19_TXNFULLIF_MASK              0x00000400
//#define _C1FIFOINT19_TXNFULLIF_LENGTH            0x00000001

//#define _C1FIFOINT19_RXNEMPTYIE_POSITION         0x00000010
//#define _C1FIFOINT19_RXNEMPTYIE_MASK             0x00010000
//#define _C1FIFOINT19_RXNEMPTYIE_LENGTH           0x00000001

//#define _C1FIFOINT19_RXHALFIE_POSITION           0x00000011
//#define _C1FIFOINT19_RXHALFIE_MASK               0x00020000
//#define _C1FIFOINT19_RXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT19_RXFULLIE_POSITION           0x00000012
//#define _C1FIFOINT19_RXFULLIE_MASK               0x00040000
//#define _C1FIFOINT19_RXFULLIE_LENGTH             0x00000001

//#define _C1FIFOINT19_RXOVFLIE_POSITION           0x00000013
//#define _C1FIFOINT19_RXOVFLIE_MASK               0x00080000
//#define _C1FIFOINT19_RXOVFLIE_LENGTH             0x00000001

//#define _C1FIFOINT19_TXEMPTYIE_POSITION          0x00000018
//#define _C1FIFOINT19_TXEMPTYIE_MASK              0x01000000
//#define _C1FIFOINT19_TXEMPTYIE_LENGTH            0x00000001

//#define _C1FIFOINT19_TXHALFIE_POSITION           0x00000019
//#define _C1FIFOINT19_TXHALFIE_MASK               0x02000000
//#define _C1FIFOINT19_TXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT19_TXNFULLIE_POSITION          0x0000001A
//#define _C1FIFOINT19_TXNFULLIE_MASK              0x04000000
//#define _C1FIFOINT19_TXNFULLIE_LENGTH            0x00000001

//#define _C1FIFOINT19_w_POSITION                  0x00000000
//#define _C1FIFOINT19_w_MASK                      0xFFFFFFFF
//#define _C1FIFOINT19_w_LENGTH                    0x00000020

//#define _C1FIFOCI19_CFIFOCI_POSITION             0x00000000
//#define _C1FIFOCI19_CFIFOCI_MASK                 0x0000001F
//#define _C1FIFOCI19_CFIFOCI_LENGTH               0x00000005

//#define _C1FIFOCI19_w_POSITION                   0x00000000
//#define _C1FIFOCI19_w_MASK                       0xFFFFFFFF
//#define _C1FIFOCI19_w_LENGTH                     0x00000020

//#define _C1FIFOCON20_TXPRI_POSITION              0x00000000
//#define _C1FIFOCON20_TXPRI_MASK                  0x00000003
//#define _C1FIFOCON20_TXPRI_LENGTH                0x00000002

//#define _C1FIFOCON20_RTREN_POSITION              0x00000002
//#define _C1FIFOCON20_RTREN_MASK                  0x00000004
//#define _C1FIFOCON20_RTREN_LENGTH                0x00000001

//#define _C1FIFOCON20_TXREQ_POSITION              0x00000003
//#define _C1FIFOCON20_TXREQ_MASK                  0x00000008
//#define _C1FIFOCON20_TXREQ_LENGTH                0x00000001

//#define _C1FIFOCON20_TXERR_POSITION              0x00000004
//#define _C1FIFOCON20_TXERR_MASK                  0x00000010
//#define _C1FIFOCON20_TXERR_LENGTH                0x00000001

//#define _C1FIFOCON20_TXLARB_POSITION             0x00000005
//#define _C1FIFOCON20_TXLARB_MASK                 0x00000020
//#define _C1FIFOCON20_TXLARB_LENGTH               0x00000001

//#define _C1FIFOCON20_TXABAT_POSITION             0x00000006
//#define _C1FIFOCON20_TXABAT_MASK                 0x00000040
//#define _C1FIFOCON20_TXABAT_LENGTH               0x00000001

//#define _C1FIFOCON20_TXEN_POSITION               0x00000007
//#define _C1FIFOCON20_TXEN_MASK                   0x00000080
//#define _C1FIFOCON20_TXEN_LENGTH                 0x00000001

//#define _C1FIFOCON20_DONLY_POSITION              0x0000000C
//#define _C1FIFOCON20_DONLY_MASK                  0x00001000
//#define _C1FIFOCON20_DONLY_LENGTH                0x00000001

//#define _C1FIFOCON20_UINC_POSITION               0x0000000D
//#define _C1FIFOCON20_UINC_MASK                   0x00002000
//#define _C1FIFOCON20_UINC_LENGTH                 0x00000001

//#define _C1FIFOCON20_FRESET_POSITION             0x0000000E
//#define _C1FIFOCON20_FRESET_MASK                 0x00004000
//#define _C1FIFOCON20_FRESET_LENGTH               0x00000001

//#define _C1FIFOCON20_FSIZE_POSITION              0x00000010
//#define _C1FIFOCON20_FSIZE_MASK                  0x001F0000
//#define _C1FIFOCON20_FSIZE_LENGTH                0x00000005

//#define _C1FIFOCON20_w_POSITION                  0x00000000
//#define _C1FIFOCON20_w_MASK                      0xFFFFFFFF
//#define _C1FIFOCON20_w_LENGTH                    0x00000020

//#define _C1FIFOINT20_RXNEMPTYIF_POSITION         0x00000000
//#define _C1FIFOINT20_RXNEMPTYIF_MASK             0x00000001
//#define _C1FIFOINT20_RXNEMPTYIF_LENGTH           0x00000001

//#define _C1FIFOINT20_RXHALFIF_POSITION           0x00000001
//#define _C1FIFOINT20_RXHALFIF_MASK               0x00000002
//#define _C1FIFOINT20_RXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT20_RXFULLIF_POSITION           0x00000002
//#define _C1FIFOINT20_RXFULLIF_MASK               0x00000004
//#define _C1FIFOINT20_RXFULLIF_LENGTH             0x00000001

//#define _C1FIFOINT20_RXOVFLIF_POSITION           0x00000003
//#define _C1FIFOINT20_RXOVFLIF_MASK               0x00000008
//#define _C1FIFOINT20_RXOVFLIF_LENGTH             0x00000001

//#define _C1FIFOINT20_TXEMPTYIF_POSITION          0x00000008
//#define _C1FIFOINT20_TXEMPTYIF_MASK              0x00000100
//#define _C1FIFOINT20_TXEMPTYIF_LENGTH            0x00000001

//#define _C1FIFOINT20_TXHALFIF_POSITION           0x00000009
//#define _C1FIFOINT20_TXHALFIF_MASK               0x00000200
//#define _C1FIFOINT20_TXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT20_TXNFULLIF_POSITION          0x0000000A
//#define _C1FIFOINT20_TXNFULLIF_MASK              0x00000400
//#define _C1FIFOINT20_TXNFULLIF_LENGTH            0x00000001

//#define _C1FIFOINT20_RXNEMPTYIE_POSITION         0x00000010
//#define _C1FIFOINT20_RXNEMPTYIE_MASK             0x00010000
//#define _C1FIFOINT20_RXNEMPTYIE_LENGTH           0x00000001

//#define _C1FIFOINT20_RXHALFIE_POSITION           0x00000011
//#define _C1FIFOINT20_RXHALFIE_MASK               0x00020000
//#define _C1FIFOINT20_RXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT20_RXFULLIE_POSITION           0x00000012
//#define _C1FIFOINT20_RXFULLIE_MASK               0x00040000
//#define _C1FIFOINT20_RXFULLIE_LENGTH             0x00000001

