HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C1FIFOINT20_RXOVFLIE_POSITION           0x00000013
//#define _C1FIFOINT20_RXOVFLIE_MASK               0x00080000
//#define _C1FIFOINT20_RXOVFLIE_LENGTH             0x00000001

//#define _C1FIFOINT20_TXEMPTYIE_POSITION          0x00000018
//#define _C1FIFOINT20_TXEMPTYIE_MASK              0x01000000
//#define _C1FIFOINT20_TXEMPTYIE_LENGTH            0x00000001

//#define _C1FIFOINT20_TXHALFIE_POSITION           0x00000019
//#define _C1FIFOINT20_TXHALFIE_MASK               0x02000000
//#define _C1FIFOINT20_TXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT20_TXNFULLIE_POSITION          0x0000001A
//#define _C1FIFOINT20_TXNFULLIE_MASK              0x04000000
//#define _C1FIFOINT20_TXNFULLIE_LENGTH            0x00000001

//#define _C1FIFOINT20_w_POSITION                  0x00000000
//#define _C1FIFOINT20_w_MASK                      0xFFFFFFFF
//#define _C1FIFOINT20_w_LENGTH                    0x00000020

//#define _C1FIFOCI20_CFIFOCI_POSITION             0x00000000
//#define _C1FIFOCI20_CFIFOCI_MASK                 0x0000001F
//#define _C1FIFOCI20_CFIFOCI_LENGTH               0x00000005

//#define _C1FIFOCI20_w_POSITION                   0x00000000
//#define _C1FIFOCI20_w_MASK                       0xFFFFFFFF
//#define _C1FIFOCI20_w_LENGTH                     0x00000020

//#define _C1FIFOCON21_TXPRI_POSITION              0x00000000
//#define _C1FIFOCON21_TXPRI_MASK                  0x00000003
//#define _C1FIFOCON21_TXPRI_LENGTH                0x00000002

//#define _C1FIFOCON21_RTREN_POSITION              0x00000002
//#define _C1FIFOCON21_RTREN_MASK                  0x00000004
//#define _C1FIFOCON21_RTREN_LENGTH                0x00000001

//#define _C1FIFOCON21_TXREQ_POSITION              0x00000003
//#define _C1FIFOCON21_TXREQ_MASK                  0x00000008
//#define _C1FIFOCON21_TXREQ_LENGTH                0x00000001

//#define _C1FIFOCON21_TXERR_POSITION              0x00000004
//#define _C1FIFOCON21_TXERR_MASK                  0x00000010
//#define _C1FIFOCON21_TXERR_LENGTH                0x00000001

//#define _C1FIFOCON21_TXLARB_POSITION             0x00000005
//#define _C1FIFOCON21_TXLARB_MASK                 0x00000020
//#define _C1FIFOCON21_TXLARB_LENGTH               0x00000001

//#define _C1FIFOCON21_TXABAT_POSITION             0x00000006
//#define _C1FIFOCON21_TXABAT_MASK                 0x00000040
//#define _C1FIFOCON21_TXABAT_LENGTH               0x00000001

//#define _C1FIFOCON21_TXEN_POSITION               0x00000007
//#define _C1FIFOCON21_TXEN_MASK                   0x00000080
//#define _C1FIFOCON21_TXEN_LENGTH                 0x00000001

//#define _C1FIFOCON21_DONLY_POSITION              0x0000000C
//#define _C1FIFOCON21_DONLY_MASK                  0x00001000
//#define _C1FIFOCON21_DONLY_LENGTH                0x00000001

//#define _C1FIFOCON21_UINC_POSITION               0x0000000D
//#define _C1FIFOCON21_UINC_MASK                   0x00002000
//#define _C1FIFOCON21_UINC_LENGTH                 0x00000001

//#define _C1FIFOCON21_FRESET_POSITION             0x0000000E
//#define _C1FIFOCON21_FRESET_MASK                 0x00004000
//#define _C1FIFOCON21_FRESET_LENGTH               0x00000001

//#define _C1FIFOCON21_FSIZE_POSITION              0x00000010
//#define _C1FIFOCON21_FSIZE_MASK                  0x001F0000
//#define _C1FIFOCON21_FSIZE_LENGTH                0x00000005

//#define _C1FIFOCON21_w_POSITION                  0x00000000
//#define _C1FIFOCON21_w_MASK                      0xFFFFFFFF
//#define _C1FIFOCON21_w_LENGTH                    0x00000020

//#define _C1FIFOINT21_RXNEMPTYIF_POSITION         0x00000000
//#define _C1FIFOINT21_RXNEMPTYIF_MASK             0x00000001
//#define _C1FIFOINT21_RXNEMPTYIF_LENGTH           0x00000001

//#define _C1FIFOINT21_RXHALFIF_POSITION           0x00000001
//#define _C1FIFOINT21_RXHALFIF_MASK               0x00000002
//#define _C1FIFOINT21_RXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT21_RXFULLIF_POSITION           0x00000002
//#define _C1FIFOINT21_RXFULLIF_MASK               0x00000004
//#define _C1FIFOINT21_RXFULLIF_LENGTH             0x00000001

//#define _C1FIFOINT21_RXOVFLIF_POSITION           0x00000003
//#define _C1FIFOINT21_RXOVFLIF_MASK               0x00000008
//#define _C1FIFOINT21_RXOVFLIF_LENGTH             0x00000001

//#define _C1FIFOINT21_TXEMPTYIF_POSITION          0x00000008
//#define _C1FIFOINT21_TXEMPTYIF_MASK              0x00000100
//#define _C1FIFOINT21_TXEMPTYIF_LENGTH            0x00000001

//#define _C1FIFOINT21_TXHALFIF_POSITION           0x00000009
//#define _C1FIFOINT21_TXHALFIF_MASK               0x00000200
//#define _C1FIFOINT21_TXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT21_TXNFULLIF_POSITION          0x0000000A
//#define _C1FIFOINT21_TXNFULLIF_MASK              0x00000400
//#define _C1FIFOINT21_TXNFULLIF_LENGTH            0x00000001

//#define _C1FIFOINT21_RXNEMPTYIE_POSITION         0x00000010
//#define _C1FIFOINT21_RXNEMPTYIE_MASK             0x00010000
//#define _C1FIFOINT21_RXNEMPTYIE_LENGTH           0x00000001

//#define _C1FIFOINT21_RXHALFIE_POSITION           0x00000011
//#define _C1FIFOINT21_RXHALFIE_MASK               0x00020000
//#define _C1FIFOINT21_RXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT21_RXFULLIE_POSITION           0x00000012
//#define _C1FIFOINT21_RXFULLIE_MASK               0x00040000
//#define _C1FIFOINT21_RXFULLIE_LENGTH             0x00000001

//#define _C1FIFOINT21_RXOVFLIE_POSITION           0x00000013
//#define _C1FIFOINT21_RXOVFLIE_MASK               0x00080000
//#define _C1FIFOINT21_RXOVFLIE_LENGTH             0x00000001

//#define _C1FIFOINT21_TXEMPTYIE_POSITION          0x00000018
//#define _C1FIFOINT21_TXEMPTYIE_MASK              0x01000000
//#define _C1FIFOINT21_TXEMPTYIE_LENGTH            0x00000001

//#define _C1FIFOINT21_TXHALFIE_POSITION           0x00000019
//#define _C1FIFOINT21_TXHALFIE_MASK               0x02000000
//#define _C1FIFOINT21_TXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT21_TXNFULLIE_POSITION          0x0000001A
//#define _C1FIFOINT21_TXNFULLIE_MASK              0x04000000
//#define _C1FIFOINT21_TXNFULLIE_LENGTH            0x00000001

//#define _C1FIFOINT21_w_POSITION                  0x00000000
//#define _C1FIFOINT21_w_MASK                      0xFFFFFFFF
//#define _C1FIFOINT21_w_LENGTH                    0x00000020

//#define _C1FIFOCI21_CFIFOCI_POSITION             0x00000000
//#define _C1FIFOCI21_CFIFOCI_MASK                 0x0000001F
//#define _C1FIFOCI21_CFIFOCI_LENGTH               0x00000005

//#define _C1FIFOCI21_w_POSITION                   0x00000000
//#define _C1FIFOCI21_w_MASK                       0xFFFFFFFF
//#define _C1FIFOCI21_w_LENGTH                     0x00000020

//#define _C1FIFOCON22_TXPRI_POSITION              0x00000000
//#define _C1FIFOCON22_TXPRI_MASK                  0x00000003
//#define _C1FIFOCON22_TXPRI_LENGTH                0x00000002

//#define _C1FIFOCON22_RTREN_POSITION              0x00000002
//#define _C1FIFOCON22_RTREN_MASK                  0x00000004
//#define _C1FIFOCON22_RTREN_LENGTH                0x00000001

