HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C1FIFOCON22_TXREQ_POSITION              0x00000003
//#define _C1FIFOCON22_TXREQ_MASK                  0x00000008
//#define _C1FIFOCON22_TXREQ_LENGTH                0x00000001

//#define _C1FIFOCON22_TXERR_POSITION              0x00000004
//#define _C1FIFOCON22_TXERR_MASK                  0x00000010
//#define _C1FIFOCON22_TXERR_LENGTH                0x00000001

//#define _C1FIFOCON22_TXLARB_POSITION             0x00000005
//#define _C1FIFOCON22_TXLARB_MASK                 0x00000020
//#define _C1FIFOCON22_TXLARB_LENGTH               0x00000001

//#define _C1FIFOCON22_TXABAT_POSITION             0x00000006
//#define _C1FIFOCON22_TXABAT_MASK                 0x00000040
//#define _C1FIFOCON22_TXABAT_LENGTH               0x00000001

//#define _C1FIFOCON22_TXEN_POSITION               0x00000007
//#define _C1FIFOCON22_TXEN_MASK                   0x00000080
//#define _C1FIFOCON22_TXEN_LENGTH                 0x00000001

//#define _C1FIFOCON22_DONLY_POSITION              0x0000000C
//#define _C1FIFOCON22_DONLY_MASK                  0x00001000
//#define _C1FIFOCON22_DONLY_LENGTH                0x00000001

//#define _C1FIFOCON22_UINC_POSITION               0x0000000D
//#define _C1FIFOCON22_UINC_MASK                   0x00002000
//#define _C1FIFOCON22_UINC_LENGTH                 0x00000001

//#define _C1FIFOCON22_FRESET_POSITION             0x0000000E
//#define _C1FIFOCON22_FRESET_MASK                 0x00004000
//#define _C1FIFOCON22_FRESET_LENGTH               0x00000001

//#define _C1FIFOCON22_FSIZE_POSITION              0x00000010
//#define _C1FIFOCON22_FSIZE_MASK                  0x001F0000
//#define _C1FIFOCON22_FSIZE_LENGTH                0x00000005

//#define _C1FIFOCON22_w_POSITION                  0x00000000
//#define _C1FIFOCON22_w_MASK                      0xFFFFFFFF
//#define _C1FIFOCON22_w_LENGTH                    0x00000020

//#define _C1FIFOINT22_RXNEMPTYIF_POSITION         0x00000000
//#define _C1FIFOINT22_RXNEMPTYIF_MASK             0x00000001
//#define _C1FIFOINT22_RXNEMPTYIF_LENGTH           0x00000001

//#define _C1FIFOINT22_RXHALFIF_POSITION           0x00000001
//#define _C1FIFOINT22_RXHALFIF_MASK               0x00000002
//#define _C1FIFOINT22_RXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT22_RXFULLIF_POSITION           0x00000002
//#define _C1FIFOINT22_RXFULLIF_MASK               0x00000004
//#define _C1FIFOINT22_RXFULLIF_LENGTH             0x00000001

//#define _C1FIFOINT22_RXOVFLIF_POSITION           0x00000003
//#define _C1FIFOINT22_RXOVFLIF_MASK               0x00000008
//#define _C1FIFOINT22_RXOVFLIF_LENGTH             0x00000001

//#define _C1FIFOINT22_TXEMPTYIF_POSITION          0x00000008
//#define _C1FIFOINT22_TXEMPTYIF_MASK              0x00000100
//#define _C1FIFOINT22_TXEMPTYIF_LENGTH            0x00000001

//#define _C1FIFOINT22_TXHALFIF_POSITION           0x00000009
//#define _C1FIFOINT22_TXHALFIF_MASK               0x00000200
//#define _C1FIFOINT22_TXHALFIF_LENGTH             0x00000001

//#define _C1FIFOINT22_TXNFULLIF_POSITION          0x0000000A
//#define _C1FIFOINT22_TXNFULLIF_MASK              0x00000400
//#define _C1FIFOINT22_TXNFULLIF_LENGTH            0x00000001

//#define _C1FIFOINT22_RXNEMPTYIE_POSITION         0x00000010
//#define _C1FIFOINT22_RXNEMPTYIE_MASK             0x00010000
//#define _C1FIFOINT22_RXNEMPTYIE_LENGTH           0x00000001

//#define _C1FIFOINT22_RXHALFIE_POSITION           0x00000011
//#define _C1FIFOINT22_RXHALFIE_MASK               0x00020000
//#define _C1FIFOINT22_RXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT22_RXFULLIE_POSITION           0x00000012
//#define _C1FIFOINT22_RXFULLIE_MASK               0x00040000
//#define _C1FIFOINT22_RXFULLIE_LENGTH             0x00000001

//#define _C1FIFOINT22_RXOVFLIE_POSITION           0x00000013
//#define _C1FIFOINT22_RXOVFLIE_MASK               0x00080000
//#define _C1FIFOINT22_RXOVFLIE_LENGTH             0x00000001

//#define _C1FIFOINT22_TXEMPTYIE_POSITION          0x00000018
//#define _C1FIFOINT22_TXEMPTYIE_MASK              0x01000000
//#define _C1FIFOINT22_TXEMPTYIE_LENGTH            0x00000001

//#define _C1FIFOINT22_TXHALFIE_POSITION           0x00000019
//#define _C1FIFOINT22_TXHALFIE_MASK               0x02000000
//#define _C1FIFOINT22_TXHALFIE_LENGTH             0x00000001

//#define _C1FIFOINT22_TXNFULLIE_POSITION          0x0000001A
//#define _C1FIFOINT22_TXNFULLIE_MASK              0x04000000
//#define _C1FIFOINT22_TXNFULLIE_LENGTH            0x00000001

//#define _C1FIFOINT22_w_POSITION                  0x00000000
//#define _C1FIFOINT22_w_MASK                      0xFFFFFFFF
//#define _C1FIFOINT22_w_LENGTH                    0x00000020

//#define _C1FIFOCI22_CFIFOCI_POSITION             0x00000000
//#define _C1FIFOCI22_CFIFOCI_MASK                 0x0000001F
//#define _C1FIFOCI22_CFIFOCI_LENGTH               0x00000005

//#define _C1FIFOCI22_w_POSITION                   0x00000000
//#define _C1FIFOCI22_w_MASK                       0xFFFFFFFF
//#define _C1FIFOCI22_w_LENGTH                     0x00000020

//#define _C1FIFOCON23_TXPRI_POSITION              0x00000000
//#define _C1FIFOCON23_TXPRI_MASK                  0x00000003
//#define _C1FIFOCON23_TXPRI_LENGTH                0x00000002

//#define _C1FIFOCON23_RTREN_POSITION              0x00000002
//#define _C1FIFOCON23_RTREN_MASK                  0x00000004
//#define _C1FIFOCON23_RTREN_LENGTH                0x00000001

//#define _C1FIFOCON23_TXREQ_POSITION              0x00000003
//#define _C1FIFOCON23_TXREQ_MASK                  0x00000008
//#define _C1FIFOCON23_TXREQ_LENGTH                0x00000001

//#define _C1FIFOCON23_TXERR_POSITION              0x00000004
//#define _C1FIFOCON23_TXERR_MASK                  0x00000010
//#define _C1FIFOCON23_TXERR_LENGTH                0x00000001

//#define _C1FIFOCON23_TXLARB_POSITION             0x00000005
//#define _C1FIFOCON23_TXLARB_MASK                 0x00000020
//#define _C1FIFOCON23_TXLARB_LENGTH               0x00000001

//#define _C1FIFOCON23_TXABAT_POSITION             0x00000006
//#define _C1FIFOCON23_TXABAT_MASK                 0x00000040
//#define _C1FIFOCON23_TXABAT_LENGTH               0x00000001

//#define _C1FIFOCON23_TXEN_POSITION               0x00000007
//#define _C1FIFOCON23_TXEN_MASK                   0x00000080
//#define _C1FIFOCON23_TXEN_LENGTH                 0x00000001

//#define _C1FIFOCON23_DONLY_POSITION              0x0000000C
//#define _C1FIFOCON23_DONLY_MASK                  0x00001000
//#define _C1FIFOCON23_DONLY_LENGTH                0x00000001

//#define _C1FIFOCON23_UINC_POSITION               0x0000000D
//#define _C1FIFOCON23_UINC_MASK                   0x00002000
//#define _C1FIFOCON23_UINC_LENGTH                 0x00000001

//#define _C1FIFOCON23_FRESET_POSITION             0x0000000E
//#define _C1FIFOCON23_FRESET_MASK                 0x00004000
//#define _C1FIFOCON23_FRESET_LENGTH               0x00000001

