HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C2CON_ON_POSITION                       0x0000000F
//#define _C2CON_ON_MASK                           0x00008000
//#define _C2CON_ON_LENGTH                         0x00000001

//#define _C2CON_CANCAP_POSITION                   0x00000014
//#define _C2CON_CANCAP_MASK                       0x00100000
//#define _C2CON_CANCAP_LENGTH                     0x00000001

//#define _C2CON_OPMOD_POSITION                    0x00000015
//#define _C2CON_OPMOD_MASK                        0x00E00000
//#define _C2CON_OPMOD_LENGTH                      0x00000003

//#define _C2CON_REQOP_POSITION                    0x00000018
//#define _C2CON_REQOP_MASK                        0x07000000
//#define _C2CON_REQOP_LENGTH                      0x00000003

//#define _C2CON_ABAT_POSITION                     0x0000001B
//#define _C2CON_ABAT_MASK                         0x08000000
//#define _C2CON_ABAT_LENGTH                       0x00000001

//#define _C2CON_w_POSITION                        0x00000000
//#define _C2CON_w_MASK                            0xFFFFFFFF
//#define _C2CON_w_LENGTH                          0x00000020

//#define _C2CFG_BRP_POSITION                      0x00000000
//#define _C2CFG_BRP_MASK                          0x0000003F
//#define _C2CFG_BRP_LENGTH                        0x00000006

//#define _C2CFG_SJW_POSITION                      0x00000006
//#define _C2CFG_SJW_MASK                          0x000000C0
//#define _C2CFG_SJW_LENGTH                        0x00000002

//#define _C2CFG_PRSEG_POSITION                    0x00000008
//#define _C2CFG_PRSEG_MASK                        0x00000700
//#define _C2CFG_PRSEG_LENGTH                      0x00000003

//#define _C2CFG_SEG1PH_POSITION                   0x0000000B
//#define _C2CFG_SEG1PH_MASK                       0x00003800
//#define _C2CFG_SEG1PH_LENGTH                     0x00000003

//#define _C2CFG_SAM_POSITION                      0x0000000E
//#define _C2CFG_SAM_MASK                          0x00004000
//#define _C2CFG_SAM_LENGTH                        0x00000001

//#define _C2CFG_SEG2PHTS_POSITION                 0x0000000F
//#define _C2CFG_SEG2PHTS_MASK                     0x00008000
//#define _C2CFG_SEG2PHTS_LENGTH                   0x00000001

//#define _C2CFG_SEG2PH_POSITION                   0x00000010
//#define _C2CFG_SEG2PH_MASK                       0x00070000
//#define _C2CFG_SEG2PH_LENGTH                     0x00000003

//#define _C2CFG_WAKFIL_POSITION                   0x00000016
//#define _C2CFG_WAKFIL_MASK                       0x00400000
//#define _C2CFG_WAKFIL_LENGTH                     0x00000001

//#define _C2CFG_w_POSITION                        0x00000000
//#define _C2CFG_w_MASK                            0xFFFFFFFF
//#define _C2CFG_w_LENGTH                          0x00000020

//#define _C2INT_TBIF_POSITION                     0x00000000
//#define _C2INT_TBIF_MASK                         0x00000001
//#define _C2INT_TBIF_LENGTH                       0x00000001

//#define _C2INT_RBIF_POSITION                     0x00000001
//#define _C2INT_RBIF_MASK                         0x00000002
//#define _C2INT_RBIF_LENGTH                       0x00000001

//#define _C2INT_CTMRIF_POSITION                   0x00000002
//#define _C2INT_CTMRIF_MASK                       0x00000004
//#define _C2INT_CTMRIF_LENGTH                     0x00000001

//#define _C2INT_MODIF_POSITION                    0x00000003
//#define _C2INT_MODIF_MASK                        0x00000008
//#define _C2INT_MODIF_LENGTH                      0x00000001

//#define _C2INT_RBOVIF_POSITION                   0x0000000B
//#define _C2INT_RBOVIF_MASK                       0x00000800
//#define _C2INT_RBOVIF_LENGTH                     0x00000001

//#define _C2INT_SERRIF_POSITION                   0x0000000C
//#define _C2INT_SERRIF_MASK                       0x00001000
//#define _C2INT_SERRIF_LENGTH                     0x00000001

//#define _C2INT_CERRIF_POSITION                   0x0000000D
//#define _C2INT_CERRIF_MASK                       0x00002000
//#define _C2INT_CERRIF_LENGTH                     0x00000001

//#define _C2INT_WAKIF_POSITION                    0x0000000E
//#define _C2INT_WAKIF_MASK                        0x00004000
//#define _C2INT_WAKIF_LENGTH                      0x00000001

//#define _C2INT_IVRIF_POSITION                    0x0000000F
//#define _C2INT_IVRIF_MASK                        0x00008000
//#define _C2INT_IVRIF_LENGTH                      0x00000001

//#define _C2INT_TBIE_POSITION                     0x00000010
//#define _C2INT_TBIE_MASK                         0x00010000
//#define _C2INT_TBIE_LENGTH                       0x00000001

//#define _C2INT_RBIE_POSITION                     0x00000011
//#define _C2INT_RBIE_MASK                         0x00020000
//#define _C2INT_RBIE_LENGTH                       0x00000001

//#define _C2INT_CTMRIE_POSITION                   0x00000012
//#define _C2INT_CTMRIE_MASK                       0x00040000
//#define _C2INT_CTMRIE_LENGTH                     0x00000001

//#define _C2INT_MODIE_POSITION                    0x00000013
//#define _C2INT_MODIE_MASK                        0x00080000
//#define _C2INT_MODIE_LENGTH                      0x00000001

//#define _C2INT_RBOVIE_POSITION                   0x0000001B
//#define _C2INT_RBOVIE_MASK                       0x08000000
//#define _C2INT_RBOVIE_LENGTH                     0x00000001

//#define _C2INT_SERRIE_POSITION                   0x0000001C
//#define _C2INT_SERRIE_MASK                       0x10000000
//#define _C2INT_SERRIE_LENGTH                     0x00000001

//#define _C2INT_CERRIE_POSITION                   0x0000001D
//#define _C2INT_CERRIE_MASK                       0x20000000
//#define _C2INT_CERRIE_LENGTH                     0x00000001

//#define _C2INT_WAKIE_POSITION                    0x0000001E
//#define _C2INT_WAKIE_MASK                        0x40000000
//#define _C2INT_WAKIE_LENGTH                      0x00000001

//#define _C2INT_IVRIE_POSITION                    0x0000001F
//#define _C2INT_IVRIE_MASK                        0x80000000
//#define _C2INT_IVRIE_LENGTH                      0x00000001

//#define _C2INT_w_POSITION                        0x00000000
//#define _C2INT_w_MASK                            0xFFFFFFFF
//#define _C2INT_w_LENGTH                          0x00000020

//#define _C2VEC_ICODE_POSITION                    0x00000000
//#define _C2VEC_ICODE_MASK                        0x0000007F
//#define _C2VEC_ICODE_LENGTH                      0x00000007

//#define _C2VEC_FILHIT_POSITION                   0x00000008
//#define _C2VEC_FILHIT_MASK                       0x00001F00
//#define _C2VEC_FILHIT_LENGTH                     0x00000005

//#define _C2VEC_w_POSITION                        0x00000000
//#define _C2VEC_w_MASK                            0xFFFFFFFF
//#define _C2VEC_w_LENGTH                          0x00000020

//#define _C2TREC_RERRCNT_POSITION                 0x00000000
//#define _C2TREC_RERRCNT_MASK                     0x000000FF
//#define _C2TREC_RERRCNT_LENGTH                   0x00000008

//#define _C2TREC_TERRCNT_POSITION                 0x00000008
//#define _C2TREC_TERRCNT_MASK                     0x0000FF00
//#define _C2TREC_TERRCNT_LENGTH                   0x00000008

