HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C2FLTCON0_FSEL3_POSITION                0x00000018
//#define _C2FLTCON0_FSEL3_MASK                    0x1F000000
//#define _C2FLTCON0_FSEL3_LENGTH                  0x00000005

//#define _C2FLTCON0_MSEL3_POSITION                0x0000001D
//#define _C2FLTCON0_MSEL3_MASK                    0x60000000
//#define _C2FLTCON0_MSEL3_LENGTH                  0x00000002

//#define _C2FLTCON0_FLTEN3_POSITION               0x0000001F
//#define _C2FLTCON0_FLTEN3_MASK                   0x80000000
//#define _C2FLTCON0_FLTEN3_LENGTH                 0x00000001

//#define _C2FLTCON0_w_POSITION                    0x00000000
//#define _C2FLTCON0_w_MASK                        0xFFFFFFFF
//#define _C2FLTCON0_w_LENGTH                      0x00000020

//#define _C2FLTCON1_FSEL4_POSITION                0x00000000
//#define _C2FLTCON1_FSEL4_MASK                    0x0000001F
//#define _C2FLTCON1_FSEL4_LENGTH                  0x00000005

//#define _C2FLTCON1_MSEL4_POSITION                0x00000005
//#define _C2FLTCON1_MSEL4_MASK                    0x00000060
//#define _C2FLTCON1_MSEL4_LENGTH                  0x00000002

//#define _C2FLTCON1_FLTEN4_POSITION               0x00000007
//#define _C2FLTCON1_FLTEN4_MASK                   0x00000080
//#define _C2FLTCON1_FLTEN4_LENGTH                 0x00000001

//#define _C2FLTCON1_FSEL5_POSITION                0x00000008
//#define _C2FLTCON1_FSEL5_MASK                    0x00001F00
//#define _C2FLTCON1_FSEL5_LENGTH                  0x00000005

//#define _C2FLTCON1_MSEL5_POSITION                0x0000000D
//#define _C2FLTCON1_MSEL5_MASK                    0x00006000
//#define _C2FLTCON1_MSEL5_LENGTH                  0x00000002

//#define _C2FLTCON1_FLTEN5_POSITION               0x0000000F
//#define _C2FLTCON1_FLTEN5_MASK                   0x00008000
//#define _C2FLTCON1_FLTEN5_LENGTH                 0x00000001

//#define _C2FLTCON1_FSEL6_POSITION                0x00000010
//#define _C2FLTCON1_FSEL6_MASK                    0x001F0000
//#define _C2FLTCON1_FSEL6_LENGTH                  0x00000005

//#define _C2FLTCON1_MSEL6_POSITION                0x00000015
//#define _C2FLTCON1_MSEL6_MASK                    0x00600000
//#define _C2FLTCON1_MSEL6_LENGTH                  0x00000002

//#define _C2FLTCON1_FLTEN6_POSITION               0x00000017
//#define _C2FLTCON1_FLTEN6_MASK                   0x00800000
//#define _C2FLTCON1_FLTEN6_LENGTH                 0x00000001

//#define _C2FLTCON1_FSEL7_POSITION                0x00000018
//#define _C2FLTCON1_FSEL7_MASK                    0x1F000000
//#define _C2FLTCON1_FSEL7_LENGTH                  0x00000005

//#define _C2FLTCON1_MSEL7_POSITION                0x0000001D
//#define _C2FLTCON1_MSEL7_MASK                    0x60000000
//#define _C2FLTCON1_MSEL7_LENGTH                  0x00000002

//#define _C2FLTCON1_FLTEN7_POSITION               0x0000001F
//#define _C2FLTCON1_FLTEN7_MASK                   0x80000000
//#define _C2FLTCON1_FLTEN7_LENGTH                 0x00000001

//#define _C2FLTCON1_w_POSITION                    0x00000000
//#define _C2FLTCON1_w_MASK                        0xFFFFFFFF
//#define _C2FLTCON1_w_LENGTH                      0x00000020

//#define _C2FLTCON2_FSEL8_POSITION                0x00000000
//#define _C2FLTCON2_FSEL8_MASK                    0x0000001F
//#define _C2FLTCON2_FSEL8_LENGTH                  0x00000005

//#define _C2FLTCON2_MSEL8_POSITION                0x00000005
//#define _C2FLTCON2_MSEL8_MASK                    0x00000060
//#define _C2FLTCON2_MSEL8_LENGTH                  0x00000002

//#define _C2FLTCON2_FLTEN8_POSITION               0x00000007
//#define _C2FLTCON2_FLTEN8_MASK                   0x00000080
//#define _C2FLTCON2_FLTEN8_LENGTH                 0x00000001

//#define _C2FLTCON2_FSEL9_POSITION                0x00000008
//#define _C2FLTCON2_FSEL9_MASK                    0x00001F00
//#define _C2FLTCON2_FSEL9_LENGTH                  0x00000005

//#define _C2FLTCON2_MSEL9_POSITION                0x0000000D
//#define _C2FLTCON2_MSEL9_MASK                    0x00006000
//#define _C2FLTCON2_MSEL9_LENGTH                  0x00000002

//#define _C2FLTCON2_FLTEN9_POSITION               0x0000000F
//#define _C2FLTCON2_FLTEN9_MASK                   0x00008000
//#define _C2FLTCON2_FLTEN9_LENGTH                 0x00000001

//#define _C2FLTCON2_FSEL10_POSITION               0x00000010
//#define _C2FLTCON2_FSEL10_MASK                   0x001F0000
//#define _C2FLTCON2_FSEL10_LENGTH                 0x00000005

//#define _C2FLTCON2_MSEL10_POSITION               0x00000015
//#define _C2FLTCON2_MSEL10_MASK                   0x00600000
//#define _C2FLTCON2_MSEL10_LENGTH                 0x00000002

//#define _C2FLTCON2_FLTEN10_POSITION              0x00000017
//#define _C2FLTCON2_FLTEN10_MASK                  0x00800000
//#define _C2FLTCON2_FLTEN10_LENGTH                0x00000001

//#define _C2FLTCON2_FSEL11_POSITION               0x00000018
//#define _C2FLTCON2_FSEL11_MASK                   0x1F000000
//#define _C2FLTCON2_FSEL11_LENGTH                 0x00000005

//#define _C2FLTCON2_MSEL11_POSITION               0x0000001D
//#define _C2FLTCON2_MSEL11_MASK                   0x60000000
//#define _C2FLTCON2_MSEL11_LENGTH                 0x00000002

//#define _C2FLTCON2_FLTEN11_POSITION              0x0000001F
//#define _C2FLTCON2_FLTEN11_MASK                  0x80000000
//#define _C2FLTCON2_FLTEN11_LENGTH                0x00000001

//#define _C2FLTCON2_w_POSITION                    0x00000000
//#define _C2FLTCON2_w_MASK                        0xFFFFFFFF
//#define _C2FLTCON2_w_LENGTH                      0x00000020

//#define _C2FLTCON3_FSEL12_POSITION               0x00000000
//#define _C2FLTCON3_FSEL12_MASK                   0x0000001F
//#define _C2FLTCON3_FSEL12_LENGTH                 0x00000005

//#define _C2FLTCON3_MSEL12_POSITION               0x00000005
//#define _C2FLTCON3_MSEL12_MASK                   0x00000060
//#define _C2FLTCON3_MSEL12_LENGTH                 0x00000002

//#define _C2FLTCON3_FLTEN12_POSITION              0x00000007
//#define _C2FLTCON3_FLTEN12_MASK                  0x00000080
//#define _C2FLTCON3_FLTEN12_LENGTH                0x00000001

