HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C2RXF4_EID_POSITION                     0x00000000
//#define _C2RXF4_EID_MASK                         0x0003FFFF
//#define _C2RXF4_EID_LENGTH                       0x00000012

//#define _C2RXF4_EXID_POSITION                    0x00000013
//#define _C2RXF4_EXID_MASK                        0x00080000
//#define _C2RXF4_EXID_LENGTH                      0x00000001

//#define _C2RXF4_SID_POSITION                     0x00000015
//#define _C2RXF4_SID_MASK                         0xFFE00000
//#define _C2RXF4_SID_LENGTH                       0x0000000B

//#define _C2RXF4_w_POSITION                       0x00000000
//#define _C2RXF4_w_MASK                           0xFFFFFFFF
//#define _C2RXF4_w_LENGTH                         0x00000020

//#define _C2RXF5_EID_POSITION                     0x00000000
//#define _C2RXF5_EID_MASK                         0x0003FFFF
//#define _C2RXF5_EID_LENGTH                       0x00000012

//#define _C2RXF5_EXID_POSITION                    0x00000013
//#define _C2RXF5_EXID_MASK                        0x00080000
//#define _C2RXF5_EXID_LENGTH                      0x00000001

//#define _C2RXF5_SID_POSITION                     0x00000015
//#define _C2RXF5_SID_MASK                         0xFFE00000
//#define _C2RXF5_SID_LENGTH                       0x0000000B

//#define _C2RXF5_w_POSITION                       0x00000000
//#define _C2RXF5_w_MASK                           0xFFFFFFFF
//#define _C2RXF5_w_LENGTH                         0x00000020

//#define _C2RXF6_EID_POSITION                     0x00000000
//#define _C2RXF6_EID_MASK                         0x0003FFFF
//#define _C2RXF6_EID_LENGTH                       0x00000012

//#define _C2RXF6_EXID_POSITION                    0x00000013
//#define _C2RXF6_EXID_MASK                        0x00080000
//#define _C2RXF6_EXID_LENGTH                      0x00000001

//#define _C2RXF6_SID_POSITION                     0x00000015
//#define _C2RXF6_SID_MASK                         0xFFE00000
//#define _C2RXF6_SID_LENGTH                       0x0000000B

//#define _C2RXF6_w_POSITION                       0x00000000
//#define _C2RXF6_w_MASK                           0xFFFFFFFF
//#define _C2RXF6_w_LENGTH                         0x00000020

//#define _C2RXF7_EID_POSITION                     0x00000000
//#define _C2RXF7_EID_MASK                         0x0003FFFF
//#define _C2RXF7_EID_LENGTH                       0x00000012

//#define _C2RXF7_EXID_POSITION                    0x00000013
//#define _C2RXF7_EXID_MASK                        0x00080000
//#define _C2RXF7_EXID_LENGTH                      0x00000001

//#define _C2RXF7_SID_POSITION                     0x00000015
//#define _C2RXF7_SID_MASK                         0xFFE00000
//#define _C2RXF7_SID_LENGTH                       0x0000000B

//#define _C2RXF7_w_POSITION                       0x00000000
//#define _C2RXF7_w_MASK                           0xFFFFFFFF
//#define _C2RXF7_w_LENGTH                         0x00000020

//#define _C2RXF8_EID_POSITION                     0x00000000
//#define _C2RXF8_EID_MASK                         0x0003FFFF
//#define _C2RXF8_EID_LENGTH                       0x00000012

//#define _C2RXF8_EXID_POSITION                    0x00000013
//#define _C2RXF8_EXID_MASK                        0x00080000
//#define _C2RXF8_EXID_LENGTH                      0x00000001

//#define _C2RXF8_SID_POSITION                     0x00000015
//#define _C2RXF8_SID_MASK                         0xFFE00000
//#define _C2RXF8_SID_LENGTH                       0x0000000B

//#define _C2RXF8_w_POSITION                       0x00000000
//#define _C2RXF8_w_MASK                           0xFFFFFFFF
//#define _C2RXF8_w_LENGTH                         0x00000020

//#define _C2RXF9_EID_POSITION                     0x00000000
//#define _C2RXF9_EID_MASK                         0x0003FFFF
//#define _C2RXF9_EID_LENGTH                       0x00000012

//#define _C2RXF9_EXID_POSITION                    0x00000013
//#define _C2RXF9_EXID_MASK                        0x00080000
//#define _C2RXF9_EXID_LENGTH                      0x00000001

//#define _C2RXF9_SID_POSITION                     0x00000015
//#define _C2RXF9_SID_MASK                         0xFFE00000
//#define _C2RXF9_SID_LENGTH                       0x0000000B

//#define _C2RXF9_w_POSITION                       0x00000000
//#define _C2RXF9_w_MASK                           0xFFFFFFFF
//#define _C2RXF9_w_LENGTH                         0x00000020

//#define _C2RXF10_EID_POSITION                    0x00000000
//#define _C2RXF10_EID_MASK                        0x0003FFFF
//#define _C2RXF10_EID_LENGTH                      0x00000012

//#define _C2RXF10_EXID_POSITION                   0x00000013
//#define _C2RXF10_EXID_MASK                       0x00080000
//#define _C2RXF10_EXID_LENGTH                     0x00000001

//#define _C2RXF10_SID_POSITION                    0x00000015
//#define _C2RXF10_SID_MASK                        0xFFE00000
//#define _C2RXF10_SID_LENGTH                      0x0000000B

//#define _C2RXF10_w_POSITION                      0x00000000
//#define _C2RXF10_w_MASK                          0xFFFFFFFF
//#define _C2RXF10_w_LENGTH                        0x00000020

//#define _C2RXF11_EID_POSITION                    0x00000000
//#define _C2RXF11_EID_MASK                        0x0003FFFF
//#define _C2RXF11_EID_LENGTH                      0x00000012

//#define _C2RXF11_EXID_POSITION                   0x00000013
//#define _C2RXF11_EXID_MASK                       0x00080000
//#define _C2RXF11_EXID_LENGTH                     0x00000001

//#define _C2RXF11_SID_POSITION                    0x00000015
//#define _C2RXF11_SID_MASK                        0xFFE00000
//#define _C2RXF11_SID_LENGTH                      0x0000000B

//#define _C2RXF11_w_POSITION                      0x00000000
//#define _C2RXF11_w_MASK                          0xFFFFFFFF
//#define _C2RXF11_w_LENGTH                        0x00000020

//#define _C2RXF12_EID_POSITION                    0x00000000
//#define _C2RXF12_EID_MASK                        0x0003FFFF
//#define _C2RXF12_EID_LENGTH                      0x00000012

//#define _C2RXF12_EXID_POSITION                   0x00000013
//#define _C2RXF12_EXID_MASK                       0x00080000
//#define _C2RXF12_EXID_LENGTH                     0x00000001

