HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _C2FIFOINT2_RXNEMPTYIF_POSITION          0x00000000
//#define _C2FIFOINT2_RXNEMPTYIF_MASK              0x00000001
//#define _C2FIFOINT2_RXNEMPTYIF_LENGTH            0x00000001

//#define _C2FIFOINT2_RXHALFIF_POSITION            0x00000001
//#define _C2FIFOINT2_RXHALFIF_MASK                0x00000002
//#define _C2FIFOINT2_RXHALFIF_LENGTH              0x00000001

//#define _C2FIFOINT2_RXFULLIF_POSITION            0x00000002
//#define _C2FIFOINT2_RXFULLIF_MASK                0x00000004
//#define _C2FIFOINT2_RXFULLIF_LENGTH              0x00000001

//#define _C2FIFOINT2_RXOVFLIF_POSITION            0x00000003
//#define _C2FIFOINT2_RXOVFLIF_MASK                0x00000008
//#define _C2FIFOINT2_RXOVFLIF_LENGTH              0x00000001

//#define _C2FIFOINT2_TXEMPTYIF_POSITION           0x00000008
//#define _C2FIFOINT2_TXEMPTYIF_MASK               0x00000100
//#define _C2FIFOINT2_TXEMPTYIF_LENGTH             0x00000001

//#define _C2FIFOINT2_TXHALFIF_POSITION            0x00000009
//#define _C2FIFOINT2_TXHALFIF_MASK                0x00000200
//#define _C2FIFOINT2_TXHALFIF_LENGTH              0x00000001

//#define _C2FIFOINT2_TXNFULLIF_POSITION           0x0000000A
//#define _C2FIFOINT2_TXNFULLIF_MASK               0x00000400
//#define _C2FIFOINT2_TXNFULLIF_LENGTH             0x00000001

//#define _C2FIFOINT2_RXNEMPTYIE_POSITION          0x00000010
//#define _C2FIFOINT2_RXNEMPTYIE_MASK              0x00010000
//#define _C2FIFOINT2_RXNEMPTYIE_LENGTH            0x00000001

//#define _C2FIFOINT2_RXHALFIE_POSITION            0x00000011
//#define _C2FIFOINT2_RXHALFIE_MASK                0x00020000
//#define _C2FIFOINT2_RXHALFIE_LENGTH              0x00000001

//#define _C2FIFOINT2_RXFULLIE_POSITION            0x00000012
//#define _C2FIFOINT2_RXFULLIE_MASK                0x00040000
//#define _C2FIFOINT2_RXFULLIE_LENGTH              0x00000001

//#define _C2FIFOINT2_RXOVFLIE_POSITION            0x00000013
//#define _C2FIFOINT2_RXOVFLIE_MASK                0x00080000
//#define _C2FIFOINT2_RXOVFLIE_LENGTH              0x00000001

//#define _C2FIFOINT2_TXEMPTYIE_POSITION           0x00000018
//#define _C2FIFOINT2_TXEMPTYIE_MASK               0x01000000
//#define _C2FIFOINT2_TXEMPTYIE_LENGTH             0x00000001

//#define _C2FIFOINT2_TXHALFIE_POSITION            0x00000019
//#define _C2FIFOINT2_TXHALFIE_MASK                0x02000000
//#define _C2FIFOINT2_TXHALFIE_LENGTH              0x00000001

//#define _C2FIFOINT2_TXNFULLIE_POSITION           0x0000001A
//#define _C2FIFOINT2_TXNFULLIE_MASK               0x04000000
//#define _C2FIFOINT2_TXNFULLIE_LENGTH             0x00000001

//#define _C2FIFOINT2_w_POSITION                   0x00000000
//#define _C2FIFOINT2_w_MASK                       0xFFFFFFFF
//#define _C2FIFOINT2_w_LENGTH                     0x00000020

//#define _C2FIFOCI2_CFIFOCI_POSITION              0x00000000
//#define _C2FIFOCI2_CFIFOCI_MASK                  0x0000001F
//#define _C2FIFOCI2_CFIFOCI_LENGTH                0x00000005

//#define _C2FIFOCI2_w_POSITION                    0x00000000
//#define _C2FIFOCI2_w_MASK                        0xFFFFFFFF
//#define _C2FIFOCI2_w_LENGTH                      0x00000020

//#define _C2FIFOCON3_TXPRI_POSITION               0x00000000
//#define _C2FIFOCON3_TXPRI_MASK                   0x00000003
//#define _C2FIFOCON3_TXPRI_LENGTH                 0x00000002

//#define _C2FIFOCON3_RTREN_POSITION               0x00000002
//#define _C2FIFOCON3_RTREN_MASK                   0x00000004
//#define _C2FIFOCON3_RTREN_LENGTH                 0x00000001

//#define _C2FIFOCON3_TXREQ_POSITION               0x00000003
//#define _C2FIFOCON3_TXREQ_MASK                   0x00000008
//#define _C2FIFOCON3_TXREQ_LENGTH                 0x00000001

//#define _C2FIFOCON3_TXERR_POSITION               0x00000004
//#define _C2FIFOCON3_TXERR_MASK                   0x00000010
//#define _C2FIFOCON3_TXERR_LENGTH                 0x00000001

//#define _C2FIFOCON3_TXLARB_POSITION              0x00000005
//#define _C2FIFOCON3_TXLARB_MASK                  0x00000020
//#define _C2FIFOCON3_TXLARB_LENGTH                0x00000001

//#define _C2FIFOCON3_TXABAT_POSITION              0x00000006
//#define _C2FIFOCON3_TXABAT_MASK                  0x00000040
//#define _C2FIFOCON3_TXABAT_LENGTH                0x00000001

//#define _C2FIFOCON3_TXEN_POSITION                0x00000007
//#define _C2FIFOCON3_TXEN_MASK                    0x00000080
//#define _C2FIFOCON3_TXEN_LENGTH                  0x00000001

//#define _C2FIFOCON3_DONLY_POSITION               0x0000000C
//#define _C2FIFOCON3_DONLY_MASK                   0x00001000
//#define _C2FIFOCON3_DONLY_LENGTH                 0x00000001

//#define _C2FIFOCON3_UINC_POSITION                0x0000000D
//#define _C2FIFOCON3_UINC_MASK                    0x00002000
//#define _C2FIFOCON3_UINC_LENGTH                  0x00000001

//#define _C2FIFOCON3_FRESET_POSITION              0x0000000E
//#define _C2FIFOCON3_FRESET_MASK                  0x00004000
//#define _C2FIFOCON3_FRESET_LENGTH                0x00000001

//#define _C2FIFOCON3_FSIZE_POSITION               0x00000010
//#define _C2FIFOCON3_FSIZE_MASK                   0x001F0000
//#define _C2FIFOCON3_FSIZE_LENGTH                 0x00000005

//#define _C2FIFOCON3_w_POSITION                   0x00000000
//#define _C2FIFOCON3_w_MASK                       0xFFFFFFFF
//#define _C2FIFOCON3_w_LENGTH                     0x00000020

//#define _C2FIFOINT3_RXNEMPTYIF_POSITION          0x00000000
//#define _C2FIFOINT3_RXNEMPTYIF_MASK              0x00000001
//#define _C2FIFOINT3_RXNEMPTYIF_LENGTH            0x00000001

//#define _C2FIFOINT3_RXHALFIF_POSITION            0x00000001
//#define _C2FIFOINT3_RXHALFIF_MASK                0x00000002
//#define _C2FIFOINT3_RXHALFIF_LENGTH              0x00000001

//#define _C2FIFOINT3_RXFULLIF_POSITION            0x00000002
//#define _C2FIFOINT3_RXFULLIF_MASK                0x00000004
//#define _C2FIFOINT3_RXFULLIF_LENGTH              0x00000001

//#define _C2FIFOINT3_RXOVFLIF_POSITION            0x00000003
//#define _C2FIFOINT3_RXOVFLIF_MASK                0x00000008
//#define _C2FIFOINT3_RXOVFLIF_LENGTH              0x00000001

//#define _C2FIFOINT3_TXEMPTYIF_POSITION           0x00000008
//#define _C2FIFOINT3_TXEMPTYIF_MASK               0x00000100
//#define _C2FIFOINT3_TXEMPTYIF_LENGTH             0x00000001

//#define _C2FIFOINT3_TXHALFIF_POSITION            0x00000009
//#define _C2FIFOINT3_TXHALFIF_MASK                0x00000200
//#define _C2FIFOINT3_TXHALFIF_LENGTH              0x00000001

//#define _C2FIFOINT3_TXNFULLIF_POSITION           0x0000000A
//#define _C2FIFOINT3_TXNFULLIF_MASK               0x00000400
//#define _C2FIFOINT3_TXNFULLIF_LENGTH             0x00000001

