HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ETHRXST_w_POSITION                      0x00000000
//#define _ETHRXST_w_MASK                          0xFFFFFFFF
//#define _ETHRXST_w_LENGTH                        0x00000020

//#define _ETHHT0_w_POSITION                       0x00000000
//#define _ETHHT0_w_MASK                           0xFFFFFFFF
//#define _ETHHT0_w_LENGTH                         0x00000020

//#define _ETHHT0_HTLOWER_POSITION                 0x00000000
//#define _ETHHT0_HTLOWER_MASK                     0xFFFFFFFF
//#define _ETHHT0_HTLOWER_LENGTH                   0x00000020

//#define _ETHHT1_w_POSITION                       0x00000000
//#define _ETHHT1_w_MASK                           0xFFFFFFFF
//#define _ETHHT1_w_LENGTH                         0x00000020

//#define _ETHHT1_HTUPPER_POSITION                 0x00000000
//#define _ETHHT1_HTUPPER_MASK                     0xFFFFFFFF
//#define _ETHHT1_HTUPPER_LENGTH                   0x00000020

//#define _ETHPMM0_w_POSITION                      0x00000000
//#define _ETHPMM0_w_MASK                          0xFFFFFFFF
//#define _ETHPMM0_w_LENGTH                        0x00000020

//#define _ETHPMM0_PMMLOWER_POSITION               0x00000000
//#define _ETHPMM0_PMMLOWER_MASK                   0xFFFFFFFF
//#define _ETHPMM0_PMMLOWER_LENGTH                 0x00000020

//#define _ETHPMM1_w_POSITION                      0x00000000
//#define _ETHPMM1_w_MASK                          0xFFFFFFFF
//#define _ETHPMM1_w_LENGTH                        0x00000020

//#define _ETHPMM1_PMMUPPER_POSITION               0x00000000
//#define _ETHPMM1_PMMUPPER_MASK                   0xFFFFFFFF
//#define _ETHPMM1_PMMUPPER_LENGTH                 0x00000020

//#define _ETHPMCS_PMCS_POSITION                   0x00000000
//#define _ETHPMCS_PMCS_MASK                       0x0000FFFF
//#define _ETHPMCS_PMCS_LENGTH                     0x00000010

//#define _ETHPMCS_w_POSITION                      0x00000000
//#define _ETHPMCS_w_MASK                          0xFFFFFFFF
//#define _ETHPMCS_w_LENGTH                        0x00000020

//#define _ETHPMO_PMO_POSITION                     0x00000000
//#define _ETHPMO_PMO_MASK                         0x0000FFFF
//#define _ETHPMO_PMO_LENGTH                       0x00000010

//#define _ETHPMO_w_POSITION                       0x00000000
//#define _ETHPMO_w_MASK                           0xFFFFFFFF
//#define _ETHPMO_w_LENGTH                         0x00000020

//#define _ETHRXFC_BCEN_POSITION                   0x00000000
//#define _ETHRXFC_BCEN_MASK                       0x00000001
//#define _ETHRXFC_BCEN_LENGTH                     0x00000001

//#define _ETHRXFC_MCEN_POSITION                   0x00000001
//#define _ETHRXFC_MCEN_MASK                       0x00000002
//#define _ETHRXFC_MCEN_LENGTH                     0x00000001

//#define _ETHRXFC_NOTMEEN_POSITION                0x00000002
//#define _ETHRXFC_NOTMEEN_MASK                    0x00000004
//#define _ETHRXFC_NOTMEEN_LENGTH                  0x00000001

//#define _ETHRXFC_UCEN_POSITION                   0x00000003
//#define _ETHRXFC_UCEN_MASK                       0x00000008
//#define _ETHRXFC_UCEN_LENGTH                     0x00000001

//#define _ETHRXFC_RUNTEN_POSITION                 0x00000004
//#define _ETHRXFC_RUNTEN_MASK                     0x00000010
//#define _ETHRXFC_RUNTEN_LENGTH                   0x00000001

//#define _ETHRXFC_RUNTERREN_POSITION              0x00000005
//#define _ETHRXFC_RUNTERREN_MASK                  0x00000020
//#define _ETHRXFC_RUNTERREN_LENGTH                0x00000001

//#define _ETHRXFC_CRCOKEN_POSITION                0x00000006
//#define _ETHRXFC_CRCOKEN_MASK                    0x00000040
//#define _ETHRXFC_CRCOKEN_LENGTH                  0x00000001

//#define _ETHRXFC_CRCERREN_POSITION               0x00000007
//#define _ETHRXFC_CRCERREN_MASK                   0x00000080
//#define _ETHRXFC_CRCERREN_LENGTH                 0x00000001

//#define _ETHRXFC_PMMODE_POSITION                 0x00000008
//#define _ETHRXFC_PMMODE_MASK                     0x00000F00
//#define _ETHRXFC_PMMODE_LENGTH                   0x00000004

//#define _ETHRXFC_NOTPM_POSITION                  0x0000000C
//#define _ETHRXFC_NOTPM_MASK                      0x00001000
//#define _ETHRXFC_NOTPM_LENGTH                    0x00000001

//#define _ETHRXFC_MPEN_POSITION                   0x0000000E
//#define _ETHRXFC_MPEN_MASK                       0x00004000
//#define _ETHRXFC_MPEN_LENGTH                     0x00000001

//#define _ETHRXFC_HTEN_POSITION                   0x0000000F
//#define _ETHRXFC_HTEN_MASK                       0x00008000
//#define _ETHRXFC_HTEN_LENGTH                     0x00000001

//#define _ETHRXFC_w_POSITION                      0x00000000
//#define _ETHRXFC_w_MASK                          0xFFFFFFFF
//#define _ETHRXFC_w_LENGTH                        0x00000020

//#define _ETHRXWM_RXEWM_POSITION                  0x00000000
//#define _ETHRXWM_RXEWM_MASK                      0x000000FF
//#define _ETHRXWM_RXEWM_LENGTH                    0x00000008

//#define _ETHRXWM_RXFWM_POSITION                  0x00000010
//#define _ETHRXWM_RXFWM_MASK                      0x00FF0000
//#define _ETHRXWM_RXFWM_LENGTH                    0x00000008

//#define _ETHRXWM_w_POSITION                      0x00000000
//#define _ETHRXWM_w_MASK                          0xFFFFFFFF
//#define _ETHRXWM_w_LENGTH                        0x00000020

//#define _ETHIEN_RXOVFLWIE_POSITION               0x00000000
//#define _ETHIEN_RXOVFLWIE_MASK                   0x00000001
//#define _ETHIEN_RXOVFLWIE_LENGTH                 0x00000001

//#define _ETHIEN_RXBUFNAIE_POSITION               0x00000001
//#define _ETHIEN_RXBUFNAIE_MASK                   0x00000002
//#define _ETHIEN_RXBUFNAIE_LENGTH                 0x00000001

//#define _ETHIEN_TXABORTIE_POSITION               0x00000002
//#define _ETHIEN_TXABORTIE_MASK                   0x00000004
//#define _ETHIEN_TXABORTIE_LENGTH                 0x00000001

//#define _ETHIEN_TXDONEIE_POSITION                0x00000003
//#define _ETHIEN_TXDONEIE_MASK                    0x00000008
//#define _ETHIEN_TXDONEIE_LENGTH                  0x00000001

//#define _ETHIEN_RXACTIE_POSITION                 0x00000005
//#define _ETHIEN_RXACTIE_MASK                     0x00000020
//#define _ETHIEN_RXACTIE_LENGTH                   0x00000001

//#define _ETHIEN_PKTPENDIE_POSITION               0x00000006
//#define _ETHIEN_PKTPENDIE_MASK                   0x00000040
//#define _ETHIEN_PKTPENDIE_LENGTH                 0x00000001

//#define _ETHIEN_RXDONEIE_POSITION                0x00000007
//#define _ETHIEN_RXDONEIE_MASK                    0x00000080
//#define _ETHIEN_RXDONEIE_LENGTH                  0x00000001

//#define _ETHIEN_FWMARKIE_POSITION                0x00000008
//#define _ETHIEN_FWMARKIE_MASK                    0x00000100
//#define _ETHIEN_FWMARKIE_LENGTH                  0x00000001

//#define _ETHIEN_EWMARKIE_POSITION                0x00000009
//#define _ETHIEN_EWMARKIE_MASK                    0x00000200
//#define _ETHIEN_EWMARKIE_LENGTH                  0x00000001

//#define _ETHIEN_RXBUSEIE_POSITION                0x0000000D
//#define _ETHIEN_RXBUSEIE_MASK                    0x00002000
//#define _ETHIEN_RXBUSEIE_LENGTH                  0x00000001

//#define _ETHIEN_TXBUSEIE_POSITION                0x0000000E
//#define _ETHIEN_TXBUSEIE_MASK                    0x00004000
//#define _ETHIEN_TXBUSEIE_LENGTH                  0x00000001

//#define _ETHIEN_w_POSITION                       0x00000000
//#define _ETHIEN_w_MASK                           0xFFFFFFFF
//#define _ETHIEN_w_LENGTH                         0x00000020

//#define _ETHIRQ_RXOVFLW_POSITION                 0x00000000
//#define _ETHIRQ_RXOVFLW_MASK                     0x00000001
//#define _ETHIRQ_RXOVFLW_LENGTH                   0x00000001

//#define _ETHIRQ_RXBUFNA_POSITION                 0x00000001
//#define _ETHIRQ_RXBUFNA_MASK                     0x00000002
//#define _ETHIRQ_RXBUFNA_LENGTH                   0x00000001

//#define _ETHIRQ_TXABORT_POSITION                 0x00000002
//#define _ETHIRQ_TXABORT_MASK                     0x00000004
//#define _ETHIRQ_TXABORT_LENGTH                   0x00000001

//#define _ETHIRQ_TXDONE_POSITION                  0x00000003
//#define _ETHIRQ_TXDONE_MASK                      0x00000008
//#define _ETHIRQ_TXDONE_LENGTH                    0x00000001

//#define _ETHIRQ_RXACT_POSITION                   0x00000005
//#define _ETHIRQ_RXACT_MASK                       0x00000020
//#define _ETHIRQ_RXACT_LENGTH                     0x00000001

//#define _ETHIRQ_PKTPEND_POSITION                 0x00000006
//#define _ETHIRQ_PKTPEND_MASK                     0x00000040
//#define _ETHIRQ_PKTPEND_LENGTH                   0x00000001

//#define _ETHIRQ_RXDONE_POSITION                  0x00000007
//#define _ETHIRQ_RXDONE_MASK                      0x00000080
//#define _ETHIRQ_RXDONE_LENGTH                    0x00000001

