HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ETHIRQ_FWMARK_POSITION                  0x00000008
//#define _ETHIRQ_FWMARK_MASK                      0x00000100
//#define _ETHIRQ_FWMARK_LENGTH                    0x00000001

//#define _ETHIRQ_EWMARK_POSITION                  0x00000009
//#define _ETHIRQ_EWMARK_MASK                      0x00000200
//#define _ETHIRQ_EWMARK_LENGTH                    0x00000001

//#define _ETHIRQ_RXBUSE_POSITION                  0x0000000D
//#define _ETHIRQ_RXBUSE_MASK                      0x00002000
//#define _ETHIRQ_RXBUSE_LENGTH                    0x00000001

//#define _ETHIRQ_TXBUSE_POSITION                  0x0000000E
//#define _ETHIRQ_TXBUSE_MASK                      0x00004000
//#define _ETHIRQ_TXBUSE_LENGTH                    0x00000001

//#define _ETHIRQ_w_POSITION                       0x00000000
//#define _ETHIRQ_w_MASK                           0xFFFFFFFF
//#define _ETHIRQ_w_LENGTH                         0x00000020

//#define _ETHSTAT_RXBUSY_POSITION                 0x00000005
//#define _ETHSTAT_RXBUSY_MASK                     0x00000020
//#define _ETHSTAT_RXBUSY_LENGTH                   0x00000001

//#define _ETHSTAT_TXBUSY_POSITION                 0x00000006
//#define _ETHSTAT_TXBUSY_MASK                     0x00000040
//#define _ETHSTAT_TXBUSY_LENGTH                   0x00000001

//#define _ETHSTAT_BUSY_POSITION                   0x00000007
//#define _ETHSTAT_BUSY_MASK                       0x00000080
//#define _ETHSTAT_BUSY_LENGTH                     0x00000001

//#define _ETHSTAT_BUFCNT_POSITION                 0x00000010
//#define _ETHSTAT_BUFCNT_MASK                     0x00FF0000
//#define _ETHSTAT_BUFCNT_LENGTH                   0x00000008

//#define _ETHSTAT_ETHBUSY_POSITION                0x00000007
//#define _ETHSTAT_ETHBUSY_MASK                    0x00000080
//#define _ETHSTAT_ETHBUSY_LENGTH                  0x00000001

//#define _ETHSTAT_w_POSITION                      0x00000000
//#define _ETHSTAT_w_MASK                          0xFFFFFFFF
//#define _ETHSTAT_w_LENGTH                        0x00000020

//#define _ETHRXOVFLOW_RXOVFLWCNT_POSITION         0x00000000
//#define _ETHRXOVFLOW_RXOVFLWCNT_MASK             0x0000FFFF
//#define _ETHRXOVFLOW_RXOVFLWCNT_LENGTH           0x00000010

//#define _ETHRXOVFLOW_w_POSITION                  0x00000000
//#define _ETHRXOVFLOW_w_MASK                      0xFFFFFFFF
//#define _ETHRXOVFLOW_w_LENGTH                    0x00000020

//#define _ETHFRMTXOK_FRMTXOKCNT_POSITION          0x00000000
//#define _ETHFRMTXOK_FRMTXOKCNT_MASK              0x0000FFFF
//#define _ETHFRMTXOK_FRMTXOKCNT_LENGTH            0x00000010

//#define _ETHFRMTXOK_w_POSITION                   0x00000000
//#define _ETHFRMTXOK_w_MASK                       0xFFFFFFFF
//#define _ETHFRMTXOK_w_LENGTH                     0x00000020

//#define _ETHSCOLFRM_SCOLFRMCNT_POSITION          0x00000000
//#define _ETHSCOLFRM_SCOLFRMCNT_MASK              0x0000FFFF
//#define _ETHSCOLFRM_SCOLFRMCNT_LENGTH            0x00000010

//#define _ETHSCOLFRM_w_POSITION                   0x00000000
//#define _ETHSCOLFRM_w_MASK                       0xFFFFFFFF
//#define _ETHSCOLFRM_w_LENGTH                     0x00000020

//#define _ETHMCOLFRM_MCOLFRMCNT_POSITION          0x00000000
//#define _ETHMCOLFRM_MCOLFRMCNT_MASK              0x0000FFFF
//#define _ETHMCOLFRM_MCOLFRMCNT_LENGTH            0x00000010

//#define _ETHMCOLFRM_MCOLFRM_CNT_POSITION         0x00000000
//#define _ETHMCOLFRM_MCOLFRM_CNT_MASK             0x0000FFFF
//#define _ETHMCOLFRM_MCOLFRM_CNT_LENGTH           0x00000010

//#define _ETHMCOLFRM_w_POSITION                   0x00000000
//#define _ETHMCOLFRM_w_MASK                       0xFFFFFFFF
//#define _ETHMCOLFRM_w_LENGTH                     0x00000020

//#define _ETHFRMRXOK_FRMRXOKCNT_POSITION          0x00000000
//#define _ETHFRMRXOK_FRMRXOKCNT_MASK              0x0000FFFF
//#define _ETHFRMRXOK_FRMRXOKCNT_LENGTH            0x00000010

//#define _ETHFRMRXOK_w_POSITION                   0x00000000
//#define _ETHFRMRXOK_w_MASK                       0xFFFFFFFF
//#define _ETHFRMRXOK_w_LENGTH                     0x00000020

//#define _ETHFCSERR_FCSERRCNT_POSITION            0x00000000
//#define _ETHFCSERR_FCSERRCNT_MASK                0x0000FFFF
//#define _ETHFCSERR_FCSERRCNT_LENGTH              0x00000010

//#define _ETHFCSERR_w_POSITION                    0x00000000
//#define _ETHFCSERR_w_MASK                        0xFFFFFFFF
//#define _ETHFCSERR_w_LENGTH                      0x00000020

//#define _ETHALGNERR_ALGNERRCNT_POSITION          0x00000000
//#define _ETHALGNERR_ALGNERRCNT_MASK              0x0000FFFF
//#define _ETHALGNERR_ALGNERRCNT_LENGTH            0x00000010

//#define _ETHALGNERR_w_POSITION                   0x00000000
//#define _ETHALGNERR_w_MASK                       0xFFFFFFFF
//#define _ETHALGNERR_w_LENGTH                     0x00000020

//#define _EMAC1CFG1_RXENABLE_POSITION             0x00000000
//#define _EMAC1CFG1_RXENABLE_MASK                 0x00000001
//#define _EMAC1CFG1_RXENABLE_LENGTH               0x00000001

//#define _EMAC1CFG1_PASSALL_POSITION              0x00000001
//#define _EMAC1CFG1_PASSALL_MASK                  0x00000002
//#define _EMAC1CFG1_PASSALL_LENGTH                0x00000001

//#define _EMAC1CFG1_RXPAUSE_POSITION              0x00000002
//#define _EMAC1CFG1_RXPAUSE_MASK                  0x00000004
//#define _EMAC1CFG1_RXPAUSE_LENGTH                0x00000001

//#define _EMAC1CFG1_TXPAUSE_POSITION              0x00000003
//#define _EMAC1CFG1_TXPAUSE_MASK                  0x00000008
//#define _EMAC1CFG1_TXPAUSE_LENGTH                0x00000001

//#define _EMAC1CFG1_LOOPBACK_POSITION             0x00000004
//#define _EMAC1CFG1_LOOPBACK_MASK                 0x00000010
//#define _EMAC1CFG1_LOOPBACK_LENGTH               0x00000001

//#define _EMAC1CFG1_RESETTFUN_POSITION            0x00000008
//#define _EMAC1CFG1_RESETTFUN_MASK                0x00000100
//#define _EMAC1CFG1_RESETTFUN_LENGTH              0x00000001

//#define _EMAC1CFG1_RESETTMCS_POSITION            0x00000009
//#define _EMAC1CFG1_RESETTMCS_MASK                0x00000200
//#define _EMAC1CFG1_RESETTMCS_LENGTH              0x00000001

//#define _EMAC1CFG1_RESETRFUN_POSITION            0x0000000A
//#define _EMAC1CFG1_RESETRFUN_MASK                0x00000400
//#define _EMAC1CFG1_RESETRFUN_LENGTH              0x00000001

//#define _EMAC1CFG1_RESETRMCS_POSITION            0x0000000B
//#define _EMAC1CFG1_RESETRMCS_MASK                0x00000800
//#define _EMAC1CFG1_RESETRMCS_LENGTH              0x00000001

