HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _EMACxSUPP_w_POSITION                    0x00000000
//#define _EMACxSUPP_w_MASK                        0xFFFFFFFF
//#define _EMACxSUPP_w_LENGTH                      0x00000020

//#define _EMAC1TEST_SHRTQNTA_POSITION             0x00000000
//#define _EMAC1TEST_SHRTQNTA_MASK                 0x00000001
//#define _EMAC1TEST_SHRTQNTA_LENGTH               0x00000001

//#define _EMAC1TEST_TESTPAUSE_POSITION            0x00000001
//#define _EMAC1TEST_TESTPAUSE_MASK                0x00000002
//#define _EMAC1TEST_TESTPAUSE_LENGTH              0x00000001

//#define _EMAC1TEST_TESTBP_POSITION               0x00000002
//#define _EMAC1TEST_TESTBP_MASK                   0x00000004
//#define _EMAC1TEST_TESTBP_LENGTH                 0x00000001

//#define _EMAC1TEST_w_POSITION                    0x00000000
//#define _EMAC1TEST_w_MASK                        0xFFFFFFFF
//#define _EMAC1TEST_w_LENGTH                      0x00000020

//#define _EMACxTEST_SHRTQNTA_POSITION             0x00000000
//#define _EMACxTEST_SHRTQNTA_MASK                 0x00000001
//#define _EMACxTEST_SHRTQNTA_LENGTH               0x00000001

//#define _EMACxTEST_TESTPAUSE_POSITION            0x00000001
//#define _EMACxTEST_TESTPAUSE_MASK                0x00000002
//#define _EMACxTEST_TESTPAUSE_LENGTH              0x00000001

//#define _EMACxTEST_TESTBP_POSITION               0x00000002
//#define _EMACxTEST_TESTBP_MASK                   0x00000004
//#define _EMACxTEST_TESTBP_LENGTH                 0x00000001

//#define _EMACxTEST_w_POSITION                    0x00000000
//#define _EMACxTEST_w_MASK                        0xFFFFFFFF
//#define _EMACxTEST_w_LENGTH                      0x00000020

//#define _EMAC1MCFG_SCANINC_POSITION              0x00000000
//#define _EMAC1MCFG_SCANINC_MASK                  0x00000001
//#define _EMAC1MCFG_SCANINC_LENGTH                0x00000001

//#define _EMAC1MCFG_NOPRE_POSITION                0x00000001
//#define _EMAC1MCFG_NOPRE_MASK                    0x00000002
//#define _EMAC1MCFG_NOPRE_LENGTH                  0x00000001

//#define _EMAC1MCFG_CLKSEL_POSITION               0x00000002
//#define _EMAC1MCFG_CLKSEL_MASK                   0x0000003C
//#define _EMAC1MCFG_CLKSEL_LENGTH                 0x00000004

//#define _EMAC1MCFG_RESETMGMT_POSITION            0x0000000F
//#define _EMAC1MCFG_RESETMGMT_MASK                0x00008000
//#define _EMAC1MCFG_RESETMGMT_LENGTH              0x00000001

//#define _EMAC1MCFG_w_POSITION                    0x00000000
//#define _EMAC1MCFG_w_MASK                        0xFFFFFFFF
//#define _EMAC1MCFG_w_LENGTH                      0x00000020

//#define _EMACxMCFG_SCANINC_POSITION              0x00000000
//#define _EMACxMCFG_SCANINC_MASK                  0x00000001
//#define _EMACxMCFG_SCANINC_LENGTH                0x00000001

//#define _EMACxMCFG_NOPRE_POSITION                0x00000001
//#define _EMACxMCFG_NOPRE_MASK                    0x00000002
//#define _EMACxMCFG_NOPRE_LENGTH                  0x00000001

//#define _EMACxMCFG_CLKSEL_POSITION               0x00000002
//#define _EMACxMCFG_CLKSEL_MASK                   0x0000003C
//#define _EMACxMCFG_CLKSEL_LENGTH                 0x00000004

//#define _EMACxMCFG_RESETMGMT_POSITION            0x0000000F
//#define _EMACxMCFG_RESETMGMT_MASK                0x00008000
//#define _EMACxMCFG_RESETMGMT_LENGTH              0x00000001

//#define _EMACxMCFG_w_POSITION                    0x00000000
//#define _EMACxMCFG_w_MASK                        0xFFFFFFFF
//#define _EMACxMCFG_w_LENGTH                      0x00000020

//#define _EMAC1MCMD_READ_POSITION                 0x00000000
//#define _EMAC1MCMD_READ_MASK                     0x00000001
//#define _EMAC1MCMD_READ_LENGTH                   0x00000001

//#define _EMAC1MCMD_SCAN_POSITION                 0x00000001
//#define _EMAC1MCMD_SCAN_MASK                     0x00000002
//#define _EMAC1MCMD_SCAN_LENGTH                   0x00000001

//#define _EMAC1MCMD_w_POSITION                    0x00000000
//#define _EMAC1MCMD_w_MASK                        0xFFFFFFFF
//#define _EMAC1MCMD_w_LENGTH                      0x00000020

//#define _EMACxMCMD_READ_POSITION                 0x00000000
//#define _EMACxMCMD_READ_MASK                     0x00000001
//#define _EMACxMCMD_READ_LENGTH                   0x00000001

//#define _EMACxMCMD_SCAN_POSITION                 0x00000001
//#define _EMACxMCMD_SCAN_MASK                     0x00000002
//#define _EMACxMCMD_SCAN_LENGTH                   0x00000001

//#define _EMACxMCMD_w_POSITION                    0x00000000
//#define _EMACxMCMD_w_MASK                        0xFFFFFFFF
//#define _EMACxMCMD_w_LENGTH                      0x00000020

//#define _EMAC1MADR_REGADDR_POSITION              0x00000000
//#define _EMAC1MADR_REGADDR_MASK                  0x0000001F
//#define _EMAC1MADR_REGADDR_LENGTH                0x00000005

//#define _EMAC1MADR_PHYADDR_POSITION              0x00000008
//#define _EMAC1MADR_PHYADDR_MASK                  0x00001F00
//#define _EMAC1MADR_PHYADDR_LENGTH                0x00000005

//#define _EMAC1MADR_w_POSITION                    0x00000000
//#define _EMAC1MADR_w_MASK                        0xFFFFFFFF
//#define _EMAC1MADR_w_LENGTH                      0x00000020

//#define _EMACxMADR_REGADDR_POSITION              0x00000000
//#define _EMACxMADR_REGADDR_MASK                  0x0000001F
//#define _EMACxMADR_REGADDR_LENGTH                0x00000005

//#define _EMACxMADR_PHYADDR_POSITION              0x00000008
//#define _EMACxMADR_PHYADDR_MASK                  0x00001F00
//#define _EMACxMADR_PHYADDR_LENGTH                0x00000005

//#define _EMACxMADR_w_POSITION                    0x00000000
//#define _EMACxMADR_w_MASK                        0xFFFFFFFF
//#define _EMACxMADR_w_LENGTH                      0x00000020

//#define _EMAC1MWTD_MWTD_POSITION                 0x00000000
//#define _EMAC1MWTD_MWTD_MASK                     0x0000FFFF
//#define _EMAC1MWTD_MWTD_LENGTH                   0x00000010

//#define _EMAC1MWTD_w_POSITION                    0x00000000
//#define _EMAC1MWTD_w_MASK                        0xFFFFFFFF
//#define _EMAC1MWTD_w_LENGTH                      0x00000020

