HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _EMACxSA2_w_POSITION                     0x00000000
//#define _EMACxSA2_w_MASK                         0xFFFFFFFF
//#define _EMACxSA2_w_LENGTH                       0x00000020

//#define _PRECON_PFMWS_POSITION                   0x00000000
//#define _PRECON_PFMWS_MASK                       0x00000007
//#define _PRECON_PFMWS_LENGTH                     0x00000003

//#define _PRECON_PREFEN_POSITION                  0x00000004
//#define _PRECON_PREFEN_MASK                      0x00000030
//#define _PRECON_PREFEN_LENGTH                    0x00000002

//#define _PRECON_PFMSECEN_POSITION                0x0000001A
//#define _PRECON_PFMSECEN_MASK                    0x04000000
//#define _PRECON_PFMSECEN_LENGTH                  0x00000001

//#define _PRESTAT_PFMSECCNT_POSITION              0x00000000
//#define _PRESTAT_PFMSECCNT_MASK                  0x000000FF
//#define _PRESTAT_PFMSECCNT_LENGTH                0x00000008

//#define _PRESTAT_PFMSEC_POSITION                 0x0000001A
//#define _PRESTAT_PFMSEC_MASK                     0x04000000
//#define _PRESTAT_PFMSEC_LENGTH                   0x00000001

//#define _PRESTAT_PFMDED_POSITION                 0x0000001B
//#define _PRESTAT_PFMDED_MASK                     0x08000000
//#define _PRESTAT_PFMDED_LENGTH                   0x00000001

//#define _EBICS0_CSADDR_POSITION                  0x00000010
//#define _EBICS0_CSADDR_MASK                      0xFFFF0000
//#define _EBICS0_CSADDR_LENGTH                    0x00000010

//#define _EBIMSK0_MEMSIZE_POSITION                0x00000000
//#define _EBIMSK0_MEMSIZE_MASK                    0x0000001F
//#define _EBIMSK0_MEMSIZE_LENGTH                  0x00000005

//#define _EBIMSK0_MEMTYPE_POSITION                0x00000005
//#define _EBIMSK0_MEMTYPE_MASK                    0x000000E0
//#define _EBIMSK0_MEMTYPE_LENGTH                  0x00000003

//#define _EBIMSK0_REGSEL_POSITION                 0x00000008
//#define _EBIMSK0_REGSEL_MASK                     0x00000700
//#define _EBIMSK0_REGSEL_LENGTH                   0x00000003

//#define _EBISMT0_TRC_POSITION                    0x00000000
//#define _EBISMT0_TRC_MASK                        0x0000003F
//#define _EBISMT0_TRC_LENGTH                      0x00000006

//#define _EBISMT0_TAS_POSITION                    0x00000006
//#define _EBISMT0_TAS_MASK                        0x000000C0
//#define _EBISMT0_TAS_LENGTH                      0x00000002

//#define _EBISMT0_TWR_POSITION                    0x00000008
//#define _EBISMT0_TWR_MASK                        0x00000300
//#define _EBISMT0_TWR_LENGTH                      0x00000002

//#define _EBISMT0_TWP_POSITION                    0x0000000A
//#define _EBISMT0_TWP_MASK                        0x0000FC00
//#define _EBISMT0_TWP_LENGTH                      0x00000006

//#define _EBISMT0_TBTA_POSITION                   0x00000010
//#define _EBISMT0_TBTA_MASK                       0x00070000
//#define _EBISMT0_TBTA_LENGTH                     0x00000003

//#define _EBISMT0_TPRC_POSITION                   0x00000013
//#define _EBISMT0_TPRC_MASK                       0x00780000
//#define _EBISMT0_TPRC_LENGTH                     0x00000004

//#define _EBISMT0_PAGEMODE_POSITION               0x00000017
//#define _EBISMT0_PAGEMODE_MASK                   0x00800000
//#define _EBISMT0_PAGEMODE_LENGTH                 0x00000001

//#define _EBISMT0_PAGESIZE_POSITION               0x00000018
//#define _EBISMT0_PAGESIZE_MASK                   0x03000000
//#define _EBISMT0_PAGESIZE_LENGTH                 0x00000002

//#define _EBISMT0_RDYMODE_POSITION                0x0000001A
//#define _EBISMT0_RDYMODE_MASK                    0x04000000
//#define _EBISMT0_RDYMODE_LENGTH                  0x00000001

//#define _EBISMT1_TRC_POSITION                    0x00000000
//#define _EBISMT1_TRC_MASK                        0x0000003F
//#define _EBISMT1_TRC_LENGTH                      0x00000006

//#define _EBISMT1_TAS_POSITION                    0x00000006
//#define _EBISMT1_TAS_MASK                        0x000000C0
//#define _EBISMT1_TAS_LENGTH                      0x00000002

//#define _EBISMT1_TWR_POSITION                    0x00000008
//#define _EBISMT1_TWR_MASK                        0x00000300
//#define _EBISMT1_TWR_LENGTH                      0x00000002

//#define _EBISMT1_TWP_POSITION                    0x0000000A
//#define _EBISMT1_TWP_MASK                        0x0000FC00
//#define _EBISMT1_TWP_LENGTH                      0x00000006

//#define _EBISMT1_TBTA_POSITION                   0x00000010
//#define _EBISMT1_TBTA_MASK                       0x00070000
//#define _EBISMT1_TBTA_LENGTH                     0x00000003

//#define _EBISMT1_TPRC_POSITION                   0x00000013
//#define _EBISMT1_TPRC_MASK                       0x00780000
//#define _EBISMT1_TPRC_LENGTH                     0x00000004

//#define _EBISMT1_PAGEMODE_POSITION               0x00000017
//#define _EBISMT1_PAGEMODE_MASK                   0x00800000
//#define _EBISMT1_PAGEMODE_LENGTH                 0x00000001

//#define _EBISMT1_PAGESIZE_POSITION               0x00000018
//#define _EBISMT1_PAGESIZE_MASK                   0x03000000
//#define _EBISMT1_PAGESIZE_LENGTH                 0x00000002

//#define _EBISMT1_RDYMODE_POSITION                0x0000001A
//#define _EBISMT1_RDYMODE_MASK                    0x04000000
//#define _EBISMT1_RDYMODE_LENGTH                  0x00000001

//#define _EBISMT2_TRC_POSITION                    0x00000000
//#define _EBISMT2_TRC_MASK                        0x0000003F
//#define _EBISMT2_TRC_LENGTH                      0x00000006

//#define _EBISMT2_TAS_POSITION                    0x00000006
//#define _EBISMT2_TAS_MASK                        0x000000C0
//#define _EBISMT2_TAS_LENGTH                      0x00000002

//#define _EBISMT2_TWR_POSITION                    0x00000008
//#define _EBISMT2_TWR_MASK                        0x00000300
//#define _EBISMT2_TWR_LENGTH                      0x00000002

//#define _EBISMT2_TWP_POSITION                    0x0000000A
//#define _EBISMT2_TWP_MASK                        0x0000FC00
//#define _EBISMT2_TWP_LENGTH                      0x00000006

