HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _EBISMT2_TBTA_POSITION                   0x00000010
//#define _EBISMT2_TBTA_MASK                       0x00070000
//#define _EBISMT2_TBTA_LENGTH                     0x00000003

//#define _EBISMT2_TPRC_POSITION                   0x00000013
//#define _EBISMT2_TPRC_MASK                       0x00780000
//#define _EBISMT2_TPRC_LENGTH                     0x00000004

//#define _EBISMT2_PAGEMODE_POSITION               0x00000017
//#define _EBISMT2_PAGEMODE_MASK                   0x00800000
//#define _EBISMT2_PAGEMODE_LENGTH                 0x00000001

//#define _EBISMT2_PAGESIZE_POSITION               0x00000018
//#define _EBISMT2_PAGESIZE_MASK                   0x03000000
//#define _EBISMT2_PAGESIZE_LENGTH                 0x00000002

//#define _EBISMT2_RDYMODE_POSITION                0x0000001A
//#define _EBISMT2_RDYMODE_MASK                    0x04000000
//#define _EBISMT2_RDYMODE_LENGTH                  0x00000001

//#define _EBIFTRPD_TRPD_POSITION                  0x00000000
//#define _EBIFTRPD_TRPD_MASK                      0xFFFFFFFF
//#define _EBIFTRPD_TRPD_LENGTH                    0x00000020

//#define _EBISMCON_SMRP_POSITION                  0x00000000
//#define _EBISMCON_SMRP_MASK                      0x00000001
//#define _EBISMCON_SMRP_LENGTH                    0x00000001

//#define _EBISMCON_SMDWIDTH0_POSITION             0x00000007
//#define _EBISMCON_SMDWIDTH0_MASK                 0x00000380
//#define _EBISMCON_SMDWIDTH0_LENGTH               0x00000003

//#define _EBISMCON_SMDWIDTH1_POSITION             0x0000000A
//#define _EBISMCON_SMDWIDTH1_MASK                 0x00001C00
//#define _EBISMCON_SMDWIDTH1_LENGTH               0x00000003

//#define _EBISMCON_SMDWIDTH2_POSITION             0x0000000D
//#define _EBISMCON_SMDWIDTH2_MASK                 0x0000E000
//#define _EBISMCON_SMDWIDTH2_LENGTH               0x00000003

//#define _SQI1XCON1_TYPECMD_POSITION              0x00000000
//#define _SQI1XCON1_TYPECMD_MASK                  0x00000003
//#define _SQI1XCON1_TYPECMD_LENGTH                0x00000002

//#define _SQI1XCON1_TYPEADDR_POSITION             0x00000002
//#define _SQI1XCON1_TYPEADDR_MASK                 0x0000000C
//#define _SQI1XCON1_TYPEADDR_LENGTH               0x00000002

//#define _SQI1XCON1_TYPEMODE_POSITION             0x00000004
//#define _SQI1XCON1_TYPEMODE_MASK                 0x00000030
//#define _SQI1XCON1_TYPEMODE_LENGTH               0x00000002

//#define _SQI1XCON1_TYPEDUMMY_POSITION            0x00000006
//#define _SQI1XCON1_TYPEDUMMY_MASK                0x000000C0
//#define _SQI1XCON1_TYPEDUMMY_LENGTH              0x00000002

//#define _SQI1XCON1_TYPEDATA_POSITION             0x00000008
//#define _SQI1XCON1_TYPEDATA_MASK                 0x00000300
//#define _SQI1XCON1_TYPEDATA_LENGTH               0x00000002

//#define _SQI1XCON1_READOPCODE_POSITION           0x0000000A
//#define _SQI1XCON1_READOPCODE_MASK               0x0003FC00
//#define _SQI1XCON1_READOPCODE_LENGTH             0x00000008

//#define _SQI1XCON1_ADDRBYTES_POSITION            0x00000012
//#define _SQI1XCON1_ADDRBYTES_MASK                0x001C0000
//#define _SQI1XCON1_ADDRBYTES_LENGTH              0x00000003

//#define _SQI1XCON1_DUMMYBYTES_POSITION           0x00000015
//#define _SQI1XCON1_DUMMYBYTES_MASK               0x00E00000
//#define _SQI1XCON1_DUMMYBYTES_LENGTH             0x00000003

//#define _SQI1XCON2_MODECODE_POSITION             0x00000000
//#define _SQI1XCON2_MODECODE_MASK                 0x000000FF
//#define _SQI1XCON2_MODECODE_LENGTH               0x00000008

//#define _SQI1XCON2_MODEBYTES_POSITION            0x00000008
//#define _SQI1XCON2_MODEBYTES_MASK                0x00000300
//#define _SQI1XCON2_MODEBYTES_LENGTH              0x00000002

//#define _SQI1XCON2_DEVSEL_POSITION               0x0000000A
//#define _SQI1XCON2_DEVSEL_MASK                   0x00000C00
//#define _SQI1XCON2_DEVSEL_LENGTH                 0x00000002

//#define _SQI1CFG_MODE_POSITION                   0x00000000
//#define _SQI1CFG_MODE_MASK                       0x00000007
//#define _SQI1CFG_MODE_LENGTH                     0x00000003

//#define _SQI1CFG_CPHA_POSITION                   0x00000003
//#define _SQI1CFG_CPHA_MASK                       0x00000008
//#define _SQI1CFG_CPHA_LENGTH                     0x00000001

//#define _SQI1CFG_CPOL_POSITION                   0x00000004
//#define _SQI1CFG_CPOL_MASK                       0x00000010
//#define _SQI1CFG_CPOL_LENGTH                     0x00000001

//#define _SQI1CFG_LSBF_POSITION                   0x00000005
//#define _SQI1CFG_LSBF_MASK                       0x00000020
//#define _SQI1CFG_LSBF_LENGTH                     0x00000001

//#define _SQI1CFG_RXLATCH_POSITION                0x00000006
//#define _SQI1CFG_RXLATCH_MASK                    0x00000040
//#define _SQI1CFG_RXLATCH_LENGTH                  0x00000001

//#define _SQI1CFG_SERMODE_POSITION                0x00000007
//#define _SQI1CFG_SERMODE_MASK                    0x00000080
//#define _SQI1CFG_SERMODE_LENGTH                  0x00000001

//#define _SQI1CFG_WP_POSITION                     0x00000008
//#define _SQI1CFG_WP_MASK                         0x00000100
//#define _SQI1CFG_WP_LENGTH                       0x00000001

//#define _SQI1CFG_HOLD_POSITION                   0x00000009
//#define _SQI1CFG_HOLD_MASK                       0x00000200
//#define _SQI1CFG_HOLD_LENGTH                     0x00000001

//#define _SQI1CFG_BURSTEN_POSITION                0x0000000B
//#define _SQI1CFG_BURSTEN_MASK                    0x00000800
//#define _SQI1CFG_BURSTEN_LENGTH                  0x00000001

//#define _SQI1CFG_RESET_POSITION                  0x0000000E
//#define _SQI1CFG_RESET_MASK                      0x00004000
//#define _SQI1CFG_RESET_LENGTH                    0x00000001

//#define _SQI1CFG_DATAEN_POSITION                 0x00000012
//#define _SQI1CFG_DATAEN_MASK                     0x000C0000
//#define _SQI1CFG_DATAEN_LENGTH                   0x00000002

//#define _SQI1CFG_CSEN_POSITION                   0x00000016
//#define _SQI1CFG_CSEN_MASK                       0x00C00000
//#define _SQI1CFG_CSEN_LENGTH                     0x00000002

//#define _SQI1CFG_SQIEN_POSITION                  0x0000001D
//#define _SQI1CFG_SQIEN_MASK                      0x20000000
//#define _SQI1CFG_SQIEN_LENGTH                    0x00000001

//#define _SQI1CON_TXRXCOUNT_POSITION              0x00000000
//#define _SQI1CON_TXRXCOUNT_MASK                  0x0000FFFF
//#define _SQI1CON_TXRXCOUNT_LENGTH                0x00000010

//#define _SQI1CON_CMDINIT_POSITION                0x00000010
//#define _SQI1CON_CMDINIT_MASK                    0x00030000
//#define _SQI1CON_CMDINIT_LENGTH                  0x00000002

//#define _SQI1CON_LANEMODE_POSITION               0x00000012
//#define _SQI1CON_LANEMODE_MASK                   0x000C0000
//#define _SQI1CON_LANEMODE_LENGTH                 0x00000002

//#define _SQI1CON_DEVSEL_POSITION                 0x00000014
//#define _SQI1CON_DEVSEL_MASK                     0x00300000
//#define _SQI1CON_DEVSEL_LENGTH                   0x00000002

//#define _SQI1CON_DASSERT_POSITION                0x00000016
//#define _SQI1CON_DASSERT_MASK                    0x00400000
//#define _SQI1CON_DASSERT_LENGTH                  0x00000001

//#define _SQI1CLKCON_EN_POSITION                  0x00000000
//#define _SQI1CLKCON_EN_MASK                      0x00000001
//#define _SQI1CLKCON_EN_LENGTH                    0x00000001

