HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBCSR0_SUSPMODE_POSITION               0x00000009
//#define _USBCSR0_SUSPMODE_MASK                   0x00000200
//#define _USBCSR0_SUSPMODE_LENGTH                 0x00000001

//#define _USBCSR0_RESUME_POSITION                 0x0000000A
//#define _USBCSR0_RESUME_MASK                     0x00000400
//#define _USBCSR0_RESUME_LENGTH                   0x00000001

//#define _USBCSR0_RESET_POSITION                  0x0000000B
//#define _USBCSR0_RESET_MASK                      0x00000800
//#define _USBCSR0_RESET_LENGTH                    0x00000001

//#define _USBCSR0_HSMODE_POSITION                 0x0000000C
//#define _USBCSR0_HSMODE_MASK                     0x00001000
//#define _USBCSR0_HSMODE_LENGTH                   0x00000001

//#define _USBCSR0_HSEN_POSITION                   0x0000000D
//#define _USBCSR0_HSEN_MASK                       0x00002000
//#define _USBCSR0_HSEN_LENGTH                     0x00000001

//#define _USBCSR0_SOFTCONN_POSITION               0x0000000E
//#define _USBCSR0_SOFTCONN_MASK                   0x00004000
//#define _USBCSR0_SOFTCONN_LENGTH                 0x00000001

//#define _USBCSR0_ISOUPD_POSITION                 0x0000000F
//#define _USBCSR0_ISOUPD_MASK                     0x00008000
//#define _USBCSR0_ISOUPD_LENGTH                   0x00000001

//#define _USBCSR0_EP0IF_POSITION                  0x00000010
//#define _USBCSR0_EP0IF_MASK                      0x00010000
//#define _USBCSR0_EP0IF_LENGTH                    0x00000001

//#define _USBCSR0_EP1TXIF_POSITION                0x00000011
//#define _USBCSR0_EP1TXIF_MASK                    0x00020000
//#define _USBCSR0_EP1TXIF_LENGTH                  0x00000001

//#define _USBCSR0_EP2TXIF_POSITION                0x00000012
//#define _USBCSR0_EP2TXIF_MASK                    0x00040000
//#define _USBCSR0_EP2TXIF_LENGTH                  0x00000001

//#define _USBCSR0_EP3TXIF_POSITION                0x00000013
//#define _USBCSR0_EP3TXIF_MASK                    0x00080000
//#define _USBCSR0_EP3TXIF_LENGTH                  0x00000001

//#define _USBCSR0_EP4TXIF_POSITION                0x00000014
//#define _USBCSR0_EP4TXIF_MASK                    0x00100000
//#define _USBCSR0_EP4TXIF_LENGTH                  0x00000001

//#define _USBCSR0_EP5TXIF_POSITION                0x00000015
//#define _USBCSR0_EP5TXIF_MASK                    0x00200000
//#define _USBCSR0_EP5TXIF_LENGTH                  0x00000001

//#define _USBCSR0_EP6TXIF_POSITION                0x00000016
//#define _USBCSR0_EP6TXIF_MASK                    0x00400000
//#define _USBCSR0_EP6TXIF_LENGTH                  0x00000001

//#define _USBCSR0_EP7TXIF_POSITION                0x00000017
//#define _USBCSR0_EP7TXIF_MASK                    0x00800000
//#define _USBCSR0_EP7TXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP1RXIF_POSITION                0x00000001
//#define _USBCSR1_EP1RXIF_MASK                    0x00000002
//#define _USBCSR1_EP1RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP2RXIF_POSITION                0x00000002
//#define _USBCSR1_EP2RXIF_MASK                    0x00000004
//#define _USBCSR1_EP2RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP3RXIF_POSITION                0x00000003
//#define _USBCSR1_EP3RXIF_MASK                    0x00000008
//#define _USBCSR1_EP3RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP4RXIF_POSITION                0x00000004
//#define _USBCSR1_EP4RXIF_MASK                    0x00000010
//#define _USBCSR1_EP4RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP5RXIF_POSITION                0x00000005
//#define _USBCSR1_EP5RXIF_MASK                    0x00000020
//#define _USBCSR1_EP5RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP6RXIF_POSITION                0x00000006
//#define _USBCSR1_EP6RXIF_MASK                    0x00000040
//#define _USBCSR1_EP6RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP7RXIF_POSITION                0x00000007
//#define _USBCSR1_EP7RXIF_MASK                    0x00000080
//#define _USBCSR1_EP7RXIF_LENGTH                  0x00000001

//#define _USBCSR1_EP0IE_POSITION                  0x00000010
//#define _USBCSR1_EP0IE_MASK                      0x00010000
//#define _USBCSR1_EP0IE_LENGTH                    0x00000001

//#define _USBCSR1_EP1TXIE_POSITION                0x00000011
//#define _USBCSR1_EP1TXIE_MASK                    0x00020000
//#define _USBCSR1_EP1TXIE_LENGTH                  0x00000001

//#define _USBCSR1_EP2TXIE_POSITION                0x00000012
//#define _USBCSR1_EP2TXIE_MASK                    0x00040000
//#define _USBCSR1_EP2TXIE_LENGTH                  0x00000001

//#define _USBCSR1_EP3TXIE_POSITION                0x00000013
//#define _USBCSR1_EP3TXIE_MASK                    0x00080000
//#define _USBCSR1_EP3TXIE_LENGTH                  0x00000001

//#define _USBCSR1_EP4TXIE_POSITION                0x00000014
//#define _USBCSR1_EP4TXIE_MASK                    0x00100000
//#define _USBCSR1_EP4TXIE_LENGTH                  0x00000001

//#define _USBCSR1_EP5TXIE_POSITION                0x00000015
//#define _USBCSR1_EP5TXIE_MASK                    0x00200000
//#define _USBCSR1_EP5TXIE_LENGTH                  0x00000001

//#define _USBCSR1_EP6TXIE_POSITION                0x00000016
//#define _USBCSR1_EP6TXIE_MASK                    0x00400000
//#define _USBCSR1_EP6TXIE_LENGTH                  0x00000001

//#define _USBCSR1_EP7TXIE_POSITION                0x00000017
//#define _USBCSR1_EP7TXIE_MASK                    0x00800000
//#define _USBCSR1_EP7TXIE_LENGTH                  0x00000001

//#define _USBCSR2_EP1RXIE_POSITION                0x00000001
//#define _USBCSR2_EP1RXIE_MASK                    0x00000002
//#define _USBCSR2_EP1RXIE_LENGTH                  0x00000001

//#define _USBCSR2_EP2RXIE_POSITION                0x00000002
//#define _USBCSR2_EP2RXIE_MASK                    0x00000004
//#define _USBCSR2_EP2RXIE_LENGTH                  0x00000001

//#define _USBCSR2_EP3RXIE_POSITION                0x00000003
//#define _USBCSR2_EP3RXIE_MASK                    0x00000008
//#define _USBCSR2_EP3RXIE_LENGTH                  0x00000001

//#define _USBCSR2_EP4RXIE_POSITION                0x00000004
//#define _USBCSR2_EP4RXIE_MASK                    0x00000010
//#define _USBCSR2_EP4RXIE_LENGTH                  0x00000001

//#define _USBCSR2_EP5RXIE_POSITION                0x00000005
//#define _USBCSR2_EP5RXIE_MASK                    0x00000020
//#define _USBCSR2_EP5RXIE_LENGTH                  0x00000001

