HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBCSR2_EP6RXIE_POSITION                0x00000006
//#define _USBCSR2_EP6RXIE_MASK                    0x00000040
//#define _USBCSR2_EP6RXIE_LENGTH                  0x00000001

//#define _USBCSR2_EP7RXIE_POSITION                0x00000007
//#define _USBCSR2_EP7RXIE_MASK                    0x00000080
//#define _USBCSR2_EP7RXIE_LENGTH                  0x00000001

//#define _USBCSR2_SUSPIF_POSITION                 0x00000010
//#define _USBCSR2_SUSPIF_MASK                     0x00010000
//#define _USBCSR2_SUSPIF_LENGTH                   0x00000001

//#define _USBCSR2_RESUMEIF_POSITION               0x00000011
//#define _USBCSR2_RESUMEIF_MASK                   0x00020000
//#define _USBCSR2_RESUMEIF_LENGTH                 0x00000001

//#define _USBCSR2_RESETIF_POSITION                0x00000012
//#define _USBCSR2_RESETIF_MASK                    0x00040000
//#define _USBCSR2_RESETIF_LENGTH                  0x00000001

//#define _USBCSR2_SOFIF_POSITION                  0x00000013
//#define _USBCSR2_SOFIF_MASK                      0x00080000
//#define _USBCSR2_SOFIF_LENGTH                    0x00000001

//#define _USBCSR2_CONNIF_POSITION                 0x00000014
//#define _USBCSR2_CONNIF_MASK                     0x00100000
//#define _USBCSR2_CONNIF_LENGTH                   0x00000001

//#define _USBCSR2_DISCONIF_POSITION               0x00000015
//#define _USBCSR2_DISCONIF_MASK                   0x00200000
//#define _USBCSR2_DISCONIF_LENGTH                 0x00000001

//#define _USBCSR2_SESSRQIF_POSITION               0x00000016
//#define _USBCSR2_SESSRQIF_MASK                   0x00400000
//#define _USBCSR2_SESSRQIF_LENGTH                 0x00000001

//#define _USBCSR2_VBUSERRIF_POSITION              0x00000017
//#define _USBCSR2_VBUSERRIF_MASK                  0x00800000
//#define _USBCSR2_VBUSERRIF_LENGTH                0x00000001

//#define _USBCSR2_SUSPIE_POSITION                 0x00000018
//#define _USBCSR2_SUSPIE_MASK                     0x01000000
//#define _USBCSR2_SUSPIE_LENGTH                   0x00000001

//#define _USBCSR2_RESUMEIE_POSITION               0x00000019
//#define _USBCSR2_RESUMEIE_MASK                   0x02000000
//#define _USBCSR2_RESUMEIE_LENGTH                 0x00000001

//#define _USBCSR2_RESETIE_POSITION                0x0000001A
//#define _USBCSR2_RESETIE_MASK                    0x04000000
//#define _USBCSR2_RESETIE_LENGTH                  0x00000001

//#define _USBCSR2_SOFIE_POSITION                  0x0000001B
//#define _USBCSR2_SOFIE_MASK                      0x08000000
//#define _USBCSR2_SOFIE_LENGTH                    0x00000001

//#define _USBCSR2_CONNIE_POSITION                 0x0000001C
//#define _USBCSR2_CONNIE_MASK                     0x10000000
//#define _USBCSR2_CONNIE_LENGTH                   0x00000001

//#define _USBCSR2_DISCONIE_POSITION               0x0000001D
//#define _USBCSR2_DISCONIE_MASK                   0x20000000
//#define _USBCSR2_DISCONIE_LENGTH                 0x00000001

//#define _USBCSR2_SESSRQIE_POSITION               0x0000001E
//#define _USBCSR2_SESSRQIE_MASK                   0x40000000
//#define _USBCSR2_SESSRQIE_LENGTH                 0x00000001

//#define _USBCSR2_VBUSERRIE_POSITION              0x0000001F
//#define _USBCSR2_VBUSERRIE_MASK                  0x80000000
//#define _USBCSR2_VBUSERRIE_LENGTH                0x00000001

//#define _USBCSR3_RFRMNUM_POSITION                0x00000000
//#define _USBCSR3_RFRMNUM_MASK                    0x000007FF
//#define _USBCSR3_RFRMNUM_LENGTH                  0x0000000B

//#define _USBCSR3_ENDPOINT_POSITION               0x00000010
//#define _USBCSR3_ENDPOINT_MASK                   0x000F0000
//#define _USBCSR3_ENDPOINT_LENGTH                 0x00000004

//#define _USBCSR3_NAK_POSITION                    0x00000018
//#define _USBCSR3_NAK_MASK                        0x01000000
//#define _USBCSR3_NAK_LENGTH                      0x00000001

//#define _USBCSR3_TESTJ_POSITION                  0x00000019
//#define _USBCSR3_TESTJ_MASK                      0x02000000
//#define _USBCSR3_TESTJ_LENGTH                    0x00000001

//#define _USBCSR3_TESTK_POSITION                  0x0000001A
//#define _USBCSR3_TESTK_MASK                      0x04000000
//#define _USBCSR3_TESTK_LENGTH                    0x00000001

//#define _USBCSR3_PACKET_POSITION                 0x0000001B
//#define _USBCSR3_PACKET_MASK                     0x08000000
//#define _USBCSR3_PACKET_LENGTH                   0x00000001

//#define _USBCSR3_FORCEHS_POSITION                0x0000001C
//#define _USBCSR3_FORCEHS_MASK                    0x10000000
//#define _USBCSR3_FORCEHS_LENGTH                  0x00000001

//#define _USBCSR3_FORCEFS_POSITION                0x0000001D
//#define _USBCSR3_FORCEFS_MASK                    0x20000000
//#define _USBCSR3_FORCEFS_LENGTH                  0x00000001

//#define _USBCSR3_FIFOACC_POSITION                0x0000001E
//#define _USBCSR3_FIFOACC_MASK                    0x40000000
//#define _USBCSR3_FIFOACC_LENGTH                  0x00000001

//#define _USBCSR3_FORCEHST_POSITION               0x0000001F
//#define _USBCSR3_FORCEHST_MASK                   0x80000000
//#define _USBCSR3_FORCEHST_LENGTH                 0x00000001

//#define _USBIENCSR0_TXMAXP_POSITION              0x00000000
//#define _USBIENCSR0_TXMAXP_MASK                  0x000007FF
//#define _USBIENCSR0_TXMAXP_LENGTH                0x0000000B

//#define _USBIENCSR0_MULT_POSITION                0x0000000B
//#define _USBIENCSR0_MULT_MASK                    0x0000F800
//#define _USBIENCSR0_MULT_LENGTH                  0x00000005

//#define _USBIENCSR0_TXPKTRDY_POSITION            0x00000010
//#define _USBIENCSR0_TXPKTRDY_MASK                0x00010000
//#define _USBIENCSR0_TXPKTRDY_LENGTH              0x00000001

//#define _USBIENCSR0_FIFONE_POSITION              0x00000011
//#define _USBIENCSR0_FIFONE_MASK                  0x00020000
//#define _USBIENCSR0_FIFONE_LENGTH                0x00000001

//#define _USBIENCSR0_ERROR_POSITION               0x00000012
//#define _USBIENCSR0_ERROR_MASK                   0x00040000
//#define _USBIENCSR0_ERROR_LENGTH                 0x00000001

//#define _USBIENCSR0_FLUSH_POSITION               0x00000013
//#define _USBIENCSR0_FLUSH_MASK                   0x00080000
//#define _USBIENCSR0_FLUSH_LENGTH                 0x00000001

//#define _USBIENCSR0_SETUPPKT_POSITION            0x00000014
//#define _USBIENCSR0_SETUPPKT_MASK                0x00100000
//#define _USBIENCSR0_SETUPPKT_LENGTH              0x00000001

//#define _USBIENCSR0_RXSTALL_POSITION             0x00000015
//#define _USBIENCSR0_RXSTALL_MASK                 0x00200000
//#define _USBIENCSR0_RXSTALL_LENGTH               0x00000001

