HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBIENCSR1_DISNYET_POSITION             0x0000001C
//#define _USBIENCSR1_DISNYET_MASK                 0x10000000
//#define _USBIENCSR1_DISNYET_LENGTH               0x00000001

//#define _USBIENCSR1_ISO_POSITION                 0x0000001E
//#define _USBIENCSR1_ISO_MASK                     0x40000000
//#define _USBIENCSR1_ISO_LENGTH                   0x00000001

//#define _USBIENCSR2_RXCNT_POSITION               0x00000000
//#define _USBIENCSR2_RXCNT_MASK                   0x00003FFF
//#define _USBIENCSR2_RXCNT_LENGTH                 0x0000000E

//#define _USBIENCSR2_TEP_POSITION                 0x00000010
//#define _USBIENCSR2_TEP_MASK                     0x000F0000
//#define _USBIENCSR2_TEP_LENGTH                   0x00000004

//#define _USBIENCSR2_PROTOCOL_POSITION            0x00000014
//#define _USBIENCSR2_PROTOCOL_MASK                0x00300000
//#define _USBIENCSR2_PROTOCOL_LENGTH              0x00000002

//#define _USBIENCSR2_SPEED_POSITION               0x00000016
//#define _USBIENCSR2_SPEED_MASK                   0x00C00000
//#define _USBIENCSR2_SPEED_LENGTH                 0x00000002

//#define _USBIENCSR2_TXINTERV_POSITION            0x00000018
//#define _USBIENCSR2_TXINTERV_MASK                0xFF000000
//#define _USBIENCSR2_TXINTERV_LENGTH              0x00000008

//#define _USBIENCSR3_TEP_POSITION                 0x00000000
//#define _USBIENCSR3_TEP_MASK                     0x0000000F
//#define _USBIENCSR3_TEP_LENGTH                   0x00000004

//#define _USBIENCSR3_PROTOCOL_POSITION            0x00000004
//#define _USBIENCSR3_PROTOCOL_MASK                0x00000030
//#define _USBIENCSR3_PROTOCOL_LENGTH              0x00000002

//#define _USBIENCSR3_SPEED_POSITION               0x00000006
//#define _USBIENCSR3_SPEED_MASK                   0x000000C0
//#define _USBIENCSR3_SPEED_LENGTH                 0x00000002

//#define _USBIENCSR3_RXINTERV_POSITION            0x00000008
//#define _USBIENCSR3_RXINTERV_MASK                0x0000FF00
//#define _USBIENCSR3_RXINTERV_LENGTH              0x00000008

//#define _USBIENCSR3_TXFIFOSZ_POSITION            0x00000018
//#define _USBIENCSR3_TXFIFOSZ_MASK                0x0F000000
//#define _USBIENCSR3_TXFIFOSZ_LENGTH              0x00000004

//#define _USBIENCSR3_RXFIFOSZ_POSITION            0x0000001C
//#define _USBIENCSR3_RXFIFOSZ_MASK                0xF0000000
//#define _USBIENCSR3_RXFIFOSZ_LENGTH              0x00000004

//#define _USBFIFO0_DATA_POSITION                  0x00000000
//#define _USBFIFO0_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO0_DATA_LENGTH                    0x00000020

//#define _USBFIFO1_DATA_POSITION                  0x00000000
//#define _USBFIFO1_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO1_DATA_LENGTH                    0x00000020

//#define _USBFIFO2_DATA_POSITION                  0x00000000
//#define _USBFIFO2_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO2_DATA_LENGTH                    0x00000020

//#define _USBFIFO3_DATA_POSITION                  0x00000000
//#define _USBFIFO3_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO3_DATA_LENGTH                    0x00000020

//#define _USBFIFO4_DATA_POSITION                  0x00000000
//#define _USBFIFO4_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO4_DATA_LENGTH                    0x00000020

//#define _USBFIFO5_DATA_POSITION                  0x00000000
//#define _USBFIFO5_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO5_DATA_LENGTH                    0x00000020

//#define _USBFIFO6_DATA_POSITION                  0x00000000
//#define _USBFIFO6_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO6_DATA_LENGTH                    0x00000020

//#define _USBFIFO7_DATA_POSITION                  0x00000000
//#define _USBFIFO7_DATA_MASK                      0xFFFFFFFF
//#define _USBFIFO7_DATA_LENGTH                    0x00000020

//#define _USBOTG_SESSION_POSITION                 0x00000000
//#define _USBOTG_SESSION_MASK                     0x00000001
//#define _USBOTG_SESSION_LENGTH                   0x00000001

//#define _USBOTG_HOSTREQ_POSITION                 0x00000001
//#define _USBOTG_HOSTREQ_MASK                     0x00000002
//#define _USBOTG_HOSTREQ_LENGTH                   0x00000001

//#define _USBOTG_HOSTMODE_POSITION                0x00000002
//#define _USBOTG_HOSTMODE_MASK                    0x00000004
//#define _USBOTG_HOSTMODE_LENGTH                  0x00000001

//#define _USBOTG_VBUS_POSITION                    0x00000003
//#define _USBOTG_VBUS_MASK                        0x00000018
//#define _USBOTG_VBUS_LENGTH                      0x00000002

//#define _USBOTG_LSDEV_POSITION                   0x00000005
//#define _USBOTG_LSDEV_MASK                       0x00000020
//#define _USBOTG_LSDEV_LENGTH                     0x00000001

//#define _USBOTG_FSDEV_POSITION                   0x00000006
//#define _USBOTG_FSDEV_MASK                       0x00000040
//#define _USBOTG_FSDEV_LENGTH                     0x00000001

//#define _USBOTG_BDEV_POSITION                    0x00000007
//#define _USBOTG_BDEV_MASK                        0x00000080
//#define _USBOTG_BDEV_LENGTH                      0x00000001

//#define _USBOTG_RXEDMA_POSITION                  0x00000008
//#define _USBOTG_RXEDMA_MASK                      0x00000100
//#define _USBOTG_RXEDMA_LENGTH                    0x00000001

//#define _USBOTG_TXEDMA_POSITION                  0x00000009
//#define _USBOTG_TXEDMA_MASK                      0x00000200
//#define _USBOTG_TXEDMA_LENGTH                    0x00000001

//#define _USBOTG_TXFIFOSZ_POSITION                0x00000010
//#define _USBOTG_TXFIFOSZ_MASK                    0x000F0000
//#define _USBOTG_TXFIFOSZ_LENGTH                  0x00000004

//#define _USBOTG_TXDPB_POSITION                   0x00000014
//#define _USBOTG_TXDPB_MASK                       0x00100000
//#define _USBOTG_TXDPB_LENGTH                     0x00000001

//#define _USBOTG_RXFIFOSZ_POSITION                0x00000018
//#define _USBOTG_RXFIFOSZ_MASK                    0x0F000000
//#define _USBOTG_RXFIFOSZ_LENGTH                  0x00000004

//#define _USBOTG_RXDPB_POSITION                   0x0000001C
//#define _USBOTG_RXDPB_MASK                       0x10000000
//#define _USBOTG_RXDPB_LENGTH                     0x00000001

//#define _USBFIFOA_TXFIFOAD_POSITION              0x00000000
//#define _USBFIFOA_TXFIFOAD_MASK                  0x00001FFF
//#define _USBFIFOA_TXFIFOAD_LENGTH                0x0000000D

//#define _USBFIFOA_RXFIFOAD_POSITION              0x00000010
//#define _USBFIFOA_RXFIFOAD_MASK                  0x1FFF0000
//#define _USBFIFOA_RXFIFOAD_LENGTH                0x0000000D

//#define _USBHWVER_VERMINOR_POSITION              0x00000000
//#define _USBHWVER_VERMINOR_MASK                  0x000003FF
//#define _USBHWVER_VERMINOR_LENGTH                0x0000000A

//#define _USBHWVER_VERMAJOR_POSITION              0x0000000A
//#define _USBHWVER_VERMAJOR_MASK                  0x00007C00
//#define _USBHWVER_VERMAJOR_LENGTH                0x00000005

//#define _USBHWVER_RC_POSITION                    0x0000000F
//#define _USBHWVER_RC_MASK                        0x00008000
//#define _USBHWVER_RC_LENGTH                      0x00000001

//#define _USBINFO_TXENDPTS_POSITION               0x00000000
//#define _USBINFO_TXENDPTS_MASK                   0x0000000F
//#define _USBINFO_TXENDPTS_LENGTH                 0x00000004

