HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBE0CSR0_TXRDY_POSITION                0x00000011
//#define _USBE0CSR0_TXRDY_MASK                    0x00020000
//#define _USBE0CSR0_TXRDY_LENGTH                  0x00000001

//#define _USBE0CSR0_STALLED_POSITION              0x00000012
//#define _USBE0CSR0_STALLED_MASK                  0x00040000
//#define _USBE0CSR0_STALLED_LENGTH                0x00000001

//#define _USBE0CSR0_SETUP_POSITION                0x00000013
//#define _USBE0CSR0_SETUP_MASK                    0x00080000
//#define _USBE0CSR0_SETUP_LENGTH                  0x00000001

//#define _USBE0CSR0_ERROR_POSITION                0x00000014
//#define _USBE0CSR0_ERROR_MASK                    0x00100000
//#define _USBE0CSR0_ERROR_LENGTH                  0x00000001

//#define _USBE0CSR0_REQPKT_POSITION               0x00000015
//#define _USBE0CSR0_REQPKT_MASK                   0x00200000
//#define _USBE0CSR0_REQPKT_LENGTH                 0x00000001

//#define _USBE0CSR0_STATUS_POSITION               0x00000016
//#define _USBE0CSR0_STATUS_MASK                   0x00400000
//#define _USBE0CSR0_STATUS_LENGTH                 0x00000001

//#define _USBE0CSR0_NAKTO_POSITION                0x00000017
//#define _USBE0CSR0_NAKTO_MASK                    0x00800000
//#define _USBE0CSR0_NAKTO_LENGTH                  0x00000001

//#define _USBE0CSR0_FLUSH_POSITION                0x00000018
//#define _USBE0CSR0_FLUSH_MASK                    0x01000000
//#define _USBE0CSR0_FLUSH_LENGTH                  0x00000001

//#define _USBE0CSR0_DT_POSITION                   0x00000019
//#define _USBE0CSR0_DT_MASK                       0x02000000
//#define _USBE0CSR0_DT_LENGTH                     0x00000001

//#define _USBE0CSR0_DTWE_POSITION                 0x0000001A
//#define _USBE0CSR0_DTWE_MASK                     0x04000000
//#define _USBE0CSR0_DTWE_LENGTH                   0x00000001

//#define _USBE0CSR0_DATAEND_POSITION              0x00000013
//#define _USBE0CSR0_DATAEND_MASK                  0x00080000
//#define _USBE0CSR0_DATAEND_LENGTH                0x00000001

//#define _USBE0CSR0_SETEND_POSITION               0x00000014
//#define _USBE0CSR0_SETEND_MASK                   0x00100000
//#define _USBE0CSR0_SETEND_LENGTH                 0x00000001

//#define _USBE0CSR0_STALL_POSITION                0x00000015
//#define _USBE0CSR0_STALL_MASK                    0x00200000
//#define _USBE0CSR0_STALL_LENGTH                  0x00000001

//#define _USBE0CSR0_RXRDYC_POSITION               0x00000016
//#define _USBE0CSR0_RXRDYC_MASK                   0x00400000
//#define _USBE0CSR0_RXRDYC_LENGTH                 0x00000001

//#define _USBE0CSR0_SETENDC_POSITION              0x00000017
//#define _USBE0CSR0_SETENDC_MASK                  0x00800000
//#define _USBE0CSR0_SETENDC_LENGTH                0x00000001

//#define _USBE0CSR2_RXCNT_POSITION                0x00000000
//#define _USBE0CSR2_RXCNT_MASK                    0x0000007F
//#define _USBE0CSR2_RXCNT_LENGTH                  0x00000007

//#define _USBE0CSR2_SPEED_POSITION                0x00000016
//#define _USBE0CSR2_SPEED_MASK                    0x00C00000
//#define _USBE0CSR2_SPEED_LENGTH                  0x00000002

//#define _USBE0CSR2_NAKLIM_POSITION               0x00000018
//#define _USBE0CSR2_NAKLIM_MASK                   0x0F000000
//#define _USBE0CSR2_NAKLIM_LENGTH                 0x00000004

//#define _USBE0CSR3_UTMIDWID_POSITION             0x00000018
//#define _USBE0CSR3_UTMIDWID_MASK                 0x01000000
//#define _USBE0CSR3_UTMIDWID_LENGTH               0x00000001

//#define _USBE0CSR3_SOFTCONE_POSITION             0x00000019
//#define _USBE0CSR3_SOFTCONE_MASK                 0x02000000
//#define _USBE0CSR3_SOFTCONE_LENGTH               0x00000001

//#define _USBE0CSR3_DYNFIFOS_POSITION             0x0000001A
//#define _USBE0CSR3_DYNFIFOS_MASK                 0x04000000
//#define _USBE0CSR3_DYNFIFOS_LENGTH               0x00000001

//#define _USBE0CSR3_HBTXEN_POSITION               0x0000001B
//#define _USBE0CSR3_HBTXEN_MASK                   0x08000000
//#define _USBE0CSR3_HBTXEN_LENGTH                 0x00000001

//#define _USBE0CSR3_HBRXEN_POSITION               0x0000001C
//#define _USBE0CSR3_HBRXEN_MASK                   0x10000000
//#define _USBE0CSR3_HBRXEN_LENGTH                 0x00000001

//#define _USBE0CSR3_BIGEND_POSITION               0x0000001D
//#define _USBE0CSR3_BIGEND_MASK                   0x20000000
//#define _USBE0CSR3_BIGEND_LENGTH                 0x00000001

//#define _USBE0CSR3_MPTXEN_POSITION               0x0000001E
//#define _USBE0CSR3_MPTXEN_MASK                   0x40000000
//#define _USBE0CSR3_MPTXEN_LENGTH                 0x00000001

//#define _USBE0CSR3_MPRXEN_POSITION               0x0000001F
//#define _USBE0CSR3_MPRXEN_MASK                   0x80000000
//#define _USBE0CSR3_MPRXEN_LENGTH                 0x00000001

//#define _USBE1CSR0_TXMAXP_POSITION               0x00000000
//#define _USBE1CSR0_TXMAXP_MASK                   0x000007FF
//#define _USBE1CSR0_TXMAXP_LENGTH                 0x0000000B

//#define _USBE1CSR0_MULT_POSITION                 0x0000000B
//#define _USBE1CSR0_MULT_MASK                     0x0000F800
//#define _USBE1CSR0_MULT_LENGTH                   0x00000005

//#define _USBE1CSR0_TXPKTRDY_POSITION             0x00000010
//#define _USBE1CSR0_TXPKTRDY_MASK                 0x00010000
//#define _USBE1CSR0_TXPKTRDY_LENGTH               0x00000001

//#define _USBE1CSR0_FIFONE_POSITION               0x00000011
//#define _USBE1CSR0_FIFONE_MASK                   0x00020000
//#define _USBE1CSR0_FIFONE_LENGTH                 0x00000001

//#define _USBE1CSR0_ERROR_POSITION                0x00000012
//#define _USBE1CSR0_ERROR_MASK                    0x00040000
//#define _USBE1CSR0_ERROR_LENGTH                  0x00000001

//#define _USBE1CSR0_FLUSH_POSITION                0x00000013
//#define _USBE1CSR0_FLUSH_MASK                    0x00080000
//#define _USBE1CSR0_FLUSH_LENGTH                  0x00000001

//#define _USBE1CSR0_SETUPPKT_POSITION             0x00000014
//#define _USBE1CSR0_SETUPPKT_MASK                 0x00100000
//#define _USBE1CSR0_SETUPPKT_LENGTH               0x00000001

//#define _USBE1CSR0_RXSTALL_POSITION              0x00000015
//#define _USBE1CSR0_RXSTALL_MASK                  0x00200000
//#define _USBE1CSR0_RXSTALL_LENGTH                0x00000001

//#define _USBE1CSR0_CLRDT_POSITION                0x00000016
//#define _USBE1CSR0_CLRDT_MASK                    0x00400000
//#define _USBE1CSR0_CLRDT_LENGTH                  0x00000001

//#define _USBE1CSR0_NAKTMOUT_POSITION             0x00000017
//#define _USBE1CSR0_NAKTMOUT_MASK                 0x00800000
//#define _USBE1CSR0_NAKTMOUT_LENGTH               0x00000001

//#define _USBE1CSR0_DATATGGL_POSITION             0x00000018
//#define _USBE1CSR0_DATATGGL_MASK                 0x01000000
//#define _USBE1CSR0_DATATGGL_LENGTH               0x00000001

//#define _USBE1CSR0_DTWREN_POSITION               0x00000019
//#define _USBE1CSR0_DTWREN_MASK                   0x02000000
//#define _USBE1CSR0_DTWREN_LENGTH                 0x00000001

//#define _USBE1CSR0_DMAREQMD_POSITION             0x0000001A
//#define _USBE1CSR0_DMAREQMD_MASK                 0x04000000
//#define _USBE1CSR0_DMAREQMD_LENGTH               0x00000001

//#define _USBE1CSR0_FRCDATTG_POSITION             0x0000001B
//#define _USBE1CSR0_FRCDATTG_MASK                 0x08000000
//#define _USBE1CSR0_FRCDATTG_LENGTH               0x00000001

//#define _USBE1CSR0_DMAREQEN_POSITION             0x0000001C
//#define _USBE1CSR0_DMAREQEN_MASK                 0x10000000
//#define _USBE1CSR0_DMAREQEN_LENGTH               0x00000001

//#define _USBE1CSR0_MODE_POSITION                 0x0000001D
//#define _USBE1CSR0_MODE_MASK                     0x20000000
//#define _USBE1CSR0_MODE_LENGTH                   0x00000001

//#define _USBE1CSR0_AUTOSET_POSITION              0x0000001F
//#define _USBE1CSR0_AUTOSET_MASK                  0x80000000
//#define _USBE1CSR0_AUTOSET_LENGTH                0x00000001

//#define _USBE1CSR0_UNDERRUN_POSITION             0x00000012
//#define _USBE1CSR0_UNDERRUN_MASK                 0x00040000
//#define _USBE1CSR0_UNDERRUN_LENGTH               0x00000001

