HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBE7CSR1_FLUSH_POSITION                0x00000014
//#define _USBE7CSR1_FLUSH_MASK                    0x00100000
//#define _USBE7CSR1_FLUSH_LENGTH                  0x00000001

//#define _USBE7CSR1_REQPKT_POSITION               0x00000015
//#define _USBE7CSR1_REQPKT_MASK                   0x00200000
//#define _USBE7CSR1_REQPKT_LENGTH                 0x00000001

//#define _USBE7CSR1_RXSTALL_POSITION              0x00000016
//#define _USBE7CSR1_RXSTALL_MASK                  0x00400000
//#define _USBE7CSR1_RXSTALL_LENGTH                0x00000001

//#define _USBE7CSR1_CLRDT_POSITION                0x00000017
//#define _USBE7CSR1_CLRDT_MASK                    0x00800000
//#define _USBE7CSR1_CLRDT_LENGTH                  0x00000001

//#define _USBE7CSR1_INCOMPRX_POSITION             0x00000018
//#define _USBE7CSR1_INCOMPRX_MASK                 0x01000000
//#define _USBE7CSR1_INCOMPRX_LENGTH               0x00000001

//#define _USBE7CSR1_DATATGGL_POSITION             0x00000019
//#define _USBE7CSR1_DATATGGL_MASK                 0x02000000
//#define _USBE7CSR1_DATATGGL_LENGTH               0x00000001

//#define _USBE7CSR1_DATATWEN_POSITION             0x0000001A
//#define _USBE7CSR1_DATATWEN_MASK                 0x04000000
//#define _USBE7CSR1_DATATWEN_LENGTH               0x00000001

//#define _USBE7CSR1_DMAREQMD_POSITION             0x0000001B
//#define _USBE7CSR1_DMAREQMD_MASK                 0x08000000
//#define _USBE7CSR1_DMAREQMD_LENGTH               0x00000001

//#define _USBE7CSR1_PIDERR_POSITION               0x0000001C
//#define _USBE7CSR1_PIDERR_MASK                   0x10000000
//#define _USBE7CSR1_PIDERR_LENGTH                 0x00000001

//#define _USBE7CSR1_DMAREQEN_POSITION             0x0000001D
//#define _USBE7CSR1_DMAREQEN_MASK                 0x20000000
//#define _USBE7CSR1_DMAREQEN_LENGTH               0x00000001

//#define _USBE7CSR1_AUTORQ_POSITION               0x0000001E
//#define _USBE7CSR1_AUTORQ_MASK                   0x40000000
//#define _USBE7CSR1_AUTORQ_LENGTH                 0x00000001

//#define _USBE7CSR1_AUTOCLR_POSITION              0x0000001F
//#define _USBE7CSR1_AUTOCLR_MASK                  0x80000000
//#define _USBE7CSR1_AUTOCLR_LENGTH                0x00000001

//#define _USBE7CSR1_UNDERRUN_POSITION             0x00000012
//#define _USBE7CSR1_UNDERRUN_MASK                 0x00040000
//#define _USBE7CSR1_UNDERRUN_LENGTH               0x00000001

//#define _USBE7CSR1_SENDSTALL_POSITION            0x00000014
//#define _USBE7CSR1_SENDSTALL_MASK                0x00100000
//#define _USBE7CSR1_SENDSTALL_LENGTH              0x00000001

//#define _USBE7CSR1_SENTSTALL_POSITION            0x00000015
//#define _USBE7CSR1_SENTSTALL_MASK                0x00200000
//#define _USBE7CSR1_SENTSTALL_LENGTH              0x00000001

//#define _USBE7CSR1_INCOMPTX_POSITION             0x00000017
//#define _USBE7CSR1_INCOMPTX_MASK                 0x00800000
//#define _USBE7CSR1_INCOMPTX_LENGTH               0x00000001

//#define _USBE7CSR1_ISO_POSITION                  0x0000001E
//#define _USBE7CSR1_ISO_MASK                      0x40000000
//#define _USBE7CSR1_ISO_LENGTH                    0x00000001

//#define _USBE7CSR2_RXCNT_POSITION                0x00000000
//#define _USBE7CSR2_RXCNT_MASK                    0x00003FFF
//#define _USBE7CSR2_RXCNT_LENGTH                  0x0000000E

//#define _USBE7CSR2_TEP_POSITION                  0x00000010
//#define _USBE7CSR2_TEP_MASK                      0x000F0000
//#define _USBE7CSR2_TEP_LENGTH                    0x00000004

//#define _USBE7CSR2_PROTOCOL_POSITION             0x00000014
//#define _USBE7CSR2_PROTOCOL_MASK                 0x00300000
//#define _USBE7CSR2_PROTOCOL_LENGTH               0x00000002

//#define _USBE7CSR2_SPEED_POSITION                0x00000016
//#define _USBE7CSR2_SPEED_MASK                    0x00C00000
//#define _USBE7CSR2_SPEED_LENGTH                  0x00000002

//#define _USBE7CSR2_TXINTERV_POSITION             0x00000018
//#define _USBE7CSR2_TXINTERV_MASK                 0xFF000000
//#define _USBE7CSR2_TXINTERV_LENGTH               0x00000008

//#define _USBE7CSR3_TEP_POSITION                  0x00000000
//#define _USBE7CSR3_TEP_MASK                      0x0000000F
//#define _USBE7CSR3_TEP_LENGTH                    0x00000004

//#define _USBE7CSR3_PROTOCOL_POSITION             0x00000004
//#define _USBE7CSR3_PROTOCOL_MASK                 0x00000030
//#define _USBE7CSR3_PROTOCOL_LENGTH               0x00000002

//#define _USBE7CSR3_SPEED_POSITION                0x00000006
//#define _USBE7CSR3_SPEED_MASK                    0x000000C0
//#define _USBE7CSR3_SPEED_LENGTH                  0x00000002

//#define _USBE7CSR3_RXINTERV_POSITION             0x00000008
//#define _USBE7CSR3_RXINTERV_MASK                 0x0000FF00
//#define _USBE7CSR3_RXINTERV_LENGTH               0x00000008

//#define _USBE7CSR3_TXFIFOSZ_POSITION             0x00000018
//#define _USBE7CSR3_TXFIFOSZ_MASK                 0x0F000000
//#define _USBE7CSR3_TXFIFOSZ_LENGTH               0x00000004

//#define _USBE7CSR3_RXFIFOSZ_POSITION             0x0000001C
//#define _USBE7CSR3_RXFIFOSZ_MASK                 0xF0000000
//#define _USBE7CSR3_RXFIFOSZ_LENGTH               0x00000004

//#define _USBDMAINT_DMA1IF_POSITION               0x00000000
//#define _USBDMAINT_DMA1IF_MASK                   0x00000001
//#define _USBDMAINT_DMA1IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA2IF_POSITION               0x00000001
//#define _USBDMAINT_DMA2IF_MASK                   0x00000002
//#define _USBDMAINT_DMA2IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA3IF_POSITION               0x00000002
//#define _USBDMAINT_DMA3IF_MASK                   0x00000004
//#define _USBDMAINT_DMA3IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA4IF_POSITION               0x00000003
//#define _USBDMAINT_DMA4IF_MASK                   0x00000008
//#define _USBDMAINT_DMA4IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA5IF_POSITION               0x00000004
//#define _USBDMAINT_DMA5IF_MASK                   0x00000010
//#define _USBDMAINT_DMA5IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA6IF_POSITION               0x00000005
//#define _USBDMAINT_DMA6IF_MASK                   0x00000020
//#define _USBDMAINT_DMA6IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA7IF_POSITION               0x00000006
//#define _USBDMAINT_DMA7IF_MASK                   0x00000040
//#define _USBDMAINT_DMA7IF_LENGTH                 0x00000001

//#define _USBDMAINT_DMA8IF_POSITION               0x00000007
//#define _USBDMAINT_DMA8IF_MASK                   0x00000080
//#define _USBDMAINT_DMA8IF_LENGTH                 0x00000001

//#define _USBDMA1C_DMAEN_POSITION                 0x00000000
//#define _USBDMA1C_DMAEN_MASK                     0x00000001
//#define _USBDMA1C_DMAEN_LENGTH                   0x00000001

//#define _USBDMA1C_DMADIR_POSITION                0x00000001
//#define _USBDMA1C_DMADIR_MASK                    0x00000002
//#define _USBDMA1C_DMADIR_LENGTH                  0x00000001

//#define _USBDMA1C_DMAMODE_POSITION               0x00000002
//#define _USBDMA1C_DMAMODE_MASK                   0x00000004
//#define _USBDMA1C_DMAMODE_LENGTH                 0x00000001

//#define _USBDMA1C_DMAIE_POSITION                 0x00000003
//#define _USBDMA1C_DMAIE_MASK                     0x00000008
//#define _USBDMA1C_DMAIE_LENGTH                   0x00000001

//#define _USBDMA1C_DMAEP_POSITION                 0x00000004
//#define _USBDMA1C_DMAEP_MASK                     0x000000F0
//#define _USBDMA1C_DMAEP_LENGTH                   0x00000004

