HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBDMA5C_DMAERR_POSITION                0x00000008
//#define _USBDMA5C_DMAERR_MASK                    0x00000100
//#define _USBDMA5C_DMAERR_LENGTH                  0x00000001

//#define _USBDMA5C_DMABRSTM_POSITION              0x00000009
//#define _USBDMA5C_DMABRSTM_MASK                  0x00000600
//#define _USBDMA5C_DMABRSTM_LENGTH                0x00000002

//#define _USBDMA5A_DMAADDR_POSITION               0x00000000
//#define _USBDMA5A_DMAADDR_MASK                   0xFFFFFFFF
//#define _USBDMA5A_DMAADDR_LENGTH                 0x00000020

//#define _USBDMA5N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA5N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA5N_DMACOUNT_LENGTH                0x00000020

//#define _USBDMA6C_DMAEN_POSITION                 0x00000000
//#define _USBDMA6C_DMAEN_MASK                     0x00000001
//#define _USBDMA6C_DMAEN_LENGTH                   0x00000001

//#define _USBDMA6C_DMADIR_POSITION                0x00000001
//#define _USBDMA6C_DMADIR_MASK                    0x00000002
//#define _USBDMA6C_DMADIR_LENGTH                  0x00000001

//#define _USBDMA6C_DMAMODE_POSITION               0x00000002
//#define _USBDMA6C_DMAMODE_MASK                   0x00000004
//#define _USBDMA6C_DMAMODE_LENGTH                 0x00000001

//#define _USBDMA6C_DMAIE_POSITION                 0x00000003
//#define _USBDMA6C_DMAIE_MASK                     0x00000008
//#define _USBDMA6C_DMAIE_LENGTH                   0x00000001

//#define _USBDMA6C_DMAEP_POSITION                 0x00000004
//#define _USBDMA6C_DMAEP_MASK                     0x000000F0
//#define _USBDMA6C_DMAEP_LENGTH                   0x00000004

//#define _USBDMA6C_DMAERR_POSITION                0x00000008
//#define _USBDMA6C_DMAERR_MASK                    0x00000100
//#define _USBDMA6C_DMAERR_LENGTH                  0x00000001

//#define _USBDMA6C_DMABRSTM_POSITION              0x00000009
//#define _USBDMA6C_DMABRSTM_MASK                  0x00000600
//#define _USBDMA6C_DMABRSTM_LENGTH                0x00000002

//#define _USBDMA6A_DMAADDR_POSITION               0x00000000
//#define _USBDMA6A_DMAADDR_MASK                   0xFFFFFFFF
//#define _USBDMA6A_DMAADDR_LENGTH                 0x00000020

//#define _USBDMA6N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA6N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA6N_DMACOUNT_LENGTH                0x00000020

//#define _USBDMA7C_DMAEN_POSITION                 0x00000000
//#define _USBDMA7C_DMAEN_MASK                     0x00000001
//#define _USBDMA7C_DMAEN_LENGTH                   0x00000001

//#define _USBDMA7C_DMADIR_POSITION                0x00000001
//#define _USBDMA7C_DMADIR_MASK                    0x00000002
//#define _USBDMA7C_DMADIR_LENGTH                  0x00000001

//#define _USBDMA7C_DMAMODE_POSITION               0x00000002
//#define _USBDMA7C_DMAMODE_MASK                   0x00000004
//#define _USBDMA7C_DMAMODE_LENGTH                 0x00000001

//#define _USBDMA7C_DMAIE_POSITION                 0x00000003
//#define _USBDMA7C_DMAIE_MASK                     0x00000008
//#define _USBDMA7C_DMAIE_LENGTH                   0x00000001

//#define _USBDMA7C_DMAEP_POSITION                 0x00000004
//#define _USBDMA7C_DMAEP_MASK                     0x000000F0
//#define _USBDMA7C_DMAEP_LENGTH                   0x00000004

//#define _USBDMA7C_DMAERR_POSITION                0x00000008
//#define _USBDMA7C_DMAERR_MASK                    0x00000100
//#define _USBDMA7C_DMAERR_LENGTH                  0x00000001

//#define _USBDMA7C_DMABRSTM_POSITION              0x00000009
//#define _USBDMA7C_DMABRSTM_MASK                  0x00000600
//#define _USBDMA7C_DMABRSTM_LENGTH                0x00000002

//#define _USBDMA7A_DMAADDR_POSITION               0x00000000
//#define _USBDMA7A_DMAADDR_MASK                   0xFFFFFFFF
//#define _USBDMA7A_DMAADDR_LENGTH                 0x00000020

//#define _USBDMA7N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA7N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA7N_DMACOUNT_LENGTH                0x00000020

//#define _USBDMA8C_DMAEN_POSITION                 0x00000000
//#define _USBDMA8C_DMAEN_MASK                     0x00000001
//#define _USBDMA8C_DMAEN_LENGTH                   0x00000001

//#define _USBDMA8C_DMADIR_POSITION                0x00000001
//#define _USBDMA8C_DMADIR_MASK                    0x00000002
//#define _USBDMA8C_DMADIR_LENGTH                  0x00000001

//#define _USBDMA8C_DMAMODE_POSITION               0x00000002
//#define _USBDMA8C_DMAMODE_MASK                   0x00000004
//#define _USBDMA8C_DMAMODE_LENGTH                 0x00000001

//#define _USBDMA8C_DMAIE_POSITION                 0x00000003
//#define _USBDMA8C_DMAIE_MASK                     0x00000008
//#define _USBDMA8C_DMAIE_LENGTH                   0x00000001

//#define _USBDMA8C_DMAEP_POSITION                 0x00000004
//#define _USBDMA8C_DMAEP_MASK                     0x000000F0
//#define _USBDMA8C_DMAEP_LENGTH                   0x00000004

//#define _USBDMA8C_DMAERR_POSITION                0x00000008
//#define _USBDMA8C_DMAERR_MASK                    0x00000100
//#define _USBDMA8C_DMAERR_LENGTH                  0x00000001

//#define _USBDMA8C_DMABRSTM_POSITION              0x00000009
//#define _USBDMA8C_DMABRSTM_MASK                  0x00000600
//#define _USBDMA8C_DMABRSTM_LENGTH                0x00000002

//#define _USBDMA8A_DMAADDR_POSITION               0x00000000
//#define _USBDMA8A_DMAADDR_MASK                   0xFFFFFFFF
//#define _USBDMA8A_DMAADDR_LENGTH                 0x00000020

//#define _USBDMA8N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA8N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA8N_DMACOUNT_LENGTH                0x00000020

//#define _USBE1RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE1RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE1RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE2RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE2RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE2RPC_RQPKTCNT_LENGTH                0x00000010

