HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _USBLPMR1_LPMRESIE_POSITION              0x0000001C
//#define _USBLPMR1_LPMRESIE_MASK                  0x10000000
//#define _USBLPMR1_LPMRESIE_LENGTH                0x00000001

//#define _USBLPMR1_LPMERRIE_POSITION              0x0000001D
//#define _USBLPMR1_LPMERRIE_MASK                  0x20000000
//#define _USBLPMR1_LPMERRIE_LENGTH                0x00000001

//#define _USBLMPR2_LPMST_POSITION                 0x00000000
//#define _USBLMPR2_LPMST_MASK                     0x00000001
//#define _USBLMPR2_LPMST_LENGTH                   0x00000001

//#define _USBLMPR2_LPMNY_POSITION                 0x00000001
//#define _USBLMPR2_LPMNY_MASK                     0x00000002
//#define _USBLMPR2_LPMNY_LENGTH                   0x00000001

//#define _USBLMPR2_LPMACK_POSITION                0x00000002
//#define _USBLMPR2_LPMACK_MASK                    0x00000004
//#define _USBLMPR2_LPMACK_LENGTH                  0x00000001

//#define _USBLMPR2_LPMNC_POSITION                 0x00000003
//#define _USBLMPR2_LPMNC_MASK                     0x00000008
//#define _USBLMPR2_LPMNC_LENGTH                   0x00000001

//#define _USBLMPR2_LPMRES_POSITION                0x00000004
//#define _USBLMPR2_LPMRES_MASK                    0x00000010
//#define _USBLMPR2_LPMRES_LENGTH                  0x00000001

//#define _USBLMPR2_LPMERR_POSITION                0x00000005
//#define _USBLMPR2_LPMERR_MASK                    0x00000020
//#define _USBLMPR2_LPMERR_LENGTH                  0x00000001

//#define _USBLMPR2_LPMFADDR_POSITION              0x00000008
//#define _USBLMPR2_LPMFADDR_MASK                  0x00007F00
//#define _USBLMPR2_LPMFADDR_LENGTH                0x00000007

//#define _CEVER_ID_POSITION                       0x00000000
//#define _CEVER_ID_MASK                           0x0000FFFF
//#define _CEVER_ID_LENGTH                         0x00000010

//#define _CEVER_VERSION_POSITION                  0x00000010
//#define _CEVER_VERSION_MASK                      0x00FF0000
//#define _CEVER_VERSION_LENGTH                    0x00000008

//#define _CEVER_REVISION_POSITION                 0x00000018
//#define _CEVER_REVISION_MASK                     0xFF000000
//#define _CEVER_REVISION_LENGTH                   0x00000008

//#define _CECON_DMAEN_POSITION                    0x00000000
//#define _CECON_DMAEN_MASK                        0x00000001
//#define _CECON_DMAEN_LENGTH                      0x00000001

//#define _CECON_BDPPLEN_POSITION                  0x00000001
//#define _CECON_BDPPLEN_MASK                      0x00000002
//#define _CECON_BDPPLEN_LENGTH                    0x00000001

//#define _CECON_BDPCHST_POSITION                  0x00000002
//#define _CECON_BDPCHST_MASK                      0x00000004
//#define _CECON_BDPCHST_LENGTH                    0x00000001

//#define _CECON_SWAPEN_POSITION                   0x00000005
//#define _CECON_SWAPEN_MASK                       0x00000020
//#define _CECON_SWAPEN_LENGTH                     0x00000001

//#define _CECON_SWRST_POSITION                    0x00000006
//#define _CECON_SWRST_MASK                        0x00000040
//#define _CECON_SWRST_LENGTH                      0x00000001

//#define _CEBDADDR_BDPADDR_POSITION               0x00000000
//#define _CEBDADDR_BDPADDR_MASK                   0xFFFFFFFF
//#define _CEBDADDR_BDPADDR_LENGTH                 0x00000020

//#define _CEBDPADDR_BASEADDR_POSITION             0x00000000
//#define _CEBDPADDR_BASEADDR_MASK                 0xFFFFFFFF
//#define _CEBDPADDR_BASEADDR_LENGTH               0x00000020

//#define _CESTAT_BDCTRL_POSITION                  0x00000000
//#define _CESTAT_BDCTRL_MASK                      0x0000FFFF
//#define _CESTAT_BDCTRL_LENGTH                    0x00000010

//#define _CESTAT_ACTIVE_POSITION                  0x00000010
//#define _CESTAT_ACTIVE_MASK                      0x00010000
//#define _CESTAT_ACTIVE_LENGTH                    0x00000001

//#define _CESTAT_START_POSITION                   0x00000011
//#define _CESTAT_START_MASK                       0x00020000
//#define _CESTAT_START_LENGTH                     0x00000001

//#define _CESTAT_BDSTATE_POSITION                 0x00000012
//#define _CESTAT_BDSTATE_MASK                     0x003C0000
//#define _CESTAT_BDSTATE_LENGTH                   0x00000004

//#define _CESTAT_ERRPHASE_POSITION                0x00000018
//#define _CESTAT_ERRPHASE_MASK                    0x03000000
//#define _CESTAT_ERRPHASE_LENGTH                  0x00000002

//#define _CESTAT_ERROP_POSITION                   0x0000001A
//#define _CESTAT_ERROP_MASK                       0x1C000000
//#define _CESTAT_ERROP_LENGTH                     0x00000003

//#define _CESTAT_ERRMODE_POSITION                 0x0000001D
//#define _CESTAT_ERRMODE_MASK                     0xE0000000
//#define _CESTAT_ERRMODE_LENGTH                   0x00000003

//#define _CEINTSRC_PENDIF_POSITION                0x00000000
//#define _CEINTSRC_PENDIF_MASK                    0x00000001
//#define _CEINTSRC_PENDIF_LENGTH                  0x00000001

//#define _CEINTSRC_CBDIF_POSITION                 0x00000001
//#define _CEINTSRC_CBDIF_MASK                     0x00000002
//#define _CEINTSRC_CBDIF_LENGTH                   0x00000001

//#define _CEINTSRC_PKTIF_POSITION                 0x00000002
//#define _CEINTSRC_PKTIF_MASK                     0x00000004
//#define _CEINTSRC_PKTIF_LENGTH                   0x00000001

//#define _CEINTSRC_AREIF_POSITION                 0x00000003
//#define _CEINTSRC_AREIF_MASK                     0x00000008
//#define _CEINTSRC_AREIF_LENGTH                   0x00000001

//#define _CEINTEN_PENDIE_POSITION                 0x00000000
//#define _CEINTEN_PENDIE_MASK                     0x00000001
//#define _CEINTEN_PENDIE_LENGTH                   0x00000001

//#define _CEINTEN_CBDIE_POSITION                  0x00000001
//#define _CEINTEN_CBDIE_MASK                      0x00000002
//#define _CEINTEN_CBDIE_LENGTH                    0x00000001

//#define _CEINTEN_PKTIE_POSITION                  0x00000002
//#define _CEINTEN_PKTIE_MASK                      0x00000004
//#define _CEINTEN_PKTIE_LENGTH                    0x00000001

