HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _SEQ0_w_POSITION                         0x00000000
//#define _SEQ0_w_MASK                             0xFFFFFFFF
//#define _SEQ0_w_LENGTH                           0x00000020

//#define _DEVADC1_ADCCALDATA_POSITION             0x00000000
//#define _DEVADC1_ADCCALDATA_MASK                 0xFFFFFFFF
//#define _DEVADC1_ADCCALDATA_LENGTH               0x00000020

//#define _DEVADC1_w_POSITION                      0x00000000
//#define _DEVADC1_w_MASK                          0xFFFFFFFF
//#define _DEVADC1_w_LENGTH                        0x00000020

//#define _DEVADC2_ADCCALDATA_POSITION             0x00000000
//#define _DEVADC2_ADCCALDATA_MASK                 0xFFFFFFFF
//#define _DEVADC2_ADCCALDATA_LENGTH               0x00000020

//#define _DEVADC2_w_POSITION                      0x00000000
//#define _DEVADC2_w_MASK                          0xFFFFFFFF
//#define _DEVADC2_w_LENGTH                        0x00000020

//#define _DEVADC3_ADCCALDATA_POSITION             0x00000000
//#define _DEVADC3_ADCCALDATA_MASK                 0xFFFFFFFF
//#define _DEVADC3_ADCCALDATA_LENGTH               0x00000020

//#define _DEVADC3_w_POSITION                      0x00000000
//#define _DEVADC3_w_MASK                          0xFFFFFFFF
//#define _DEVADC3_w_LENGTH                        0x00000020

//#define _DEVADC4_ADCCALDATA_POSITION             0x00000000
//#define _DEVADC4_ADCCALDATA_MASK                 0xFFFFFFFF
//#define _DEVADC4_ADCCALDATA_LENGTH               0x00000020

//#define _DEVADC4_w_POSITION                      0x00000000
//#define _DEVADC4_w_MASK                          0xFFFFFFFF
//#define _DEVADC4_w_LENGTH                        0x00000020

//#define _DEVADC5_ADCCALDATA_POSITION             0x00000000
//#define _DEVADC5_ADCCALDATA_MASK                 0xFFFFFFFF
//#define _DEVADC5_ADCCALDATA_LENGTH               0x00000020

//#define _DEVADC5_w_POSITION                      0x00000000
//#define _DEVADC5_w_MASK                          0xFFFFFFFF
//#define _DEVADC5_w_LENGTH                        0x00000020

//#define _DEVSN0_SN_POSITION                      0x00000000
//#define _DEVSN0_SN_MASK                          0xFFFFFFFF
//#define _DEVSN0_SN_LENGTH                        0x00000020

//#define _DEVSN0_w_POSITION                       0x00000000
//#define _DEVSN0_w_MASK                           0xFFFFFFFF
//#define _DEVSN0_w_LENGTH                         0x00000020

//#define _DEVSN1_SN_POSITION                      0x00000000
//#define _DEVSN1_SN_MASK                          0xFFFFFFFF
//#define _DEVSN1_SN_LENGTH                        0x00000020

//#define _DEVSN1_w_POSITION                       0x00000000
//#define _DEVSN1_w_MASK                           0xFFFFFFFF
//#define _DEVSN1_w_LENGTH                         0x00000020

//#define _ADEVCFG3_USERID_POSITION                0x00000000
//#define _ADEVCFG3_USERID_MASK                    0x0000FFFF
//#define _ADEVCFG3_USERID_LENGTH                  0x00000010

//#define _ADEVCFG3_FMIIEN_POSITION                0x00000018
//#define _ADEVCFG3_FMIIEN_MASK                    0x01000000
//#define _ADEVCFG3_FMIIEN_LENGTH                  0x00000001

//#define _ADEVCFG3_FETHIO_POSITION                0x00000019
//#define _ADEVCFG3_FETHIO_MASK                    0x02000000
//#define _ADEVCFG3_FETHIO_LENGTH                  0x00000001

//#define _ADEVCFG3_PGL1WAY_POSITION               0x0000001B
//#define _ADEVCFG3_PGL1WAY_MASK                   0x08000000
//#define _ADEVCFG3_PGL1WAY_LENGTH                 0x00000001

//#define _ADEVCFG3_PMDL1WAY_POSITION              0x0000001C
//#define _ADEVCFG3_PMDL1WAY_MASK                  0x10000000
//#define _ADEVCFG3_PMDL1WAY_LENGTH                0x00000001

//#define _ADEVCFG3_IOL1WAY_POSITION               0x0000001D
//#define _ADEVCFG3_IOL1WAY_MASK                   0x20000000
//#define _ADEVCFG3_IOL1WAY_LENGTH                 0x00000001

//#define _ADEVCFG3_FUSBIDIO_POSITION              0x0000001E
//#define _ADEVCFG3_FUSBIDIO_MASK                  0x40000000
//#define _ADEVCFG3_FUSBIDIO_LENGTH                0x00000001

//#define _ADEVCFG3_w_POSITION                     0x00000000
//#define _ADEVCFG3_w_MASK                         0xFFFFFFFF
//#define _ADEVCFG3_w_LENGTH                       0x00000020

//#define _ADEVCFG2_FPLLIDIV_POSITION              0x00000000
//#define _ADEVCFG2_FPLLIDIV_MASK                  0x00000007
//#define _ADEVCFG2_FPLLIDIV_LENGTH                0x00000003

//#define _ADEVCFG2_FPLLRNG_POSITION               0x00000004
//#define _ADEVCFG2_FPLLRNG_MASK                   0x00000070
//#define _ADEVCFG2_FPLLRNG_LENGTH                 0x00000003

//#define _ADEVCFG2_FPLLICLK_POSITION              0x00000007
//#define _ADEVCFG2_FPLLICLK_MASK                  0x00000080
//#define _ADEVCFG2_FPLLICLK_LENGTH                0x00000001

//#define _ADEVCFG2_FPLLMULT_POSITION              0x00000008
//#define _ADEVCFG2_FPLLMULT_MASK                  0x00007F00
//#define _ADEVCFG2_FPLLMULT_LENGTH                0x00000007

//#define _ADEVCFG2_FPLLODIV_POSITION              0x00000010
//#define _ADEVCFG2_FPLLODIV_MASK                  0x00070000
//#define _ADEVCFG2_FPLLODIV_LENGTH                0x00000003

//#define _ADEVCFG2_UPLLFSEL_POSITION              0x0000001E
//#define _ADEVCFG2_UPLLFSEL_MASK                  0x40000000
//#define _ADEVCFG2_UPLLFSEL_LENGTH                0x00000001

//#define _ADEVCFG2_UPLLEN_POSITION                0x0000001F
//#define _ADEVCFG2_UPLLEN_MASK                    0x80000000
//#define _ADEVCFG2_UPLLEN_LENGTH                  0x00000001

//#define _ADEVCFG2_w_POSITION                     0x00000000
//#define _ADEVCFG2_w_MASK                         0xFFFFFFFF
//#define _ADEVCFG2_w_LENGTH                       0x00000020

//#define _ADEVCFG1_FNOSC_POSITION                 0x00000000
//#define _ADEVCFG1_FNOSC_MASK                     0x00000007
//#define _ADEVCFG1_FNOSC_LENGTH                   0x00000003

//#define _ADEVCFG1_DMTINTV_POSITION               0x00000003
//#define _ADEVCFG1_DMTINTV_MASK                   0x00000038
//#define _ADEVCFG1_DMTINTV_LENGTH                 0x00000003

//#define _ADEVCFG1_FSOSCEN_POSITION               0x00000006
//#define _ADEVCFG1_FSOSCEN_MASK                   0x00000040
//#define _ADEVCFG1_FSOSCEN_LENGTH                 0x00000001

//#define _ADEVCFG1_IESO_POSITION                  0x00000007
//#define _ADEVCFG1_IESO_MASK                      0x00000080
//#define _ADEVCFG1_IESO_LENGTH                    0x00000001

//#define _ADEVCFG1_POSCMOD_POSITION               0x00000008
//#define _ADEVCFG1_POSCMOD_MASK                   0x00000300
//#define _ADEVCFG1_POSCMOD_LENGTH                 0x00000002

