HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.c
//#define _ABF1DEVCP0_CP_POSITION                  0x0000001C
//#define _ABF1DEVCP0_CP_MASK                      0x10000000
//#define _ABF1DEVCP0_CP_LENGTH                    0x00000001

//#define _ABF1DEVCP0_w_POSITION                   0x00000000
//#define _ABF1DEVCP0_w_MASK                       0xFFFFFFFF
//#define _ABF1DEVCP0_w_LENGTH                     0x00000020

//#define _ABF1SEQ0_TSEQ_POSITION                  0x00000000
//#define _ABF1SEQ0_TSEQ_MASK                      0x0000FFFF
//#define _ABF1SEQ0_TSEQ_LENGTH                    0x00000010

//#define _ABF1SEQ0_CSEQ_POSITION                  0x00000010
//#define _ABF1SEQ0_CSEQ_MASK                      0xFFFF0000
//#define _ABF1SEQ0_CSEQ_LENGTH                    0x00000010

//#define _ABF1SEQ0_w_POSITION                     0x00000000
//#define _ABF1SEQ0_w_MASK                         0xFFFFFFFF
//#define _ABF1SEQ0_w_LENGTH                       0x00000020

//#define _BF1DEVCFG3_USERID_POSITION              0x00000000
//#define _BF1DEVCFG3_USERID_MASK                  0x0000FFFF
//#define _BF1DEVCFG3_USERID_LENGTH                0x00000010

//#define _BF1DEVCFG3_FMIIEN_POSITION              0x00000018
//#define _BF1DEVCFG3_FMIIEN_MASK                  0x01000000
//#define _BF1DEVCFG3_FMIIEN_LENGTH                0x00000001

//#define _BF1DEVCFG3_FETHIO_POSITION              0x00000019
//#define _BF1DEVCFG3_FETHIO_MASK                  0x02000000
//#define _BF1DEVCFG3_FETHIO_LENGTH                0x00000001

//#define _BF1DEVCFG3_PGL1WAY_POSITION             0x0000001B
//#define _BF1DEVCFG3_PGL1WAY_MASK                 0x08000000
//#define _BF1DEVCFG3_PGL1WAY_LENGTH               0x00000001

//#define _BF1DEVCFG3_PMDL1WAY_POSITION            0x0000001C
//#define _BF1DEVCFG3_PMDL1WAY_MASK                0x10000000
//#define _BF1DEVCFG3_PMDL1WAY_LENGTH              0x00000001

//#define _BF1DEVCFG3_IOL1WAY_POSITION             0x0000001D
//#define _BF1DEVCFG3_IOL1WAY_MASK                 0x20000000
//#define _BF1DEVCFG3_IOL1WAY_LENGTH               0x00000001

//#define _BF1DEVCFG3_FUSBIDIO_POSITION            0x0000001E
//#define _BF1DEVCFG3_FUSBIDIO_MASK                0x40000000
//#define _BF1DEVCFG3_FUSBIDIO_LENGTH              0x00000001

//#define _BF1DEVCFG3_w_POSITION                   0x00000000
//#define _BF1DEVCFG3_w_MASK                       0xFFFFFFFF
//#define _BF1DEVCFG3_w_LENGTH                     0x00000020

//#define _BF1DEVCFG2_FPLLIDIV_POSITION            0x00000000
//#define _BF1DEVCFG2_FPLLIDIV_MASK                0x00000007
//#define _BF1DEVCFG2_FPLLIDIV_LENGTH              0x00000003

//#define _BF1DEVCFG2_FPLLRNG_POSITION             0x00000004
//#define _BF1DEVCFG2_FPLLRNG_MASK                 0x00000070
//#define _BF1DEVCFG2_FPLLRNG_LENGTH               0x00000003

//#define _BF1DEVCFG2_FPLLICLK_POSITION            0x00000007
//#define _BF1DEVCFG2_FPLLICLK_MASK                0x00000080
//#define _BF1DEVCFG2_FPLLICLK_LENGTH              0x00000001

//#define _BF1DEVCFG2_FPLLMULT_POSITION            0x00000008
//#define _BF1DEVCFG2_FPLLMULT_MASK                0x00007F00
//#define _BF1DEVCFG2_FPLLMULT_LENGTH              0x00000007

//#define _BF1DEVCFG2_FPLLODIV_POSITION            0x00000010
//#define _BF1DEVCFG2_FPLLODIV_MASK                0x00070000
//#define _BF1DEVCFG2_FPLLODIV_LENGTH              0x00000003

//#define _BF1DEVCFG2_UPLLFSEL_POSITION            0x0000001E
//#define _BF1DEVCFG2_UPLLFSEL_MASK                0x40000000
//#define _BF1DEVCFG2_UPLLFSEL_LENGTH              0x00000001

//#define _BF1DEVCFG2_UPLLEN_POSITION              0x0000001F
//#define _BF1DEVCFG2_UPLLEN_MASK                  0x80000000
//#define _BF1DEVCFG2_UPLLEN_LENGTH                0x00000001

//#define _BF1DEVCFG2_w_POSITION                   0x00000000
//#define _BF1DEVCFG2_w_MASK                       0xFFFFFFFF
//#define _BF1DEVCFG2_w_LENGTH                     0x00000020

//#define _BF1DEVCFG1_FNOSC_POSITION               0x00000000
//#define _BF1DEVCFG1_FNOSC_MASK                   0x00000007
//#define _BF1DEVCFG1_FNOSC_LENGTH                 0x00000003

//#define _BF1DEVCFG1_DMTINTV_POSITION             0x00000003
//#define _BF1DEVCFG1_DMTINTV_MASK                 0x00000038
//#define _BF1DEVCFG1_DMTINTV_LENGTH               0x00000003

//#define _BF1DEVCFG1_FSOSCEN_POSITION             0x00000006
//#define _BF1DEVCFG1_FSOSCEN_MASK                 0x00000040
//#define _BF1DEVCFG1_FSOSCEN_LENGTH               0x00000001

//#define _BF1DEVCFG1_IESO_POSITION                0x00000007
//#define _BF1DEVCFG1_IESO_MASK                    0x00000080
//#define _BF1DEVCFG1_IESO_LENGTH                  0x00000001

//#define _BF1DEVCFG1_POSCMOD_POSITION             0x00000008
//#define _BF1DEVCFG1_POSCMOD_MASK                 0x00000300
//#define _BF1DEVCFG1_POSCMOD_LENGTH               0x00000002

//#define _BF1DEVCFG1_OSCIOFNC_POSITION            0x0000000A
//#define _BF1DEVCFG1_OSCIOFNC_MASK                0x00000400
//#define _BF1DEVCFG1_OSCIOFNC_LENGTH              0x00000001

//#define _BF1DEVCFG1_FCKSM_POSITION               0x0000000E
//#define _BF1DEVCFG1_FCKSM_MASK                   0x0000C000
//#define _BF1DEVCFG1_FCKSM_LENGTH                 0x00000002

//#define _BF1DEVCFG1_WDTPS_POSITION               0x00000010
//#define _BF1DEVCFG1_WDTPS_MASK                   0x001F0000
//#define _BF1DEVCFG1_WDTPS_LENGTH                 0x00000005

//#define _BF1DEVCFG1_WDTSPGM_POSITION             0x00000015
//#define _BF1DEVCFG1_WDTSPGM_MASK                 0x00200000
//#define _BF1DEVCFG1_WDTSPGM_LENGTH               0x00000001

//#define _BF1DEVCFG1_WINDIS_POSITION              0x00000016
//#define _BF1DEVCFG1_WINDIS_MASK                  0x00400000
//#define _BF1DEVCFG1_WINDIS_LENGTH                0x00000001

//#define _BF1DEVCFG1_FWDTEN_POSITION              0x00000017
//#define _BF1DEVCFG1_FWDTEN_MASK                  0x00800000
//#define _BF1DEVCFG1_FWDTEN_LENGTH                0x00000001

//#define _BF1DEVCFG1_FWDTWINSZ_POSITION           0x00000018
//#define _BF1DEVCFG1_FWDTWINSZ_MASK               0x03000000
//#define _BF1DEVCFG1_FWDTWINSZ_LENGTH             0x00000002

//#define _BF1DEVCFG1_DMTCNT_POSITION              0x0000001A
//#define _BF1DEVCFG1_DMTCNT_MASK                  0x7C000000
//#define _BF1DEVCFG1_DMTCNT_LENGTH                0x00000005

//#define _BF1DEVCFG1_FDMTEN_POSITION              0x0000001F
//#define _BF1DEVCFG1_FDMTEN_MASK                  0x80000000
//#define _BF1DEVCFG1_FDMTEN_LENGTH                0x00000001

//#define _BF1DEVCFG1_w_POSITION                   0x00000000
//#define _BF1DEVCFG1_w_MASK                       0xFFFFFFFF
//#define _BF1DEVCFG1_w_LENGTH                     0x00000020

//#define _BF1DEVCFG0_DEBUG_POSITION               0x00000000
//#define _BF1DEVCFG0_DEBUG_MASK                   0x00000003
//#define _BF1DEVCFG0_DEBUG_LENGTH                 0x00000002

//#define _BF1DEVCFG0_JTAGEN_POSITION              0x00000002
//#define _BF1DEVCFG0_JTAGEN_MASK                  0x00000004
//#define _BF1DEVCFG0_JTAGEN_LENGTH                0x00000001

//#define _BF1DEVCFG0_ICESEL_POSITION              0x00000003
//#define _BF1DEVCFG0_ICESEL_MASK                  0x00000018
//#define _BF1DEVCFG0_ICESEL_LENGTH                0x00000002

